{
  "id": 1006,
  "raw": "\nRetrieved from http://en.wikipedia.org/wiki/Tanks_in_France\nText:\nTanks in France\n\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\nSchneider CA1, the first French tank\n\nThis article deals with the history and development of tanks employed by the military of France from their first use in World War I, the interwar period, during World War II, the Cold War and modern era.\n\n\nFrench development into tanks began during World War I as an effort to overcome the stalemate of trench warfare. The Schneider CA1 was the first tank produced by France, and 400 units were built. The French also experimented with various tank designs, such as the Frot-Laffly landship, Boirault machine and Souain experiment. Another 400 Saint-Chamond tanks were manufactured from April 1917 to July 1918, however these tanks were largely underpowered and of limited utility due to the design of the caterpillar tracks, which were too short in comparison with the tank's length and weight.[1] The most significant French tank development during the war was the Renault FT light tank, which set the general layout for future tank designs and was used or redesigned by various military forces, including those of the United States.\n\n\nWorld War I[edit]\n\n\nWhile the British began the design and use of tanks in World War I, France at the same time developed its own tracked AFVs, but the situation there was very different. In Britain a single committee had coordinated design, and had to overcome the initial resistance of the Army, while the major industries remained passive. Almost all production effort was thus concentrated into the Mark I and its direct successors, all very similar in shape. In France, on the other hand, there were multiple and conflicting lines of development which were badly integrated, resulting in three major and quite disparate production types. A major arms producer, Schneider, took the lead in January 1915 and tried to build a first armoured vehicle based on the Baby Holt tractor but initially the development process was slow until in July they received political, even presidential, support by combining their project with that of a mechanical wire cutter devised by engineer and politician Jean-Louis Bréton. In December 1915, the influential Colonel Estienne made the Supreme Command very enthusiastic about the idea of creating an armoured force based on these vehicles; strong Army support for tanks would be a constant during the decades to come. Already in January and February 1916 quite substantial orders were made, at that moment with a total number of 800 much larger than the British ones.\n\nFrench Saint-Chamond tanks had long bodies with a lot of the vehicle projecting forward off of the short caterpillar tracks, making them more liable to get ditched in trenches.\n\nArmy enthusiasm and haste would have its immediate drawbacks however. As a result of the involvement of inexperienced army officers ordered to devise a new tank based on the larger 75 hp Holt chassis in a very short period of time, the first French tanks were poorly designed with respect to the need to cross trenches and did not take the sponson-mounting route of the British tanks. The first, the Char Schneider CA equipped with a short 75 mm howitzer, had poor mobility due to a short track length combined with a hull that overhung front and rear. It was unreliable as well; a maximum of only about 130 of the 400 built were ever operational at the same time. Then industrial rivalry began to play a detrimental role: it created the heavy Char St Chamond, a parallel development not ordered by the Army but approved by government through industrial lobby, which mounted much more impressive weaponry — its 75 mm was the most powerful gun fielded by any operational tank up till 1941 — but also combined many of the Schneider CA's faults with an even larger overhanging body. Its innovative petro-electrical transmission, while allowing for easy steering, was insufficiently developed and led to a large number of breakdowns.\n\nThe Renault FT, the first \"modern\" tank\n\nBut industrial initiative also led to swift advances. The car industry, already used to vehicle mass production and having much more experience in vehicle layout, in 1916 designed the first practical light tanks, a class largely neglected by the British. It would be Renault's excellent small tank design, the FT, incorporating a proper climbing face for the tracks, that was the first tank to incorporate a top-mounted turret with a full 360º traverse capability. In fact the FT was in many respects the first truly 'modern' tank having a layout that has been followed by almost all designs ever since: driver at the front; main armament in a fully rotating turret on top; engine at the rear. Previous models had been \"box tanks\", with a single crowded space combining the role of engine room, fighting compartment, ammunition stock and driver's cabin. (A very similar Peugeot prototype, with a fixed casemate mounting a short 75mm cannon, was trialled in 1918 but the idea was not pursued) The FT would have the largest production run of any tank of the war, with over 3700 built, more numerous than all British tanks combined. That this would happen was at first far from certain; some in the French army lobbied for the alternative mass production of super-heavy tanks. Much design effort was put in this line of development resulting in the gigantic Char 2C, the most complex and technologically advanced tank of its day. Its very complexity ensured it being produced too late to participate in World War I and in the very small number of just ten, but it would be the first tank with a three-man turret; the heaviest to enter service until late in World War II and still the largest ever operational.\n\nFrench production at first lagged behind the British. After August 1916 however, British tank manufacture was temporarily halted to wait for better designs, allowing the French to overtake their allies in numbers. When the French used tanks for the first time on 16 April 1917, during the Nivelle Offensive, they had four times more tanks available. But that would not last long as the offensive was a major failure; the Schneiders were badly deployed and suffered 50% losses from German long-range artillery. The Saint-Chamond tanks, first deployed on 5 May, proved to be so badly designed that they were unable to cross the first line of German trenches.\n\nInter War[edit]\n\nThe French used a very wide range of tanks, including many unique types. France was the second largest tank producer in the world, behind the Soviet Union (see French armoured fighting vehicle production during World War II). Their cavalry tank class filled the role of what are now called MBTs. They also fielded a heavy tank design, and several lighter types for scouting and infantry support. In addition to these types, they were also working on super-heavy breakthrough tanks (FCM F1). The French didn't have an independent Tank Corps. All tanks belonged to either the Infantry or the Cavalry.\n\nThe French Renault R 35 tank\n  • Infantry Tanks (Chars)\n    • Light Tanks (Chars Légers), generally similar to other nations' light tanks, though they were intended to be used more for infantry support rather than scouting, and as such were better armoured but slower than many other light tanks. The Renault R 35 was the most common type; small numbers of the futuristic FCM 36 were built. The R 35 was also exported to several eastern European countries, including Poland.\n    • Medium Tanks (Chars de Bataille), these were in fact meant to be specialised breakthrough tanks (Char D1, Char D2, Char B1).\n    • Heavy Tanks (Chars Lourds); only the WWI-vintage Char 2C was ever operational in this class, being the reason why the breakthrough role was delegated to the Chars de Bataille.\n  • Cavalry Tanks (Automitrailleuses). These classes focused on speed in addition to the power and protection of other tank designs, and were intended for both anti-tank and anti-personnel work. As by law all tanks (Chars) had to be part of the Infantry, the Cavalry called its tanks Automitrailleuses. These included the Hotchkiss H35.\n    • Armoured Combat Tanks (AMCs or Automitrailleuses de Combat), a medium tank that sacrificed some armour for speed, and had similar armament to the infantry tanks (AMC 34, AMC 35, SOMUA S35).\n    • Armoured Reconnaissance (AMRs or Automitrailleuses de Reconnaissance), essentially light tanks (AMR 33;AMR 35), but specifically intended for general reconnaissance and maintaining a security screen. Specialised reconnaissance however would be carried out by AMD's or Automitrailleuses de Découverte, typically armoured cars or half-tracks.\nFrench 13.2 mm-armed AMR 35s, belonging to 4e RDP, 1re DLM.\n\nThe Renault FT 17 had a long life and saw use in WWII and even later in Indochina. It was utilised as far away as in China, during the Chinese Civil wars, and versions of the tank were used both against and by the Japanese during the invasion of China. A large number found their way into both Republican and Nationalist hands during the Spanish Civil War. They were used in the Russian Revolution by both the Bolsheviks and the White Russians, and later by the Finns against the Soviets. France exported the FT 17 right up to World War II. The design was also developed by the Italians as the Fiat 3000 and the USSR as the T-18.\n\nBy the mid-1930s the French Army was replacing the aging FT 17 fleet with a mixed force of light tanks both in the Infantry and Cavalry branches, as well as medium and heavy tanks. The Infantry light tanks included the Renault R 35, which followed the FT 17 concept quite closely with its very small size, two-man crew, and short 37 mm gun armament. It was, however, heavily armored. The R 35 was mostly used to equip the independent tank battalions, an armoured reserve allocated at army level and intended to reinforce infantry divisions in breakthrough operations. French infantry divisions normally had no organic tank component. The R 35 was exported to Poland and Romania. The cavalry had the similar Hotchkiss H 35, armed with the same 37 mm, as well as light recon tanks such as the AMR 35.\n\nFrance also produced what may have been the best tank of the 1930s, the SOMUA S35. This tank equipped the armoured divisions of the Cavalry which had to execute the exploitation phase of a battle and was probably the best combination of armour, firepower and mobility prior to the appearance of the German PzKpfw IV Ausf. F2 and Soviet T-34. The S 35 had a long 47 mm gun that could kill any tank then in service, as well as heavy cast armour and good speed.\n\nA Char B1 bis at the Musée des Blindés at Saumur\n\nThe French char de bataille Char B tank was a very formidable tank, with heavy cast and riveted armour, the same long 47 mm gun as in the S 35, and a hull-mounted 75 mm howitzer. All Char Bs were equipped with radio and the tank was nearly invulnerable to most tanks and towed antitank guns. They equipped the armoured divisions of the Infantry, which were specialised breakthrough units.\n\nChar D1 with ST2 turret in 1936\n\nThe French plan of 1926, calling for the creation of a Light Infantry Support Tank, led to the development of the existing Renault NC1 prototype into the Char D1. On 23 December 1930 a first order of 70 main production series of Char D1 tanks was made, followed on 12 July 1932 by a second order of 30; the last order on 16 October 1933 was of 50 vehicles, for a total of 150, delivered between January 1932 and early 1935.\n\nIn general, French tanks of the 1930s were well-armoured, innovative vehicles that owed little to foreign designs. However, the light tanks lacked firepower and almost all French tanks were crippled by their one-man turrets. Even the vaunted Char B had a commander who was tasked with commanding the vehicle, aiming the main gun, and loading the main gun. If he were a platoon leader or company commander, he had the additional tasks of controlling his other units. Such a heavy set of tasks was overwhelming, and greatly reduced the effectiveness of the tanks. The lack of radios with the light tanks was not seen as a major drawback, since French doctrine called for slow-paced, deliberate manoeuvers in close conformance to plans: the \"Methodical Battle\" concept, adopted because wargaming showed it to be superior. The role of small unit leaders was to execute plans, not to take the initiative in combat. This was nearly the opposite of German doctrine, which stressed initiative and decision-making at low command levels (Auftragstaktik). In 1939 a belated effort was made to improve flexibility and increase the number of radios\n\nDespite the views of Estienne and later Charles de Gaulle, the French general staff failed in defining an effective military doctrine regarding their use, due to the division of labour between infantry and cavalry tanks.\n\nWorld War II[edit]\n\nA disabled Char B1 Bis in Northern France, 1940\n\nAt the start of the war, France had one of the largest tank forces in the world along with the Soviet, British and German forces. The French had planned for a defensive war and built tanks accordingly; infantry tanks were designed to be heavily armoured. Within France and its colonies, roughly 5,800 tanks were available during the time of the German offensive, and some when they came into contact were effective against the German tanks.\n\nThe R 35 was intended to replace the FT as standard light infantry tank from the summer of 1936, but even by May 1940 not enough conscripts had been retrained and therefore eight battalions of the older tank had to be kept operational. On 1 September 1939, at the outbreak of war, 975 vehicles had been delivered out of 1070 produced; 765 were fielded by tank battalions in France. Of a total order for 2,300 at least 1,601 had been produced until 1 June 1940 serial numbers known to be actually used indicate a production of at least 1670 vehicles.\n\nR35 tank participating in military manoeuvres\n\nIn the Battle of France, despite an advantage in number and armour against the Germans, the French tanks were not used to good enough effect. The infantry tanks were only effective in executing the breakthrough phase of a battle; and thus useless as a mobile reserve. Ironically, cooperation with the infantry was poor. The Cavalry units alone were too few in number.\n\nThe design of French tanks were not inadequate to their German counterparts; in fact, many French tank designs out-powered various early German tanks used during the first stages of the war. One single Char B1 was able to destroy thirteen German tanks within a few minutes in Stonne on 16 May 1940, all of them Panzer III and Panzer IV tanks. The 37mm and 20mm guns the Germans used were ineffective at penetrating the thick armour of the B1, which was able to return safely despite being hit a large number of times.[2] Even German General Rommel was surprised at how the French tanks withstood the German tank shells and had to resort to using the German 88 artillery as antitank guns against the French tanks to knock them out. Setbacks the French military suffered were more related to strategy, tactics and organisation than technology and design. Almost 80 percent of French tanks did not have radios, since the battle doctrine employed by the French military was more a slow-paced, deliberate conformance to planned maneuvers.[3] French tank warfare was severely restricted as tanks were assigned to infantry divisions, and were intended to provide support for infantry. Unlike Germany, which had dedicated tank divisions, France did not separate tanks from the infantry, and were unable to respond quickly to the Blitzkrieg tactics employed by the Germans, which involved rapid movement, mission-type orders and combined-arms tactics.[4]\n\nSOMUA S35 French tank\n\nThe S35 medium tank entered service in January 1936 with the 4e Cuirassiers. At the end of 1937 the SA 35 gun became available and deliveries of the main production series could begin. By mid 1938 a hundred had been produced, 270 on 1 September 1939 and 246 delivered. On this date 191 served with the troops, 51 were in depot and four had been sent back to the factory for overhaul. After the outbreak of war a fourth order of 200 was made, bringing the ordered total to 700. Later it was decided that from the 451st vehicle onward the tanks would be of the improved S 40 type. Production in fact totalled 430 by June 1940, including the prototype and the preseries.\n\nOf these about 288 were in front-line service at the beginning of the Battle of France, with the three armoured divisions of the Cavalry, the Divisions Légères Mécaniques or Mechanised Light Divisions (\"light\" here meaning \"mobile\"). Each of these had an organic strength of eight squadrons with ten S35s; each squadron however had a matériel reserve of two tanks and regimental and brigade commanders in practice had personal tanks too, resulting in a total of 88 vehicles per division. Furthermore 31 were present in the general matériel reserve, 49 in factory stocks and 26 were being processed for acceptance.[5] These vehicles were later issued to several ad hoc units, such as the 4th DCR (commanded by Charles de Gaulle) which received 39, part of 3e Cuirassiers, the 4th DLM (10), and some Corps-francs Motorisés (about 25). Also the destroyed 1st, 2nd and 3rd DLM were reconstituted with a small number of tanks, the first two divisions received ten S 35s, the third twenty; S 35s further served with the 7e Cuirassiers (25) and a platoon of three was present in the 3e RAM of the 3e DLC.\n\nS 35s captured by Germany in 1940\n\nIn May 1940 during the Battle of France the DLMs were tasked with the difficult manoevre of carrying out a quick advance into the Low Countries, followed by a holding action to allow the infantry divisions following behind to dig themselves in. The 2nd and 3rd DLM were concentrated in the Gembloux gap between Louvain and Namur, where there were no natural obstacles to impede a German advance. They had to spread out somewhat to hold that sector against incursions by the German 3rd and 4th Panzer Divisions. This was necessitated by the local tactical situation and did not reflect some fundamental difference in doctrine between the use of the DLMs and the Panzerdivisionen. Both types of units were very similar in equipment, training and organisation, as the German armoured divisions too were primarily intended for strategic exploitation, while the breakthrough phase was preferably left to the infantry. The resulting tank battle from 13 to 15 May, the Battle of Hannut, was with about 1700 AFVs participating the largest until that day and is still one of the largest of all time. The S 35s gave a good account of themselves, proving to be indeed superior to the German tanks in direct combat, but they were rather hesitantly deployed as the French High Command mistakenly supposed the gap was the German Schwerpunkt and tried to preserve their best tanks to block subsequent attacks by the rest of the Panzerwaffe.\n\nWhen it transpired the attack was really a feint and the forces in the north were in danger of being cut off by the German advance south of Namur, the 1st DLM that had very quickly moved 200 kilometres to the north to help the Dutch, was hurriedly rushed south again. The resulting disorder and breakdown of most of its S 35s rendered this unit, the most powerful of all Allied divisions, impotent; it was defeated by the German 5th Panzerdivision on 17 May. The other DLMs fought a delaying battle, participated in the Battle of Arras and then disintegrated. Committing its only strategically mobile armour reserve early in the battle had made the French Army fatally vulnerable to a German strategic surprise.\n\nAfter the June 1940 armistice, S 35s were allowed to be sent to West Africa to bolster the hold of the Vichy regime on that region. They were issued to the 12e régiment de Chasseurs d'Afrique that, after French forces in Africa had sided with the Allies, operated them against German and Italian forces during the Tunisia Campaign. After the liberation of France in 1944 an armoured unit was raised, the 13e Régiment de Dragons, using French matériel, among which were seventeen S 35s.\n\nThe S 35 in German service on the Eastern Front in 1941\n\nAfter the fall of France a number of S 35s (297 were captured according to some sources) were taken into service with the Wehrmacht as the Panzerkampfwagen 35-S 739(f). The Germans modified the cupola by cutting its top off and installing a simple hatch.\n\nThe ARL 44 at Mourmelon-le-Grand\n\nThe 21st and 25. Panzerdivision in 1943 used some S 35s when reforming after having been largely destroyed. Some of these units fought in Normandy in 1944, and there were still twelve S 35s listed as in German service on 30 December 1944.\n\nAfter the Fall of France, work on new designs, such as the Char G1, officially halted, although there was some clandestine designing done. The Free French forces joined the Allies in fighting the Axis. With France occupied by or collaborating with the Nazis, leaders such as de Gaulle joined the Allies building a force unit France's vast overseas empire.\n\nFrom July to November 1940, Free French forces would engage in bitter fighting with French troops loyal to Vichy France during the West African Campaign, with success and failure on both sides.\n\nIn November 1940 the Free French claimed victory at the Battle of Gabon, also known as the Battle of Libreville. De Gaulle personally surveyed the situation in Chad, located on the southern border of Libya, and the battle resulted in Free French forces taking Libreville, Gabon, and all of French Equatorial Africa from the Vichy French.[6] By the end of 1940 the French Equatorial African colonies, now including Gabon, had joined the Free French.\n\nSoon after de Gaulle established the Empire Defence Council, the first step towards the formation of not just a military force but a government in exile. During 1941, Free French units fought with the British Commonwealth army against Italian troops in Ethiopia and Eritrea during the East African Campaign.\n\nIn June 1941, during the Syria-Lebanon campaign, Free French forces fighting alongside British Commonwealth forces faced substantial numbers of French troops loyal to Vichy France – this time in the Levant. De Gaulle had assured Churchill that the French forces in Syria would rise to the call of Free France – but this was not the case. After bitter fighting, with around 1,000 dead on each side, General Henri Dentz and his Vichy Army of the Levant were eventually defeated by largely British Empire forces in July 1941.\n\n\nFree French Foreign Legionnaires assaulting an enemy strong point at Bir Hakeim\n\nBir Hakeim[edit]\n\nOne of the first key battles the Free French forces fought after they joined the Allies was at Bir Hakeim were they defended against the attack by the Ariete Division in the first phase of the Gazala battle, and later under attack by a combined force of the Trieste and 90th Light Infantry Division.[7] The battle at Bir Hakeim was at remote oasis in the Libyan desert, and the former site of a Turkish fort. During the Battle of Gazala, the 1st Free French Division of Général de brigade Marie Pierre Kœnig defended the site from 26 May-11 June 1942 against much larger attacking German and Italian forces directed by Generaloberst Erwin Rommel. The battle was later greatly used for propaganda purposes by all involved parties. Tobruk was taken 10 days later by Rommel's troops.[8][9] Rommel continued to advance against delaying actions by the British until halted at First Battle of El Alamein in July.\n\nGénéral Bernard Saint-Hillier said in an October 1991 interview: \"A grain of sand had curbed the Axis advance, which reached Al-Alamein only after the arrival of the rested British divisions: this grain of sand was Bir Hakeim.\"[10]\n\nRommel's attack: frontal attack on Gazala and bypass towards Bir Hakeim, while the British Army retreats to cover Tobruk.\n\nOn the night of 26 May 1942, Rommel started a planned attack with the 15th and 21st Panzer Divisions, and the rest of the 90th Motorized Infantry Division, and the Italian Trieste and Ariete Divisions started the large encircling move south of Bir-Hakeim as planned. The British armoured units were taken by surprise and retreated.\n\nItalian M13/40 tank\n\nRommel then sent the Ariete Armoured Division - to attack Bir Hakeim from the southeast. This division - formed of the 132nd Armoured Regiment, equipped with M13/40s, of the 8th Reggimento bersaglieri and of the 132nd Artillery Regiment - attacked the French position from the rear in two successive waves. The Italian tanks and armored vehicles attacked without infantry support and tried to cross the minefield. Six tanks managed to infiltrate the French lines, avoiding mines and anti-tank fire, but they were eventually destroyed by very close range 75 mm fire, and the crews were captured.\n\nThe Ariete Division, reduced to only 33 tanks in 45 minutes, had to retreat. The remaining tanks then tried to outflank the French forces by attacking through the V zone minefield protecting that face. They eventually regrouped and retreated, leaving behind 32 destroyed tanks. However north of Bir Hakeim, the 3rd Indian Motor Brigade had been annihilated, and two weakened British brigades - the 4th and the motorized 7th Armoured - were forced to retreat to Bir-el-Gubi and to The El-Adem, leaving Bir-Hakeim and the Free French Forces to fight the full brunt of Rommels forces.\n\nErwin Rommel and Fritz Bayerlein near Bir Hakeim\n\nRommel's success in the north was very costly, and Rommel's wide flanking plan was proving riskier because of the resistance at Bir Hakeim (his right flank and supply route was threatened by this position). The Afrika Korps had to take Bir Hakeim.So Rommel sent the Trieste division, the 90th Light Infantry Division, and 3 recon armored regiments from the Pavia division against Bir Hakeim.\n\nThe advance of the 21st panzer division\n\nThe German infantry launched a full attack, supported by the 15th Panzerdivision, with heavy barrages from the artillery. A breach was made and on 9 June, the evacuation order reached the French camp. and the Free French Forces fought their way back to the British lines,\n\nFree French Forces evacuating Bir Hakeim\n\nConsequences of the battle of Bir Hakeim[edit]\n\nThree African soldiers of the French Colonial Artillery who distinguished themselves in the battle at Bir Hackeim. They are from Senegal, Equatorial Africa, and Madagascar, respectively\n\nFor the Free French, a victory was badly needed to show the Allies that the army of the Free France was not, as often suggested, a bunch of desperados, but a serious force that could contribute in the battle against the Reich. The Free French used the battle to show the world that France was not the decadent nation it appeared to be after its catastrophic defeat in 1940. De Gaulle used it to delegitimize cooperation with the Vichy regime. To withstand the overpowering Rommel army was an enormous achievement by Koenig and his men. British General Ian Playfair said: \"The lengthened defense of the French garrison played a major role in the re-establishment of the British troops in Egypt. The free French gravely disrupted, from the beginning, Rommel's offensive, resulting on a disturbed supply line of the Afrika Korps. The growing Axis troop concentration in the sector, needed to subjugate the fort, saved the British 8th Army from a disaster. The delays in the offensive caused by the relentless French resistance increased the British chances of success and eased the preparation of the counter-offensive. On long term, holding back Rommel allowed the British forces to escape from its meticulously planned annihilation. That's why we can say, without exaggerating, that Bir Hakeim greatly contributed to El-Alamein defensive success\".[citation needed] General Claude Auchinleck said on June 12, 1942, about Bir Hakim: \"The United Nations need to be filled with admiration and gratitude, in respect of these French troops and their brave General Koenig\".[11] Winston Churchill was more terse: “Holding back for fifteen days Rommel's offensive, the free French of Bir Hakeim had contributed to save Egypt and the Suez Canal's destinies”.[citation needed]\n\nEven Adolf Hitler responded to the journalist Lutz Koch, coming back from Bir Hakim: \"You hear, Gentlemen? It is a new evidence that I have always been right! The French are, after us, the best soldiers! Even with its current birthrate, France will always be able to mobilize a hundred divisions! After this war, we will have to find allies able to contain a country which is able of military exploits that astonish the world like they are doing right now in Bir-Hakeim!\".[12] Rommel himself declared that \"nowhere in Africa was I given a stiffer fight\".[13] On 6 June, Rommel had already received orders from Hitler to kill all enemy soldiers in battle or shoot them when captured. In Hitler's view the Free French troops were a group of partisans, rather than regular soldiers, that also hosted political refugees from Germany. Rommel supposedly burnt this order: regardless, he never followed it and took Free French soldiers as regular POWs.[citation needed]\n\n2nd Armored Division (France)[edit]\n\nGeneral Leclerc talks to his men from the 501° RCC (501st Tank Regiment).\n\nThe French 2nd Armored Division (French: 2e Division Blindée, 2e DB), was commanded by General Philippe Leclerc, one of the best French tank commanders. General Leclerc joined the Free French forces after the fall of France and adopted the Resistance pseudonym \"Jacques-Philippe Leclerc\". Charles de Gaulle upon meeting him promoted him from Captain to Major (commandant) and ordered him to French Equatorial Africa as governor of French Cameroon from 29 August 1940 to 12 November 1940. He commanded the column which attacked Axis forces from Chad, and, having marched his troops across West Africa, distinguished himself in Tunisia.\n\nM4A2 Sherman tanks of the Île de France of the 12e RCA, 2e DB coming ashore in Normandy\n\nThe French 2nd Armored Division was formed around a core of units that had raided Italian Libya since the end of 1940 to entering Tripoli 1943 under Leclerc, but was known for its fight at Kufra in 1941; later renamed the 2nd Light Division, in August 1943, it was organized under the US light armored division organization.\n\nAfter landing in Normandy on 1 August 1944, his 2nd Armored Division participated in the battle of the Falaise Pocket (12 to 21 August) where they all but destroyed the 9th Panzer Division and went on to liberate Paris. Allied troops were avoiding Paris, moving around it clockwise towards Germany. This was to minimize the danger of the destruction of the historic city if the Germans sought to defend it. Leclerc and de Gaulle had to persuade Eisenhower to send Leclerc's 2nd Armored Division and they entered Paris, and the liberation by Leclerc help cement de Gaulle's claim as leader of the French.[14]\n\n\nAfter the division liberated Paris, it defeated a Panzer brigade during the armored clashes in Lorraine, forced the Saverne Gap, and liberated Strasbourg. After taking part in the Battle of the Colmar Pocket, the division was moved west and assaulted the German-held Atlantic port of Royan, before recrossing France in April 1945 and participating in the final fighting in southern Germany\n\nAfter the liberation of France, the next tank to be introduced would be the ARL 44 heavy tank, which came too late to participate in World War II, but was used post-war f or a time. The ARL 44s equipped the 503e Régiment de Chars de Combat stationed in Mourmelon-le-Grand and replaced seventeen Panther tanks used earlier by that unit.\n\nCold War[edit]\n\nAMX-13 light tank, produced from 1953 to 1985\n\nVarious tank designs were built by France after World War II. Tank models such as the AMX-13 and AMX-30 were also exported to various other nations. Newer French tank designs sacrificed armour protection for increased mobility, due to the idea that the large amount of armour required to protect against modern anti-tank threats would significantly affect maneuverability, and that a higher speed and more compact vehicle dimensions would be more effective in protecting the tank from potential threats.\n\nA rift formed between France and West Germany following Charles de Gaulle's decision that France would no longer participate in NATO, with West Germany opposing a standardised common tank project. In 1963, both West Germany and France declared that they would produce purely national tanks. Development towards main battle tank projects such as the AMX-30 occurred soon afterwards.[15]\n\nAMX-30B at the Bovington Tank Museum.\n\n\nOriginally, 300 AMX-30s were ordered by the French Army, and by 1971 the order had been increased to 900, divided between eight batches,including all variants based on the chassis.Beginning in 1966, ten AMX-30s were assembled per month, and the first five were issued in August 1966 to the 501st Régiment de Chars de Combat. Monthly production grew to 15–20 tanks as new factories began to manufacture components of the vehicle and existing factories increased their production potential. However, in April 1969, production was again reduced to ten per month. By 1971 about 180 vehicles were in service; in 1975 delivery began of the last 143 units of the final eighth batch of the original order.[17] In 1985 the number of AMX-30s had risen to 1173. By the end of production, France had accepted 1,355 AMX-30s into service, including 166 brand-new AMX-30B2s. Another 493 tanks were refitted and modernized to AMX-30B2 standards; originally 271 new and 820 refitted vehicles had been planned. The French Army also accepted a large number of variants, including 195 self-propelled howitzers, 44 AMX-30 Pluton tactical nuclear missile launchers, 183 AMX-30Rs, 134 AMX-30Ds and 48 engineer vehicles (AMX-30EBG). The last 35 new battle tanks were in 1989 ordered by Cyprus and the last new variant vehicles, a batch of twenty GCTs, in 1994 by France.\n\nA Leclerc on manoeuvres.\n\nIn the late 1990s, the French Army began to accept the new Leclerc main battle tank to replace the antiquated AMX-30. The first units to be outfitted with the new tank were the 501st and 503rd tank regiments, followed by the 6th and 12th Cuirassier Regiments.\n\nIn the early 1980s the next in the GIAT manufactured, export-driven AMX series was designed. As the AMX-32 had failed to attract any potential sales, the company decided to produce yet another upgrade. This was the AMX-40 Main Battle Tank. The development of the AMX-40 began in 1980 as a clean sheet design. In 1983 the first prototype was finished and presented at the Satory Exhibition of that year. Two further prototypes were produced in 1984; the last, fourth, was fabricated in 1985. The design was not intended for service in France, but as a successor to the AMX-32, the improved export version of the AMX-30. However the efforts to obtain foreign orders failed, the most serious potential customer to have considered the design being Spain. In 1990 it was no longer offered for export.\n\nOverview per tank[edit]\n\n(Only tanks that were built in significant numbers are listed.)\n\nInterwar period and World War II\nCold War\n\nModern era\n\nSee also[edit]\n\n\n  1. ^ Steven Zaloga, (2011). French Tanks of World War I. Osprey Publishing. ISBN 9781780962139\n  3. ^ Larew, Karl G., (2005). \"From Pigeons to Crystals: the development of radio communication in U.S. Army tanks in World War II\". Historian, 67: 664–677. Blackwell Publishing. doi:10.1111/j.1540-6563.2005.00126.x\n  4. ^ Chris Bishop, (2002). The Encyclopedia of Weapons of World War II. Sterling Publishing Company, Inc. ISBN 9781586637620\n  5. ^ François Vauvillier, 2007, \"Notre Cavalerie Mécanique à son Apogée le 10 Mai 1940\", Histoire de Guerre, Blindés & Matériel, N° 75, p.46\n  7. ^ The Second World War: Europe and the Mediterranean, Thomas B. Buell,John N. Bradley, Thomas E. Griess, Jack W. Dice, John H. Bradley, Square One Publishers, Inc., 2002, p. 169\n  8. ^ Der Mythos des Gaullismus: Heldenkult, Geschichtspolitik und Ideologie 1940 bis 1958, Matthias Waechter, Wallstein Verlag, 2006\n  9. ^ Schlachtenmythen: Ereignis, Erzählung, Erinnerung, Susanne Brandt, p. 170\n  10. ^ (French) Histoire de la France militaire et résistante, Volume 1, Dominique Lormier, Rocher, 2000\n  12. ^ Lutz Koch, Rommel\n  13. ^ 1943: The Victory That Never Was, John Grigg, Faber & Faber, 2013\n  14. ^ Cointet, Jean-Paul, Paris 40-44, Perrin 2001, ISBN 2-262-01516-3, Sixième Partie, chapitre 3.\n  15. ^ Caiti\n  16. ^ Caiti, p. 34\n  17. ^ Caiti, p. 37\n\n\n",
  "response": "### **Overall Scene Theme and Core Concept**  \n**Title:** *\"The Forgotten Armory: A WW2-Era French Tank Repair Bunker\"*  \n\n**Core Concept:**  \nA clandestine underground French Resistance workshop hidden beneath a ruined château in Normandy, 1944. Originally a German-occupied repair depot for captured French tanks (like the S35 and Char B1 bis), the space was secretly repurposed by Resistance fighters to refurbish and modify vehicles for sabotage missions prior to the Allied invasion. The bunker is a chaotic blend of military logistics, jury-rigged engineering, and partisan hideout—a pressure cooker of collaboration where mechanics, saboteurs, and scouts must work together under looming threats of discovery.  \n\n**Why Multi-Agent?**  \n- **Heavy Object Manipulation:** Tank parts (turrets, tread segments) are too bulky for one person.  \n- **Specialized Roles:** Mechanics, electricians, and lookouts have interdependent tasks.  \n- **Time Pressure:** Random events (German patrols, air raids) force parallel task execution.  \n\n---\n\n### **Spatial Layout and Area Descriptions**  \n1. **Main Repair Bay (40m x 20m)**  \n   - A cavernous space with a cracked concrete floor stained with oil and coolant. Flickering pendant lights cast uneven shadows across a partially disassembled *Somua S35* tank, its turret suspended by chains from an I-beam gantry. German-language repair manuals are pinned to a corkboard beside French Resistance graffiti (\"*VIVE LA LIBERTÉ*\" scrawled in red paint).  \n   - **Key Feature:** A manual winch system for lifting tread segments (max load: 300kg—requires 2+ people to operate safely).  \n\n2. **Parts Storage & Scavenge Depot (15m x 10m)**  \n   - Crowded with mismatched shelving units holding salvaged components: a stack of Renault FT road wheels (rusted), crates of 47mm shells (labeled \"*ACHTUNG – SPRENGSTOFF*\"), and a gutted German *Funkgerät* radio set missing its vacuum tubes.  \n   - **Key Feature:** A false back wall concealing a stash of Sten guns and plastic explosives.  \n\n3. **Field Command Post (10m x 8m)**  \n   - A repurposed officer’s quarters with a map table (pinned with reconnaissance photos of nearby rail lines), a field telephone (deadline—wires severed), and a chalkboard listing coded supply requests (\"*3x BLUE CAP = Diesel filters*\").  \n   - **Key Feature:** A floor hatch leading to an escape tunnel (partially collapsed; requires clearing debris).  \n\n4. **Living Quarters (12m x 6m)**  \n   - Hammocks strung between support beams, a potbellied stove with a dented coffee pot, and a crate of Vichy-era ration tins (most empty). A broken mirror hangs near a basin of murky water.  \n   - **Key Feature:** A concealed diary under a loose floorboard detailing German patrol schedules.  \n\n5. **Exterior: Ruined Château Courtyard**  \n   - Rubble-strewn, with a scorched *Panzer IV* hull used for spare parts. A watchtower (partially collapsed) overlooks a forested escape route.  \n\n---\n\n### **Detailed Area-by-Area Inventory**  \n\n#### **1. Main Repair Bay**  \n**a. Anchor Furniture & Installations:**  \n- **Gantry Crane:** Rusted steel I-beams with a chain hoist (max load 500kg; one pulley squeaks loudly).  \n- **Workbenches:** Two steel tables welded from tank hull scrap; one holds a vise grip bolted to the surface.  \n\n**b. Key Interactive Objects:**  \n- **S35 Turret (removed):** 180kg, with a jammed 47mm gun breach (requires lubrication + mallet).  \n- **Tread Assembly Jig:** A frame for aligning track links (one bolt missing; replacements in Parts Storage).  \n- **Battery Charger:** Hand-cranked, wires frayed (electric shock risk if mishandled).  \n\n**c. Functional Ambient Objects:**  \n- **Tool Carts:** Wrenches, blowtorch (fuel low), calipers.  \n- **Hydraulic Jack:** Leaking fluid; supports the S35’s front axle.  \n\n**d. Background Objects:**  \n- **Propaganda Posters:** German warnings (\"*SCHWEIGEN IST PFLICHT*\") torn and defaced.  \n- **Dirty Rag Pile:** Stained with grease and blood (one hides a Luger pistol).  \n\n---  \n*(Continued for other areas—below is a condensed example for brevity.)*  \n\n#### **2. Parts Storage**  \n**a. Anchor:** Steel shelving units (bolted to walls; one shelf bent from overload).  \n**b. Key Objects:**  \n- **\"Corrosive\" Drum:** 200L, labeled \"*ÄTZEND*\", actually holds stolen German gasoline.  \n- **Radio Tube Box:** Only 3/5 tubes functional (one is a decoy—hollow).  \n**c. Functional Ambient:**  \n- **Crate Stack:** Marked \"*MUNITION*\", actually holds spare uniforms.  \n**d. Background:**  \n- **Dusty Mannequin:** Wearing a German officer’s coat (used for target practice).  \n\n---\n\n### **Scene Affordances & Embedded Potential**  \n**Collaborative Transportation Example:**  \n- **S35 Turret (180kg, 1.8m diameter):** Requires coordinated winch operation + alignment. A dropped turret could crush a foot or damage the tank hull.  \n\n**Reasoning & Tool-Use Example:**  \n- **Problem:** The *Funkgerät* radio won’t power on.  \n- **Solution Chain:**  \n  1. **Attribute-Based:** Find the *only* intact tube (blue glass, \"Telefunken\" logo) in a box of shattered tubes.  \n  2. **Tool-Use:** Use the diary’s wiring diagram to splice the radio to a tank battery.  \n  3. **Background Noise:** A decorative but broken wall clock distracts—its hands are stuck at \"3:15,\" the time of the next patrol.  \n\n**Compound Task:**  \n- **Sabotage Mission Prep:**  \n  1. Two agents lift a tread segment onto the jig (strength).  \n  2. A third plants explosives in the hollow roadwheel (stealth).  \n  3. A lookout monitors the courtyard via periscope (observation).  \n\n---  \n**Design Intent:** Every object’s state, weight, or placement creates *potential* for collaborative problem-solving under constraints. The environment feels *lived-in* (coffee stains, graffiti) and *high-stakes* (improvised repairs, hidden weapons).**"
}