{
  "id": 1017,
  "raw": "\nRetrieved from http://magicseaweed.com/Kandui-Resort-Listing/756/?lang=en\nText:\nKandui Resort\n\nKandui Resort Logo\nwww.kanduiresort.com Kandui Resort\n629 Camino De Los Mares Suite 101\nSan Clemente\nCa 92673\n+1 (714) 369-8121 info@kanduiresort.com\n\nKaramajet Island, part of the Mentawai Islands chain and home to Kandui Resort is situated 75 miles off the west coast of Sumatra. Due to its remote location it requires a one-of-a-kind crossing across the Mentawai strait – a patch of ocean steeped in historical folklore and intrigue. Kandui Resort, the only western development on the island is set amidst 30 acres of palm trees, lagoons, and a spectacular mile long white sand beach overlooking two of the most picturesque islands in the Mentawai Islands. This area has no shopping malls, housing tracts, or freeways – just unspoiled beauty, the soothing rhythm of the tides, and the ever present allure of perfect surf.\n\nSpecial Thanks to Sebastian Imizcoz and Nate Adams for their wonderful photos!\n\nKandui Resort is undoubtedly located in one of the most sought after locations in the world and complimented by an assortment of features that separate it from any other experience in not only the Mentawai Islands, but Indonesia in general.\n\nThe Waves\n\nThe Mentawai Islands are one of the most consistent surf destinations in the entire world. It's broad exposure towards the vast, southern Indian Ocean provides these majestic islands with remarkable consistency and quality. There are great waves in this area YEAR-ROUND. However, the most ideal time to surf in the Mentawai's is during the dry season, late March to early November, the southern hemisphere's winter, when the Indian Ocean is an ultra-active, groundswell producing machine. During the entire year Kandui Resort offers the average surfer the opportunity to score the best waves of their lives in the premiere surf resort location in the entire world, nothing else comes close...\n\n\n4 Bobs is a short, playful right-hander located directly in front of Kandui Resort. Swells that break here wrap considerably around the south end of the island and break over a relatively shallow reef.\n\nA Frames\n\nA Frames is one of the most consistent lefts in the Mentawai Islands. Situated in front of an idyllic island it is one of the many good waves found in the Playgrounds region. There are generally two sections to surf, the top and the inside.\n\n\nBankvaults is a thick, barreling right punctuated by a shifting line-up. Sets seemingly emerge out of nowhere and can wreak havoc if you're caught out of position. Despite the dangers, snag a clean, open barrel here and you'll be talking about it for years.\n\nBeng Bengs\n\nBeng Beng is an extremely rippable left located a few hundred yards away from E-Bay and Pitstops. It's probably one of the easiest waves to surf in the Mentawai's and is fun for surfers of all ability levels.\n\nBurger World\n\nBurgerworld is considered a last alternative when everywhere else is flat. Anything bigger than three feet here flattens out into a giant mushball. The one positive aspect about Burgerworld is its consistency; there is always something rideable here!\n\n\nE-bay is a fast, barreling left that gets good when it's head high or bigger. When a pumping west swell is marching through, E-bay does a close impersonation of Padang Padang on Bali without the death cliff looming inside.\n\n\nHideaways is an occasionally heavy left near the Playgrounds region that is frequently visited by Kandui guests. In the last few years it has been one of the \"go to\" waves because it is a lot more consistent the other world class waves in our area.\n\n\nIceland is a sizable left that is known as one of the \"big wave\" spots in the Mentawais. It has a very large playing field and a few different take-off options including a few rights when it is small.\n\n\nKandui a.k.a Kanduis or Nokandui is one of the fastest, down the line, left-hand barrels in the world. Kandui is an obscenely hollow wave with your only option for survival being tucked inside its enormous, gaping jaws.\n\nKarangbat Left\n\nKarangbat Left lies smack dab in the middle of \"Playgrounds.\" It breaks best on a direct south swell and is a fairly straightforward wave for people of all abilities.\n\n\nNipussi is a high-performance right situated inside a reef-laden cove. Nipussi always has waves and is a good alternative when the rest of the islands are flat.\n\n\nPitstops is one of the most high performance waves in the Mentawai Islands. Located a few hundred yards away from E-Bay the wave itself starts breaking in a compact area over reef, remarkably, if you're not paying attention, the take-off can be quite challenging. However, once you're on your feet you've got a really fun, semi-backwashy wave to carve, pull in, or boost on.\n\n\nRifles is one of the longest, most perfect, awe-inspiring waves in the world. When it's breaking properly with a hint of northwest wind you can expect four to six hundred yard right walls with numerous tube sections. Rifles is a violent barrel from start to finish, sometimes when you think you are coming out another section will throw over, and another, and another.\n\n\nScarecrows is Telescopes' big brother, a little more forceeful, slightly bigger, and in general a little less refined. Nevertheless, it definitely has its good days and because it picks up a lot of swell is a good option when the rest of the chain is small.\n\n\nEvery thing you've heard about Telescopes is true. It's a remarkably long left which tempts you to sit deeper and deeper, almost daring you to backdoor an impossible section.\n\n\n\n\nEvery uma is also outfitted with a dedicated wireless connection and small speaker to play your IPOD! Each “uma” provides ample sleeping and bathing areas accentuated by a queen sized bed with nets, rattan furniture, and its own sense of warmth and identity. All umas are stocked with cold drinks.\n\nEach bathroom has a sink, toilet, mirror, shower, and is completely tiled. Bath, hand, and face towels are available in every room but we encourage people to bring their own beach towels...\n\nElectrical outlets with adaptors for charging a multitude of electrical devices. (Please note we use a 220V current and Indonesian plugs so be careful before you plug anything in!) We offer phone connections to the main desk, housekeeping, restaurant, room service, and room to room.\n\nThere are screened windows with a glass window that can be shut tight and locked, with curtains on the inside to let in, or block out light. There is a a specific area to hang wet clothes outside and in the bathroom.\n\nKandui Restaurant and Bar\n\nKandui's restaurant and bar is the main congregation area, the heart of the resort, and our most prized structure - Kandui Restaurant and Bar was built from the ground up virtually by hand. It's design principles follow the local traditions and customs and every inch of this area has been meticulously detailed to provide a sense of barefoot luxury.\n\nIndulge in the flavors of the Mentawai. Each day the resort’s chef prepares a variety of food with an emphasis on the succulent seafood caught by local fisherman and our guests. Sit back and enjoy the relaxed atmosphere of our restaurant – which serves some of the tastiest food in Sumatra in front of one of the most idyllic settings possible.\n\nThere is also a set schedule for meals so you don't have to wonder what time you eat. Lastly, your visit will have as many barbeques as possible; nothing is tastier or more satisfying than having a bbq with your close friends on a remote, tropical island with perfect waves reeling in the distance.\n\nThe Office\n\nThe Office is set up as our communication center to the outside world. It has two computers for people to browse the internet, a phone service to make calls overseas without having to use the Satellite phone, a fax machine, safety deposit box, and money changing service. Everything you have in your office at work.\n\nThere are no formal meeting or conference facilities but with the wireless internet connection you can have a meeting almost anywhere. In fact, the entire resort is outfitted witha dedicated wireless internet connection, you can get online in the office, the restaurant, in your uma, or on the beach if you'd like!\n\nKandui's Gift shop is managed in conjunction with the local artisans - it offers an easy, convenient place for people to purchase Mentawai gifts for themselves, their friends and family at home, the shop will have local jewelry, wood handicrafts bow and arrows, shaman bags, sarongs, the list goes on...\n\n\nSumatra + Mentawais » RiflesSumatra + Mentawais » Kandui\n\n\n",
  "response": "# **Tropical Marine Research Station & Surf Outpost**  \n\n**Overall Scene Theme & Core Concept**  \nInspired by the remote beauty and surf culture of Kandui Resort, this scene reimagines the island as a **Tropical Marine Research Station & Surf Outpost**—a hybrid facility where scientists study coral reef ecosystems while surf guides and hospitality staff maintain a luxury eco-resort. The station is built into a repurposed fishing village, blending modern research infrastructure with traditional Mentawai architecture.  \n\nThe environment is inherently collaborative due to:  \n- **Logistical challenges** (remote location, limited supplies, heavy equipment).  \n- **Diverse expertise** (marine biologists, mechanics, surf instructors, chefs).  \n- **Dynamic conditions** (tides, storms, equipment failures).  \n\n---  \n### **Spatial Layout & Area Descriptions**  \nThe station consists of interconnected structures on stilts above a lagoon, with boardwalks linking key zones:  \n\n1. **Main Research Lab** – A converted longhouse with workstations, specimen tanks, and diving gear.  \n2. **Surf Guide HQ** – A cluttered office with wave forecasts, repair tools, and guest surfboards.  \n3. **Outdoor Workshop** – A covered deck with a broken wave-runner, tools, and salvaged materials.  \n4. **Guest Bungalows (\"Uma\")** – Elevated huts with mosquito nets, charging stations, and surf racks.  \n5. **Dock & Boathouse** – A jetty with kayaks, a diesel generator, and a radio transmitter.  \n6. **Beachfront Tiki Bar** – The social hub, with a thatched roof, a BBQ pit, and a weather-beaten telescope.  \n\n---  \n## **Detailed Area-by-Area Inventory**  \n\n### **1. Main Research Lab**  \n**a. Anchor Furniture & Installations:**  \n- A **6-meter stainless steel lab table**, bolted to the floor, with built-in sinks and drainage.  \n- A **wall-mounted specimen rack** holding 12 glass tanks (varying sizes, some with LED lighting).  \n- A **ceiling-mounted pulley system** for lifting heavy equipment (max load: 150kg).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Broken water sampler** (needs calibration; display shows \"ERROR CODE 47\").  \n- **Locked specimen fridge** (biohazard sticker; keycard required, last seen in Surf Guide HQ).  \n- **Salt-crusted dive computer** (battery dead, needs USB-C charging).  \n\n**c. Functional Ambient Objects:**  \n- **Microscope** (on, humming; slide tray contains coral fragments).  \n- **Whiteboard** (scribbled with tide charts and \"REEF BLEACHING ALERT – PRIORITY\").  \n- **Radio** (static, tuned to emergency channel 16).  \n\n**d. Background & Decorative Objects:**  \n- **Framed Mentawai fishing maps** (yellowed, pinned with red X's).  \n- **Moldy coffee mug** (\"World’s Best Oceanographer\").  \n- **Stack of outdated journals** (*Marine Ecology Vol. 28-32*).  \n\n---  \n\n### **2. Surf Guide HQ**  \n**a. Anchor Furniture & Installations:**  \n- A **salvaged ship’s wheel desk** (covered in wax, stickers, and tide logs).  \n- A **wall-mounted surfboard rack** (holding 8 boards, 3 with repair patches).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Wave forecast monitor** (flickering; requires antenna adjustment).  \n- **Missing keycard** (for lab fridge, hidden under a stack of surf mags).  \n- **Leaky wetsuit repair kit** (glue dried out, needs acetone).  \n\n**c. Functional Ambient Objects:**  \n- **VHF radio** (crackling with distant chatter).  \n- **Tool pegboard** (missing the Phillips-head screwdriver).  \n- **Mini-fridge** (stocked with energy drinks, half-empty).  \n\n**d. Background & Decorative Objects:**  \n- **Sun-bleached surf competition poster** (2019 Kandui Pro).  \n- **Dented trophy** (\"Best Barrel Rider – Mentawais 2020\").  \n- **Drying rash guards** (hung on a frayed clothesline).  \n\n---  \n\n### **3. Outdoor Workshop**  \n**a. Anchor Furniture & Installations:**  \n- A **rusted hydraulic lift** (jammed, requires two people to operate).  \n- A **workbench** (stained with oil, vise grips locked on a snapped bolt).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Dismantled wave-runner engine** (oil pan full, gasket missing).  \n- **Sealed crate** (\"FRAGILE – SONAR EQUIPMENT\", 80kg, needs two people to lift).  \n\n**c. Functional Ambient Objects:**  \n- **Cordless drill** (battery dead, charger nearby).  \n- **Bucket of seawater** (rusted tools soaking inside).  \n\n**d. Background & Decorative Objects:**  \n- **Pile of broken surf fins** (in a cracked plastic bin).  \n- **Faded \"NO SHARKS BEYOND THIS POINT\" sign** (nailed crookedly).  \n\n---  \n\n### **4. Guest Bungalow (\"Uma\")**  \n**a. Anchor Furniture & Installations:**  \n- **Queen-sized bed** (mosquito net torn in one corner).  \n- **Rattan wardrobe** (door hinge loose).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Guest’s lost waterproof camera** (under bed, SD card full of reef footage).  \n- **Faulty outlet** (220V, sparks when used – danger!).  \n\n**c. Functional Ambient Objects:**  \n- **Oil lantern** (half-full, matches nearby).  \n- **Beach bag** (contains sunscreen, a novel, and loose change).  \n\n**d. Background & Decorative Objects:**  \n- **Sand-covered flip-flops** (by the door).  \n- **Driftwood sculpture** (\"Kandui Dreams\" carved into it).  \n\n---  \n\n## **Scene Affordances & Embedded Potential**  \n\n### **Collaborative Transportation Affordances**  \n- **80kg sonar crate** (requires two agents to lift safely).  \n- **Jammed hydraulic lift** (needs simultaneous lever pulls to reset).  \n\n### **Reasoning & Tool-Use Affordances**  \n- **Attribute-Based Reasoning:**  \n  - Among five **chemical bottles**, only one has a **blue cap** + **\"CORROSIVE\"** label.  \n  - Distractor: A **blue glass vase** on the lab shelf (similar color).  \n- **Compound Tool-Use:**  \n  - **Problem:** Locked specimen fridge.  \n  - **Solution:** Keycard hidden under surf magazines in Surf Guide HQ.  \n\n### **Dynamic Environmental Triggers**  \n- **Tidal changes** (dock becomes inaccessible at high tide).  \n- **Generator fuel levels** (if ignored, power cuts out at night).  \n\n---  \n\n**Final Notes:**  \nThis scene is a **dense, living ecosystem**—every object has a purpose, a state, or a story. The blend of **science, surf culture, and island survival** ensures endless collaborative potential. Agents must **reason, adapt, and work together** to navigate this paradise with hidden challenges."
}