{
  "id": 1021,
  "raw": "\nRetrieved from http://parlinfo.aph.gov.au/parlInfo/search/display/display.w3p;query=Id%3A%22chamber%2Fhansardr%2F2010-11-15%2F0304%22\nText:\nSave Search\n\n Download Current HansardDownload Current Hansard    View Or Save XMLView/Save XML\n\nPrevious Fragment    Next Fragment\nMonday, 15 November 2010\nPage: 2413\n\nMr HAWKE (7:38 PM) —I want to thank the member for Braddon for raising the trifecta of reasons as to why we ought to have a cost-benefit analysis of the National Broadband Network. The insulation scheme is a fantastic reason why we should think, pause and carefully consider the impact of government decisions before we take them. The Building the Education Revolution scheme and the absolute rush to get projects out and handed to the New South Wales government meant that, in my electorate of Mitchell, we had two libraries built for a school of 90 pupils at the cost of $900,000. That could have been prevented by a cost-benefit analysis, by rationally examining how we were going to deliver those services.\n\nThe cost of the National Broadband Network represents the single biggest expenditure of any project in Australian history, so the member for Braddon has really raised the trifecta about why we are here today. If it were the case that, as those on the government side are consistently stating this place, the member for Wentworth’s objective was to delay or even to destroy the National Broadband Network, why would he be urging the government to do a cost-benefit analysis to consider the benefits versus the costs of implementing this program responsibly? If that were the case, the member for Wentworth would not be suggesting a deal which said, ‘Let’s pause and reflect, from a serious perspective such as that of the Productivity Commission, on how this could work, how it could be delivered and how we could best provide this broadband service to Australians.’\n\nThe experience of the member for Wentworth in business and investing leads him to understand that we need to spend taxpayers’ money wisely. We need to pause at these junctures when we have such a massive expenditure plan and say, ‘Let’s have a look at what we will get for that investment, because otherwise we will end up with a government program just like the insulation scheme or the BER where money is needlessly wasted and time and effort is spent delivering services that could have been delivered in a much better way.’ We have heard from our rural members here today that rural areas will not get the services they need even with an expenditure of $43 billion—the member for Calare is exactly right.\n\nWhy are we doing that? I come from an inner-city electorate, and there is pair gain in my electorate. I heard the member for Wakefield talking about pair gain, and of course that needs improving. Yet many inner-city areas are well serviced—there are people who do not need 100 megabits per second—while there are rural and regional areas that definitely need those services, and I endorse the remarks of those who say, ‘Why would we spend $43 billion and not service those areas of Australia where it is very difficult to provide these services in the free market?’\n\nThere is a large role for the market in the provision of broadband and telecommunications. In fact, the truth is exactly the opposite of the experience of the member for Braddon that telecommunications in this country have been progressing in a fashion that has allowed people to better afford goods and services from telecommunications companies over time. It is not the case that the market is failing so badly that we need a massive government monopoly through an injection of money of $43 billion, a sum beyond the wildest dreams of any single investor or other provider of services in this country’s history. That is not just my view; we have heard in question time about the views of the OECD, but we have not heard about the fact that the OECD has this week criticised the NBN monopoly and called for a rigorous analysis of this $43 billion. Why wouldn’t they? The sum of $43 billion is a lot of money in anybody’s language, and it is very unusual for the OECD to call for such an analysis of a domestic policy.\n\nThe Alliance for Affordable Broadband, the AAB—which represents a cross-section of the telecommunications industry and includes in its membership infrastructure based carriers, fibre, wireless and carriage service providers, all of whom have things to gain and lose through the National Broadband Network—has written an open letter today begging the government to consider the cost-benefit of the NBN. The AAB’s members say that they can provide services in a reasonable and cost-effective way to much of Australia. In addition, the Mayor of Brisbane, Campbell Newman, has proposed an innovative scheme that has been tried in other major cities around the world.\n\nSo there are plenty of options here; there are plenty of reasons to pause and consider. The member for Wentworth’s objective in suggesting we do so is not to destroy the NBN. If a cost-benefit analysis would destroy the National Broadband Network, perhaps we ought not to be proceeding with the NBN. Perhaps the government ought to pause and think about that. Doing a cost-benefit analysis is a worthy task. The Productivity Commission can do a thorough cost-benefit analysis, and taxpayers can get the peace of mind that they deserve.\n",
  "response": "# **Broadband Infrastructure Deployment Hub**  \n*A high-stakes, multi-agent environment where teams coordinate to deploy next-generation broadband infrastructure under tight deadlines and budget constraints.*  \n\n## **1. Overall Scene Theme and Core Concept**  \nThis scene is a **regional broadband deployment hub**, a temporary staging ground for installing fiber-optic networks in underserved rural areas. The environment is a **repurposed warehouse** converted into a **logistics center, equipment storage, and field operations hub**. The scene is inherently collaborative due to:  \n- **Heavy/Large Objects**: Fiber spools, server racks, and crates require multi-agent transport.  \n- **Specialized Roles**: Technicians, logistics coordinators, and safety inspectors must work in sync.  \n- **Time Pressure**: Visible countdowns (e.g., whiteboard schedules, digital clocks) emphasize urgency.  \n- **Safety & Compliance**: Hazard zones (e.g., exposed wiring, high-voltage equipment) demand coordination.  \n\n---  \n\n## **2. Spatial Layout and Area Descriptions**  \nThe warehouse is divided into **five key zones**, each with distinct functions:  \n\n### **A. Logistics & Inventory Control**  \n- **Purpose**: Central hub for tracking shipments, assigning tasks, and managing equipment.  \n- **Atmosphere**: High-energy, with whiteboards listing daily quotas, a wall-mounted flat-screen displaying real-time delivery schedules, and a perpetually ringing desk phone.  \n\n### **B. Fiber-Optic Spool Storage**  \n- **Purpose**: Houses massive spools of fiber-optic cable (each 500+ kg, 2m diameter) awaiting deployment.  \n- **Atmosphere**: Dimly lit, with forklift tracks on the concrete floor and a faint hum from climate control keeping the cables at optimal temperature.  \n\n### **C. Equipment Prep & Testing**  \n- **Purpose**: Technicians configure routers, splice fiber, and test signal integrity before field deployment.  \n- **Atmosphere**: Cluttered but organized, with workbenches covered in specialized tools (fusion splicers, OTDR testers) and the sharp smell of solder.  \n\n### **D. Field Deployment Kitting**  \n- **Purpose**: Where crews assemble \"go-bags\" with field essentials (climbing harnesses, cable crimpers, hardhats).  \n- **Atmosphere**: Chaotic but functional, with half-packed backpacks, a wall-mounted first-aid kit, and a coffee machine that’s always empty by 8 AM.  \n\n### **E. Compliance & Safety Office**  \n- **Purpose**: Ensures OSHA compliance—contains safety manuals, incident reports, and a locked cabinet with high-vis vests.  \n- **Atmosphere**: Sterile, with a flickering fluorescent light, a bulletin board of accident reports, and a faint smell of antiseptic.  \n\n---  \n\n## **3. Detailed Area-by-Area Inventory**  \n\n### **A. Logistics & Inventory Control**  \n**a. Anchor Furniture & Installations:**  \n- **Central Dispatch Desk**: 3m long, L-shaped, with three monitors (one displaying a live outage map).  \n- **Heavy-Duty Shelving Unit**: Holds labeled binders (\"Permit Logs\", \"Delivery Manifests\").  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **RFID Scanner (Error State)**: Flashing \"Low Battery\" warning; requires replacement.  \n- **Priority Shipment Box (Sealed)**: Marked \"URGENT: Calare Region,\" requires two agents to lift (25kg).  \n\n**c. Functional Ambient Objects:**  \n- **Label Printer (On, Out of Paper)**  \n- **Wall Clock (Stopped at 11:47, implying a missed deadline)**  \n\n**d. Background & Decorative Objects:**  \n- **\"Safety First!\" Poster (Faded, peeling at corners)**  \n- **Dented Coffee Mug (\"World’s Best Project Manager\")**  \n\n---  \n\n### **B. Fiber-Optic Spool Storage**  \n**a. Anchor Furniture & Installations:**  \n- **Industrial Pallet Racks**: Holding 10 fiber spools (each 500kg, color-coded by deployment phase).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Mislabeled Spool #7**: Tag says \"Rural Phase 2,\" but the cable inside is urban-grade (wrong thickness).  \n- **Forklift (Out of Fuel)**: Key left in ignition, fuel gauge on \"E.\"  \n\n**c. Functional Ambient Objects:**  \n- **Dolly Cart (One wheel squeaks)**  \n- **Temperature Monitor (Display: \"18°C – OK\")**  \n\n**d. Background & Decorative Objects:**  \n- **Dusty \"Employee of the Month\" Photo (2018)**  \n- **Crushed Energy Drink Can (Under pallet)**  \n\n---  \n\n### **C. Equipment Prep & Testing**  \n**a. Anchor Furniture & Installations:**  \n- **Anti-Static Workbench**: With built-in magnifying lamp (flickering).  \n- **Server Rack (Half-Populated)**: Missing two screws on panel D.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Faulty Router (Error Code E102)**: Needs firmware reset (USB stick in drawer).  \n- **Calibrator Device (Misaligned)**: Display reads \"Offset +3dB.\"  \n\n**c. Functional Ambient Objects:**  \n- **Soldering Iron (Cool, but tip is burnt out)**  \n- **Bin of Scrap Wire (Some copper exposed)**  \n\n**d. Background & Decorative Objects:**  \n- **\"No Food!\" Sign (With coffee stain)**  \n- **Graffiti (Tiny doodle of a robot on cabinet door)**  \n\n---  \n\n### **D. Field Deployment Kitting**  \n**a. Anchor Furniture & Installations:**  \n- **Pegboard Wall**: Hanging tools (some missing, leaving empty hooks).  \n- **Locked Cabinet (Key required)**: Contains GPS trackers.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Missing Hardhat (Checklist says \"4 required,\" only 3 present)**  \n- **Open First-Aid Kit (Bandages depleted)**  \n\n**c. Functional Ambient Objects:**  \n- **Clipboard (Last signed by \"J. Smith – 11/14\")**  \n- **Kevlar Gloves (One pair, left hand missing)**  \n\n**d. Background & Decorative Objects:**  \n- **\"Hang in There!\" Kitten Poster (Torn corner)**  \n- **Empty Pizza Box (Labelled \"TEAM DINNER – DO NOT THROW OUT\")**  \n\n---  \n\n### **E. Compliance & Safety Office**  \n**a. Anchor Furniture & Installations:**  \n- **Filing Cabinet (Locked)**: Key hidden under desk mat.  \n- **Whiteboard (Overdue Inspections List)**  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Expired Fire Extinguisher (Last checked 2019)**  \n- **Unfilled Incident Report (Pen out of ink)**  \n\n**c. Functional Ambient Objects:**  \n- **Eye Wash Station (Dusty nozzle)**  \n- **Broken Chair (One wheel detached)**  \n\n**d. Background & Decorative Objects:**  \n- **Framed OSHA Certificate (Glass cracked)**  \n- **Dead Potted Plant (\"Janet’s Aloe\")**  \n\n---  \n\n## **4. Scene Affordances and Embedded Potential**  \n\n### **Collaborative Transportation Affordances**  \n- **Fiber Spool #4 (600kg, 2.2m diameter)**: Requires forklift + spotter to move.  \n- **Server Rack Panel (3m tall, 80kg)**: Needs two agents to lift safely.  \n\n### **Reasoning & Tool-Use Affordances**  \n- **Attribute-Based Reasoning**: Among five routers on the workbench, only one has a **blue \"TESTED\" sticker**, but it’s also the only one with **a scratch near the Ethernet port**—requiring agents to cross-reference multiple attributes.  \n- **Compound (Tool-Use) Reasoning**: The locked compliance cabinet (key under mat) contains the **safety vests needed** before entering the hazardous fiber-spool area.  \n\n### **Dynamic States & Problems**  \n- **Mislabeled Spool**: Installing the wrong cable type could cause network failures.  \n- **Forklift Out of Fuel**: Delays movement of heavy objects unless addressed.  \n\n---  \n\n### **Final Notes on Design Philosophy**  \nThis scene is **dense with intentional problems** (mislabeled items, missing tools, expired safety gear) that force agents to:  \n- **Collaborate** (heavy lifting, role specialization)  \n- **Reason** (attribute matching, tool retrieval)  \n- **Adapt** (time pressure, incomplete information)  \n\nThe **background clutter** (old pizza boxes, dusty trophies) adds realism and forces agents to filter signal from noise—just like a real-world deployment hub."
}