{
  "id": 1025,
  "raw": "\nRetrieved from http://pyramidhead316.livejournal.com/\nText:\nYou are viewing pyramidhead316\n\n11 June 2010 @ 07:37 pm\nHi, everybody. Yes, I'm still alive. :) I've been very busy with school and other things recently, up until a month ago when I finally graduated. That's done with now, so I'm going to try to get back into my normal routine.\n\nI'm going to begin to post stories and messages again. I have a ton of messages saved up that I never completed, so I hope I can get to them soon. :) I'll start tonight with a fic Ive wanted to post ever since last year. So, for anyone who's been wondering where I've been, yes, I've been busy. But I plan to get back into the swing of things.\n05 February 2010 @ 06:08 pm\nHere's a response to a prequel hater, on Sci-Fi Wire's article on the 10 most evil things in sci-fi. The person typically use the opportunity to take a shot at George Lucas, and so I naturally took the time to make him look ridiculous and defend the PT environment. I also added Karen Traviss to the list, because that lady's a psycho. :P\n\n\"Sorry Afronaut, real people don't count, this is only for characters in a fictional setting. And some of us (i.e: 75%) liked Episode III and actually like the cartoon. Actually, as long as we're going with real people, add hardcore OT fanboys to the list. Those are EVIL incarnate. Their evil is such that even the Emperor and His Divine Shadow from Lexx would crumble in fear at the power of these deluded Star Wars maniacs to intimidate and frighten the rest of the fandom (although physically, we could kick their asses). :P Also add Karen Traviss to the list. Read her recent diatribe on the Jedi and ask yourself if that woman isn't EVIL walking in a human form. Between her and the fanboys, it would take the Emperor and His Shadow working together, His Shadow's entire fleet, the Empire's full array of Star Destroyers, the Lexx, the Death Star, and probably some help from Galactus to eliminate this stain from the universe. :P\"\n\nI also thought about adding something about how \"there's a reason nerds and geeks were tormented by other people in high school - because they were afraid of the evil residing inside these humans, and knew they had to control them,\" but I didn't do it, because I'm also a nerd and a geek, and I didn't want to simplify all the varied Star Wars fans into that stereotypically simple box. That was going a bit too far, to prove a point. I also know those instances of bullying and torments were very personal for some of us, so I don't want to hurt anyone. But yeah, I think that's some interesting imagery I presented right there in that post. ;) Can you imagine the Emperor and His Shadow leading a fleet against the OT fan boys on the planet Earth? ;D Of course, they'd conquer us and probably place tracking collars on us or something, but it might be worth it to be free of the prequel haters once and for all. ;D\n18 January 2010 @ 07:29 am\nFor a nice change of pace from the serious stuff, here's a Rabbid.\n\nAren't they just the cutest critters you've seen in gaming? ;D Move over, chocobos. >_>\n\nAnd of course, here's a supporting video showing what makes the Rabbids so hilarious: ;D\n10 January 2010 @ 05:30 pm\n\nNote: I'm not referring to an opening movie before the start menu, rather the intro in the game leading up to the first minutes of gameplay.\n\nOkay, so maybe I'm exaggerating a bit, and it's not the best. ;D But this is a damn good intro! :D\n\n29 December 2009 @ 06:46 pm\nBecause school has finished now for the holidays, I have an abundance of free time to devote to my hobbies. As a result, I've been replaying Soul Reaver 2.\n\nSoul Reaver 2 was released in 2001, and was the sequel to the smash 1999 Playstation hit Legacy of Kain: Soul Reaver. For those of us who had played the original Soul Reaver, we were all awaiting the continuation of the series where Kain and Raziel would confront their true destinies and uncover more about Nosgoth's past. I think it's safe to say we weren't disappointed. The game was blessed with a brilliant storyline that surpassed almost anything we'd seen, and the world of Nosgoth was realized beautifully in a powerful graphics engine. Raziel may have been limited in combat, but there was a sense of exploration here that caught your attention strongly and rarely let you go until the end of the game. I've recommended the game and the series to a user on my Flist before, and I still stand by that recommendation. The game was more linear than its predecessor, but the storytelling more than made up for that, on the first playthrough. Look at the Dark Forge, the Air Forge, and the Mountain Aerie for some of the most magnificent locations in gaming. I wish we'd see locations like this in gaming today. O_O Unfortunately, Crystal Dynamics not completing the games and Eidos not promoting them heavily led to Eidos canceling the series. Crystal Dynamics never completed its games, and there was always a mountain of cut material left on the cutting room floor. It's ironic in that Crystal Dynamics not completing the first game gave us the Legacy of Kain franchise. Had Crystal Dynamics completed the first game, we would have gotten a game with a very different ending, and CD would have had to go back and alter the storyline in order to continue the series (see explanation later on, in terms of spoilers for Kain and what would have occurred in the first game; I'll provide a link.). But by not completing the second and fourth games, CD hampered the success of the series.\n\nAlso, everyone was at the top of their game here. Both the actors and their characters were in perfect form here, with the dialogue being unmatched in its dramatic presentation and the characters' voices being absolutely perfect here, with the actors being heavily interested in their characters. Just look at Raziel's observations on his former brothers-in-arms of the Sarafan Order when he encounters them for the first time 500 years in Nosgoth's past:\n\n\"And while I confess, I felt a twinge of longing, a pang of grief, for what I had believed was my lost virtue, I regarded them now with none of the reverence I had so recently felt. For I had seen the human face of the vampire...and now, I beheld the monstrousness of these men.\"\n\nGood stuff, there. ;) Playing Legacy of Kain is like sipping from a glass of 200 year old wine, if you're into that sort of thing. >_> This was one of the most quotable games ever released up until that time, and I think you can see why. I think they made a mistake when they toned it down for Defiance. Just because some reviewers complained about it, that doesn't mean you have to change things up. These games aren't made for them. These games are made for the fans. If the fans decide they like the dialogue the way it is, then it's alright. :) There are also some poignant moments to it, shown in the scene where Janos is dying and Raziel's \"While I have taken yours\" response, after Janos says that perhaps his purpose was to save Raziel's life this once. It's a nice warm moment in what is usually a very dark story, showing that at least one person here has a heart. Blood Omen is a ruthless game on that front, with the tone being very cynical and unemotional, but if you only have darkness all the time, it gets boring after a while. By having Raziel show some actual grief, Crystal Dynamics establishes Raziel as a much more human character that we can relate to. This game and the subsequent sequel also do the same with Kain, albeit in a more subtle way. Kain wasn't a very emotional protagonist in Blood Omen, as fans of the series know, and that does keep you at a certain level of detachment from him. Kain even jokes about it in Defiance, saying \"I always was considered heartless.\" In this way, I think Crystal Dynamics definitely improved on their predecessors from Silicon Knights. There was also a slight bit of humor to it - not much, but there was some. Just look at Raziel's annoyance when Moebius appears posing as a ghost in the future, trying to entice Raziel over to his side again. 'My god, will this bastard never go away?' You can tell what Raziel is thinking. ;D\n\nThis wasn't always one of my favorites. When Blood Omen 2 came out, I was immediately convinced that the Blood Omen team had put out a better game than Soul Reaver 2. Thankfully I re-evaluated the game later on and realized how inferior Blood Omen 2 was. Blood Omen 2's team screwed up in so many ways it's not even funny. This is the definite sequel to the Soul Reaver storyline, which is derived greatly from the events portrayed in the original Blood Omen. It is also one of the best games produced in the generation of Playstation 2 games in terms of pure storytelling.\n\nI also can't say I'm sad the project got taken away from the original team. Some people say they await the true sequel to Blood Omen: Legacy of Kain - Blood Omen: Legacy of Kain 2, but if it had been up to Silicon Knights, we wouldn't have had any sequels. Silicon Knights has made what - 2 games in the past 10 years? The developers at Silicon Knights take an extraordinarily long amount of time to develop games. That doesn't bode well for us gamers. They weren't interested in continuing the story, and made it clear they wanted to focus solely on Too Human. Ironically enough, Too Human ended up being a critical and commercial flop. Not bad, but not the masterpiece it was supposed to be. For those not in the known, here is a little background on the series.\n\nBlood Omen was the first game in the Legacy of Kain series, and the one that started the Legacy of Kain franchise. It was developed by Silicon Knights and Crystal Dynamics, and then the series was taken from the hands of Silicon Knights and given to Crystal Dynamics. Crystal Dynamics then took a very different direction with the story, in Legacy of Kain: Soul Reaver. That is the 'first' game I referred to in the above paragraphs, where I mentioned that things would have been very different had Crystal Dynamics proceeded with their original plans.\n\nHere is a link that shows you what would have happened had Soul Reaver 1 proceeded on its original path. Take a look at it. It's very interesting, and I suggest you check it out. There are a lot of very other interesting things on there, so it makes for a good read. Here is a link to a site containing all of the information on the Legacy of Kain story:, if you have some unanswered questions about the series. Be forewarned: there are massive SPOILERS on that site, so don't check it out unless you've beaten all the games, or wish to check out the story regardless of that.\n\nAs Kain would say, Vae Victus. >_>\n\n22 December 2009 @ 07:29 pm\nBecause the last post was controversial, here's something lighter for you to enjoy over a snack this time and wash away the previous memories:\n\nBehold the wit and wisdom of the Middleman, in his naturally elegant stance. >_>\n\nGo ahead. I'm as serious as a hefty bag full of rottweilers! ;D\n\n29 November 2009 @ 01:12 am\nI recently replied to a post on lazypadawan's journal from about a month ago on horror in the Star Wars universe. It's outdated, but I haven't visited her journal in about a year. I already posted the response over there, but here it is as well.\n\n\n\"I've seen Forever Knight crossovers with Star Trek before that worked surprisingly well, so anything is possible.\n\nI think vampires could very well be the work of the Sith. The Sith could have performed some experiment thousands of years ago, people were warped by Sith alchemy, and now these creatures roam the galaxy under the cover of nightfall, not really predators, but victims of others' misfortunes in crossing the path of the Sith. In fact, a vampire Jedi would be a very interesting idea. I wonder how the Jedi would react to a being that could have higher Force potential than usual, but requires a living being's blood to sustain itself? That would give them a more different dilemma than usual - \"do we recruit this being, or do we turn it away? Or do we kill it despite actually working against the Sith?\"\n\nI think horror is a very plausible genre in Star Wars, considering all the experiments that are probably being performed in the GFFA on living beings. In fact, wasn't there a comic book series along those lines? The Empire alone could probably write a book of horror movie revolutions based on all the experiments it probably performed on people. Darth Sidious is very creepy in nature, and Darth Plagueis' experiments with midichlorians is definitely shudder inspiring. Anakin's conception is probably the creepiest, the idea that a Sith Lord could influence a person's very being to create life (I don't believe it, but it's worth bringing up), if it has any truth to it. The idea that a being could create another being through sheer force of will, and create any kind of being he wanted. Now you're crossing into God territory. The potential for abominations is endless, and Anakin could have easily been a very monstrous creature if he had been created by the Sith. He wasn't, but the thing that could have resulted could have been the most terrible, most inhuman Sith Lord imaginable, if Darth Plagueis had succeeded in his experiments.\n\nVader himself is very horror inducing. I used to shudder whenever I read the Technical Commentaries, because of the sheer injuries his body must have gone through. There was always something creepy about it, the way this man was still standing despite being a nightmare of ghastly medical problems. Definitely not the type of thing you want to contemplate on for too long. Especially given the descriptions in \"The Rise of Lord Vader\" of necrotic flesh across his body. Medical horror is always one of those things that gets me squirming. I daresay Vader is more terrifying than any vampire could ever be, because he's still alive, and not an animated corpse or other lifeform who operates in a way resembling animated corpses. He's a regular human being trapped in a nightmarish situation, who by all rights, should be very dead.\n\nFor all the strengths of Star Wars, the one downside I find depressing about is that it gets boring sometimes, always being about the Empire vs Rebels, or Jedi against battle droids, or Jedi against the Sith. Horror provides a different take on the galaxy from all those conflicts, and I think it's a fertile genre that should be more exploited. Romance and action are already pretty well covered, so why not horror too? Especially when the GFFA is one of the most terrifying places around in fiction, when you think about it? We would love to live there, but at the same time, we can't deny there are a ton of terrible things that could happen to us, many of which we are thankfully spared from in our reality (though we have our own petty problems).\"\n\n\nForever Knight has recently struck my fancy again, so I think I might write something with vampires soon. It might not be in the Star Wars universe, but it will involve some of my characters. It'll be a glimpse at some of the chaos in my alternate universe near the end of its life cycle, where Silent Hill crosses with several other genres.\n27 November 2009 @ 05:45 pm\nI was watching Deal or No Deal, and here is the most recent moron from the past episodes airing on GSN, one Carmen Gantt:\n\nThis shows you shouldn't listen to idiot relatives. The way her relatives kept pushing her forward despite the terrible odds against her was repulsive, and she should have damn well told them to shut up. The most amazing part was the little boy that kept telling her \"no deal\", regardless of the odds against her.\n\nSorry little boy, but you don't know shit about the way the world works. This woman listening to her son, who clearly had no concept of how the odds work on that show, shows how some people simply cannot go against their relatives, no matter how disastrous their judgment. If it were me, I would have told that little boy to shut up and that he knew nothing about what that money would do for him, then taken the deal. I wanted to slap this little boy for his annoying stupidity. You don't listen to people like this!\n\nShe should have divorced her husband again after this. The hell with love...this man literally caused her to throw away her children's future and the payment for her own debts, accumulated from their obviously stupid divorce, if they got together again after it. I don't know which one is worse: the husband for telling her to go so far and then changing his mind with only a feeble effort of saying \"Deal\", or her for listening to her husband and son, who were clearly out of their minds. I am honestly surprised nobody has slapped their spouse or walked out on them on that show, considering all the times stupid spouses have caused their significant others to lose money, or the time SMART people have had to watch their relatives slam the lid on the offers and lose out on many thousands of dollars. I remember one time when a little boy was upset his father didn't take the deal, because all the relatives were telling him to take the deal and he didn't do it. If it were me, I would not speak to that man again for a year. I would have reminded him every day of his stupidity, because it wasn't just his money he threw away, it was ALL their money, and he left like an idiot with nothing. And the worst ones are the ones who go on things like \"faith\" and \"luck\", rather than realizing this is based on chance. There was only one guy on there who seemed destined to win more, and that was because the fact the number 12 (or whatever it was) kept showing up again and again in his life, and the fact the highest amount left was in the number 12, is too much of a coincidence to ignore (almost). But other than that, \"faith\" doesn't count for shit on this show. \"Faith\" can't change the amount of money that's in a case.\n\nI don't empathize with people like this, and I think it depends on the situation. I only empathize with people on game shows like Catch 21, where they're clearly winning based on skill and then they find out they could have gone further, rather than the $5,000 they settled for. Likewise, I think this isn't so much entertainment, as it is drama. It's drama because you're watching a struggle for money and there are very real emotions at stake. Entertainment is something that amuses you and lets you have fun watching, even if there are some emotions later on. This is just painful to watch sometimes. There are also startling psychological consequences. Can you live with yourself knowing you threw away your family's chance for a better life; the chance for your child to go to college? In fact, considering today's economic climate, it might very well have been the only way he would have gone to college without accumulating a massive debt (the little boy in this episode). The sheer stupidity in this game is startling, but the fact it has such emotional content and devastating consequences moves it away from entertainment and more towards drama. I don't know if that analysis makes sense or not, but Deal or No Deal is definitely not fun. It's addictive, if you watch it enough, but it's not fun.\n04 November 2009 @ 06:54 pm\nI ran across an article on sex while in my daily travels today, and I decided to share with you my comments on this thread and its content. The title refers to the downright idiotic statements made by two particular users on that thread. Warning: the following will include mentions of sex and other racy matters that may not be suitable for all ages. If you're too squeamish or of a certain age, back away now:\n\nHidden behind a cut, because it's too offensive for my eyes.Collapse )\n\nMy comment is the one at the bottom, in case you want to check it out (and it gets approved by the moderator). It's the one that says 'Anthony', since that's my name. >_>\n\nNow that I've taken care of the actual quotes, I'll get started with my comments on the thread and its implications towards the male gender. Some of this may get a little racy, so I'm warning you. I'm not one to shy away from talking about sex online, since that's the only way I talk about it in my life. I'll start with the first comment, since that's by far the more offensive of the two.\n\nWarning: mentions of sex and gender issues ahead.Collapse )\n",
  "response": "### **Overall Scene Theme and Core Concept**  \n**Title: \"The Forgotten Archive of Nosgoth\"**  \n*Inspired by: The Legacy of Kain series' gothic architecture, time-manipulation themes, and the protagonist Raziel’s exploration of ancient ruins.*  \n\n**Core Concept:**  \nA dilapidated, semi-submerged archive from the ancient vampire civilization of Nosgoth, now partially overtaken by nature and time-distortion anomalies. The archive is a labyrinth of crumbling stone corridors, flooded chambers, and unstable portals to different eras. The environment is inherently collaborative due to:  \n- **Heavy environmental puzzles** (shifting platforms, sealed doors requiring simultaneous lever pulls).  \n- **Time-shifted objects** (an artifact in the past must be moved to affect the present).  \n- **Hostile remnants** (undead scholars, malfunctioning golems, and spectral guardians).  \n\n---\n\n### **Spatial Layout and Area Descriptions**  \n1. **The Grand Atrium (Entry Hall)**  \n   - A vaulted chamber with a collapsed ceiling, allowing shafts of moonlight. The floor is a mosaic of the vampire empire’s history, now cracked and pooled with stagnant water.  \n   - **Key Feature:** A massive, inactive time-glyph mechanism in the center, missing its three keystones.  \n\n2. **The Drowned Scriptorium (Flooded Library)**  \n   - A lower level where shelves of ancient tomes are half-submerged. The water is eerily still, reflecting floating candles.  \n   - **Key Feature:** A rusted crank system to drain the room, but it’s jammed by a fallen pillar.  \n\n3. **The Chronal Vault (Time-Distorted Treasury)**  \n   - A circular room where objects flicker between eras (e.g., a pristine urn in the past is a shattered relic in the present).  \n   - **Key Feature:** A sealed sarcophagus that exists both \"locked\" (present) and \"open\" (past).  \n\n4. **The Golem Workshop (Mechanical Hazard Zone)**  \n   - Scattered blueprints and half-assembled guardian golems. One active golem patrols, its crystal core exposed but out of reach.  \n   - **Key Feature:** A ceiling-mounted crane with a broken control panel.  \n\n5. **The Scholar’s Crypt (Hidden Catacombs)**  \n   - A cramped catacomb lined with skeletal scribes still clutching quills. The walls are etched with prophecies in a dead language.  \n   - **Key Feature:** A pedestal with a spectral inkwell—dipping a quill reveals hidden text.  \n\n---\n\n### **Detailed Area-by-Area Inventory**  \n#### **1. The Grand Atrium**  \n**a. Anchor Furniture & Installations:**  \n- A 4-meter-tall obsidian obelisk (weight: ~800kg) with three empty slots for keystones.  \n- Two stone braziers (extinguished, filled with old ash).  \n\n**b. Key Interactive Objects:**  \n- **Keystone Fragments (x3):**  \n  - *Fragment 1:* Lodged in a crevice (requires two agents to pry loose).  \n  - *Fragment 2:* Underwater in the Scriptorium (glows faintly; detectable only in the past).  \n  - *Fragment 3:* Held by a spectral guardian (must be bargained with or tricked).  \n\n**c. Functional Ambient Objects:**  \n- A frayed rope ladder (leads to a broken balcony).  \n- A dented hourglass (sand is frozen mid-fall).  \n\n**d. Background Objects:**  \n- Faded murals of vampire lords (one’s eyes follow movement).  \n- A skeletal hand gripping a snapped quill (ink long dried).  \n\n---  \n*(Continued for other areas with similar detail...)*  \n\n---\n\n### **Scene Affordances and Embedded Potential**  \n**Collaborative Transportation Example:**  \n- The **obsidian obelisk** (800kg, 4m tall) must be rotated to align with glyphs. Requires synchronized lever-pulling and a counterweight system using the workshop’s crane.  \n\n**Reasoning & Tool-Use Example:**  \n- **Problem:** The flooded scriptorium’s crank is jammed by a **2-ton pillar**.  \n- **Solution:**  \n  1. Use the Chronal Vault to phase the pillar into the past (where it’s lighter).  \n  2. Attach the crane’s hooks (present) while the pillar is \"ghosted\" (past).  \n  3. Reactivate the vault to merge timelines, lifting the pillar.  \n\n**Attribute-Based Challenge:**  \n- Among five **\"Soul Vials\"** on a shelf, only one is unbroken (needed to appease the spectral guardian).  \n  - *Correct Vial:* \"Cracked but intact, filled with blue mist, labeled ‘Kain’ in faded script.\"  \n  - *Distractors:* Shattered vials, a decorative blue bottle (non-interactive), a vial filled with sand (fake).  \n\n---  \n**Final Notes:**  \nThis scene is a playground for:  \n- **Multi-agent physics puzzles** (time-shifted weight, synchronized actions).  \n- **Layered storytelling** (deciphering prophecies, uncovering the archive’s fall).  \n- **Dynamic threats** (golems react to noise; water levels rise if drains are neglected).  \n\nEvery object serves a purpose—even the \"background\" skeletal scribes hint at a puzzle solution (their bones are arranged to point to hidden levers)."
}