{
  "id": 1023,
  "raw": "\nRetrieved from http://programmers.stackexchange.com/questions/79487/quitting-a-small-start-up-where-you-are-a-primary-developer/79500\nText:\nTake the 2-minute tour ×\n\nJust curious to hear from other people who may have been in similar situations. I work for a small startup (very small) where I am the main developer for a major part of the app they are building, the other dev they have does a different area of work than I do so couldn't take over my part. I've been with the company 5 months, or so, but I am looking at going to a more stable company soon because its just getting to be too much stress, overtime, pressure, etc for too little benefit and I miss working with other developers who can help out on a project. The guy is happy with my work and I think I've helped them get pretty far but I've realized I just don't like being this much \"on the edge\" as its hard to tell what the direction of the company is going to be since its so new. Also, even though I'm the main dev for the project, I would still only consider myself a mid-level dev and am selling myself as such for the new job search.\n\nJust to add more detail, I'm not a partner or anything in the company and this was never discussed, so I just work on a W2 (with no benefits of course). I work at home so that makes it easier to leave, I guess, but I don't want to just screw the guy over but also don't want to be tied in for too long. Obviously I would plan to give 2 weeks notice at least, but should I give more? How should I bring up the subject because I know its going to be a touchy thing to bring up. Any advice is appreciated\n\nUPDATE: Thanks everyone for posting on this, I have now just completed the process of accepting an offer with a larger company and quitting the startup. I have given 2 weeks notice and have offered to make myself available after that if needed, basically its a really small company at this point so it would only be 1 dev that I would have to deal with... anyways, it looks like it may work out well as far as me maintaining a good relationship with the founder for future work together, I made it out to be more of a personal / lifestyle issue than about their flaws / shortcomings which definitely seems to help in leaving on a good note\n\nshare|improve this question\n\n\n\nI would tell the owner how it is. Perhaps they can make an adjustment, at least temporarily, while you transfer the knowledge over. –  Job May 26 '11 at 20:56\nyeah I was thinking that but I just don't know how soon they can find someone to step in, I figure at least if I can finish off the main stuff now then I am at least leaving them with a fully working app (its pretty stable now as is) and I will finish documenting etc, then its on them to find someone else who wants to work with them –  programmx10 May 26 '11 at 20:58\nIf you're doing all the dev and you don't have some serious stake in the company then I think you've entered into a bad arrangement already. If you'd stay for a bigger chunk of the pie then lay it out to the owner. I want x% ownership or I'm leaving. If partial ownership doesn't matter to you then probably the company has no serious hope of every being worth something. And if that's the case why are you wasting your time? –  Kevin May 26 '11 at 21:22\nProbably related: programmers.stackexchange.com/questions/72090/… –  Benjol May 27 '11 at 5:49\n@Kevin, well I was getting paid what I considered a fair rate when I took the job, it was a step up for me as far as the type of programming / platform and let me get paid while learning new things so no issues on that, but I get what you mean after a while and thats where I ended up, basically too much pressure / responsibility for not enough pay but the current job I just got was definitely a direct result of my experience with this company (pretty much all I talked about in the interview was things I learned from working on the startup project) so I can't say its all bad –  programmx10 Jun 30 '11 at 1:59\n\n7 Answers 7\n\nup vote 19 down vote accepted\n\nAs harsh as it may sound, it's not your problem. The owner should be smart enough to have a contingency plan for key personnel leaving, if not, again it is not your problem.\n\nLook at it the other way, if you have agreed to starting at your new job at a particular starting date, you do not want to jeopardise it with delays from your old job.\n\nIt looks you are going to do the right thing before leaving, eg keep the documentation up to date, knowledge transfer etc.\n\nshare|improve this answer\nFor a small startup there is often no room for a contingency to the main developer leaving. Just assuming the business will be fine with you up and leaving shows a lack of respect for the people you worked with there. You can definitely leave, but to somehow treat this as leaving a large company is simply wrong. –  edA-qa mort-ora-y May 27 '11 at 12:35\nI agree and I'm not treating it that way, I'm the main web developer but there are other dev parts of the project, but I get what you mean and I think its important to help them transition but the bottom line is they don't their workers and if they never offered equity at the start, etc or talked about that with the developer than they are being naive to think that they developer will stay with them no matter what, if its presented as a job from the beginning and the dev takes it as such then the expectations should be that they can leave as they see fit just as with any job –  programmx10 Jun 30 '11 at 2:02\nI've been thinking about exactly this problem and it keeps coming back to that: the fact that they cannot provide you the working conditions you need is their fault, not your, and the fact that they need you does not create an obligation on your part. That said, yes, don't be a jerk about it. –  Malvolio Jun 30 '11 at 5:39\n\nI would give them 4-5 weeks if you really want to help them along. Honestly, they might be in trouble though if they have not really prepared for you leaving at all. This is their fault not yours though, especially if they are not compensating you generiously. If you are going to put all your eggs in one basket, you have to protect that basket at all costs. If they can get a decent package together for the next person, they MIGHT be able to find someone in 3-4 weeks, giving you 1-2 weeks of knowledge transfer. By the sounds of it, however, they lack the resources required to bring someone experienced enough to take over in that sort of a time frame.\n\nAt the same time, 2 weeks is perfectly reasonable and I would not lose any sleep over it.\n\nshare|improve this answer\nyeah, well he's already started talking about how he's talking to people about getting additional funding, etc which could be taken 2 ways, I guess, but I can just sense the stress now that we are starting some initial trials with clients, etc so I'm definitely starting to look around at other opportunities and if the right one comes along I just don't see myself staying where I am and turning it down –  programmx10 May 26 '11 at 21:15\n\nIf you are 100% sure that you want to quit, tell him, and help get your knowledge transferred as much as (reasonably) possible. The other answers give good advice about this.\n\nBut if you just feel like you're not given enough incentives to stay, you can raise that point too. You probably don't have to quit to get a better offer.\n\nTell him you feel your compensation doesn't match your responsibilities, and you are looking at other offers. That for example another experienced developer would help lighten your load. If that's not possible (strapped for cash and all), maybe you can find some other way to be compensated for your role.\n\nWhen playing a major role in a start-up, some stock options are a (relatively) simple way to get recognized for your effort. If he's looking at funding, talk about these things as soon as possible, so he can discuss this with the investor. Of course, stock options only work if the company is going to be successful, so think about that. Start-ups are a great way to get lots of experience, so consider your options before quitting.\n\nshare|improve this answer\ngood points but I'm not even sure I want just more money, its more of a work - life balance issue and I don't think I want stock options, etc as I don't want to have to stick around long enough for them to take affect –  programmx10 May 26 '11 at 21:40\n@programmx10, often very minor adjustments can have a huge improvement in quality of life issues. If the only other option is leaving you may find your employer extremely accommodating to your needs. –  edA-qa mort-ora-y May 27 '11 at 12:40\nStock options are like lottery tickets. Worthless unless you still have them when the numbers come up. They are used to lock in (often naive) key personal when there's nothing else in the cupboard. Every once is a while, it makes a developer rich. More often than not, by the time its been through a few rounds of VC funding, takeovers and floats, that original 1% or 10% option is now worth no more than a few grand, only to those that did not burn out along the way. (yes, I am a cynic) –  mattnz May 29 '11 at 22:03\n@mattnz, definitely agree... I think I'm better of progressing to be really senior level myself and after a number of years doing my own startup than staying with a startup founded by a non-tech guy, I definitely agree its a losing game for the most part with the stock options and there are opportunities to be entrepreneurial as a developer (especially once one has good lead dev / architecting experience) than just working for any other startup that comes along –  programmx10 Jun 30 '11 at 2:07\n\nGive your two weeks. If they feel that they really need you, then you can negotiate at that point for either staying on longer.\n\nRemember, that you can also give your two weeks, leave, and then stay on as a contractor with it known that you're there temporarily until A: you see fit to leave or B: a replacement is found. Just be sure that your contractual agreement afterward gives you the option to leave at your, and the employer's, leisure. You don't want to get locked into a contracting gig that takes up too much time from your next job.\n\nI did this, and the employer never ended up needing me to work under contract at all because they were able to find a suitable replacement after I gave my notice. The only thing that was required was writing/providing additional documentation/clarification for the replacement developer by e-mail.\n\nshare|improve this answer\nIf, like me, you have morals and profession ethics you will leave on the understanding you are available (for a fee that discourages it, but is not extortion) to provide training and support to a replacement developer. When you take your next job, do so with an agreement that you are free to take the odd day or half day off to provide support for your previous employer (it shows a profession ethics, so it's not seen as a bad thing). I have done this on several occasions, it has always worked out well for both of us. –  mattnz May 26 '11 at 23:34\n@mattnz: I've been in the situation where the employer I was trying to leave never wanted or tried to find a replacement and kept trying to dump work on me. It's a 2 way street; last time I checked, there weren't any moral obligations on the side of the company to keep employing you until it's more convenient for you after they've decided that they don't want or need you anymore. –  Steve Evers May 27 '11 at 0:06\nAs it hurt them less to pay you than replace you, were you charging them too enough? At some point you do need to just cut them adrift, that's not a very professional first response (particularly with a start up). The OP is looking for an ethical, professional exit strategy, rather than dealing with a employee who won't let him go. –  mattnz May 29 '11 at 21:54\n\nHaving been on the receiving end of key people leaving more than I'd like... I'd suggest you at least try to raise the issues with your boss. Mention that you don't think the startup environment is right for you and want to look at other options. You might see if there is some way to either make you feel valued enough to push through the stress. Who knows, you might be surprised.\n\nOn the other hand... two weeks is fine. As others have mentioned, document as much as you can, and offer to come in (as a paid consultant) if they need some limited help in the transition. Always leave on good terms, but don't jeopardize your health, finances or future employment.\n\nshare|improve this answer\nThis is pretty much what I ended up doing and he did make me feel important and even promised a raise (above what my new job offered) but not for another 2 months, til the investment round clears, at the end of the day I can't live based on other people's promises so I gradually brought him down to where he now understands I'm leaving but have offered to help the transition and have left the door open to possibly return \"when\" (if?) they do get that $1 million in funding thats \"right around the corner\" –  programmx10 Jun 30 '11 at 2:12\nglad to hear it! good luck with the new position! –  Al Biglan Jul 1 '11 at 4:38\n\nThere is a spoken and unspoken deal between an employee and a company. If they're played fair and straight with you (eg. if you think they had to make you redundant, they would give you as much notice as possible, and not try to spring it on you with the legal minimum notice), it's fair to play fair with them -- that means, if you want to quit, you give them an opportunity to make you a better offer, you tell them you're thinking of moving on and stay for a month while you job-hunt, you do your best to enable an easy transition to a new engineer, spending your time preparing for handover, etc. It doesn't mean you stay indefinitely because they ask you nicely, the way employment works, if they want you to stay, they have to compensate you enough to make you want to!\n\nThat is to say, distinguish between dropping them in it deliberately, breaking an implied agreement, but leaving abruptly without notice (which is legal and reasonable, but may make you feel bad) and dropping them in it unavoidably because they planned their whole business around you continuing to work for them out of the goodness of your heart, which is their fault.\n\nSince you're willing to look for a new job, you're in a strong position, you know what's fair (either they compensate you in proportion to your apparent importance, or you get another job), and you have the ability to enforce it (since if you don't want to stay, you can leave).\n\nSo, decide -- what, if anything, would be a fair recompense? A share in the company? A written promise of share options[1]? A higher salary? Hiring some help so you don't need to be on call all the time? Then go and ask for it, and if not, say you know it's not their fault, but you need to work somewhere else, go job hunting and do a professional handover. Best of luck.\n\n[1] Note: as someone else pointed out, you have to decide for yourself, not based on his opinion, whether the company will be worth something.\n\nshare|improve this answer\n\nI have not been in quite the same situation, but I had a friend that was. It was during a slow point in the economy and he got into a small shop where he was clearly the best technical resource. The founder had built the software but from what my friend tells me, it was a mess. But he and another friend signed on and worked for a bit; the economy improved about six months after that and they both left at the same time.\n\nNot trying to make you feel bad here, but it devastated the company.\n\nThe company never quite recovered, but a large part of that was because the founder probably didn't do a good job of hunting for new resources...at the time there were still lots of people looking for work so I can't imagine if he'd put a serious effort in that he wouldn't have been able to find people.\n\nIn the end, salvaging and surviving the situation is a job for the company's leadership, not you. Ultimately I therefore second the advice given by others here. You do what you have to do to take care of yourself because no one else will. If you've exhausted all possibilities for staying or can see the writing on the wall that this job will not become what you signed on for, then give a professional notice of at least two weeks and then move on.\n\nshare|improve this answer\n\n",
  "response": "# **Scene Concept: \"Startup Dev's Chaotic Home Office Transition\"**  \n\n## **Overall Scene Theme and Core Concept**  \nA small startup developer’s home office in the midst of a chaotic job transition. The space is a blend of a makeshift tech workspace, personal belongings, and hastily packed equipment—reflecting the stress of leaving a critical role. The scene is inherently multi-agent due to:  \n- **Collaborative packing & handover tasks** (heavy equipment, fragile electronics, documentation organization).  \n- **Shared access to limited resources** (single workstation, shared external drives, tangled cables).  \n- **Time-sensitive urgency** (half-packed boxes, unfinished documentation, pending client files).  \n\n## **Spatial Layout and Area Descriptions**  \n1. **Main Workstation Zone** – A cluttered L-shaped desk with multiple monitors, half-dismantled hardware, and sticky notes everywhere.  \n2. **Equipment Storage Corner** – Stacked server racks, loose components, and half-packed shipping boxes with fragile labels.  \n3. **Documentation & Handover Area** – A small side table with printed manuals, USB drives, and a whiteboard covered in last-minute notes.  \n4. **Personal Belongings Cluster** – A duffel bag, a half-empty coffee mug, and scattered personal items (keys, wallet, a framed family photo).  \n\n---  \n\n## **Detailed Area-by-Area Inventory**  \n\n### **1. Main Workstation Zone**  \n**a. Anchor Furniture & Installations:**  \n- A heavy, **reinforced L-shaped desk (2.4m long, 80kg)** with a **dual-monitor stand (adjustable, one monitor flickering)**.  \n- A **premium ergonomic chair (wheels locked, lumbar support detached)**.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Primary development laptop (MacBook Pro, lid slightly warped, fan whirring loudly)** – contains the last unsaved project files.  \n- **External RAID array (5TB, blinking red \"storage full\" LED, USB-C cable frayed at the connector)** – critical backups inside.  \n- **Mechanical keyboard (Cherry MX Blue switches, missing the \"W\" keycap)** – heavily used.  \n\n**c. Functional Ambient Objects:**  \n- **Desk lamp (adjustable gooseneck, flickering intermittently)**.  \n- **Wireless charger (Qi-compatible, overheating slightly, phone at 12% battery)**.  \n- **Sticky notes (yellow, peeling off, with scribbled SQL queries and API keys)**.  \n\n**d. Background & Decorative Objects:**  \n- A **faded \"Hack the Planet!\" poster (torn corner)**.  \n- **Empty energy drink cans (3x, crushed, brands mismatched)**.  \n- **A novelty \"World's Okayest Developer\" mug (coffee stains inside, chipped handle)**.  \n\n---  \n\n### **2. Equipment Storage Corner**  \n**a. Anchor Furniture & Installations:**  \n- A **four-tier metal server rack (1.8m tall, 120kg, wheels jammed)** with **two empty slots**.  \n- A **stack of cardboard boxes (sealed with \"FRAGILE – BIOMETRIC HARDWARE\" in red marker)**.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Prototype device (black casing, \"DO NOT SHIP – V0.9\" sticker, missing screws)** – requires two people to lift safely.  \n- **NAS backup unit (Synology DiskStation, 4 drives, one blinking amber \"disk failure\" light)**.  \n- **Label maker (Brother PT-D210, out of tape, jammed print head)** – needed for final equipment tags.  \n\n**c. Functional Ambient Objects:**  \n- **Box of assorted cables (USB-C, HDMI, coiled Ethernet – tangled beyond easy separation)**.  \n- **Anti-static mats (folded, dust-covered, one with a coffee stain)**.  \n\n**d. Background & Decorative Objects:**  \n- **A forgotten ficus plant (wilting, half-dead, in a cracked ceramic pot)**.  \n- **A stack of outdated tech magazines (Wired, 2021 issues, edges yellowed)**.  \n\n---  \n\n### **3. Documentation & Handover Area**  \n**a. Anchor Furniture & Installations:**  \n- **Small folding table (wobbly left leg, 70cm x 70cm)**.  \n- **Wall-mounted whiteboard (covered in smudged dry-erase notes, one corner detached)**.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Binder labeled \"API DOCS – FINAL v3.2\" (contents partially spilled, loose pages mixed up)**.  \n- **Encrypted USB drive (Samsung T7, fingerprint smudged, labeled \"BACKUP_OR_DELETE\")**.  \n- **Printed employment contract (highlighted clauses, sticky note: \"NON-COMPETE??\")**.  \n\n**c. Functional Ambient Objects:**  \n- **Stapler (jammed, out of staples)**.  \n- **Three-ring hole punch (missing the alignment guide)**.  \n\n**d. Background & Decorative Objects:**  \n- **A motivational calendar (still on April, quote: \"Hustle Harder!\")**.  \n- **A dusty Rubik's Cube (partially solved, stickers peeling)**.  \n\n---  \n\n## **Scene Affordances and Embedded Potential**  \n\n### **Collaborative Transportation Affordances**  \n- **Server rack relocation (120kg, 1.8m tall)** – Requires **two agents** to maneuver without damaging adjacent equipment.  \n- **Prototype device (15kg, irregular shape, \"FRAGILE\" label)** – Needs **precise handling** and coordination to avoid dropping.  \n\n### **Reasoning and Tool-Use Affordances**  \n- **Attribute-based Reasoning:** Among **five USB drives** on the desk, only **one** has the **correct backup** (identified by: **scratched silver casing, red \"FINAL\" sticker, 512GB capacity**). The others are decoys (old backups, personal files).  \n- **Compound (Tool-Use) Reasoning:** The **jammed label maker** requires **replacement tape (in the bottom drawer)** and **cleaning the print head (with isopropyl wipes from the first aid kit)** to function.  \n\nThis dense, high-stakes environment forces **collaborative problem-solving**, **precise object identification**, and **dynamic task prioritization**—perfect for embodied AI simulation."
}