{
  "id": 1038,
  "raw": "\nRetrieved from http://www.abc.net.au/stateline/act/content/2006/s1980541.htm\nText:\nMacklin on Rudd\n\nBroadcast: 06/07/2007\n\nReporter: Philip Williams\n\nRobert Macklin had his doubts about Kevin Rudd as he started his research into a man whose life has been shaped by bad and very good luck. Some of it right here in Canberra. After talking to the extended Rudd family, Robert Macklin has changed his mind. What hasn't changed is the Kevin Rudd as captured by his family over five decades.\n\nKEVIN RUDD: My name's Kevin, I'm from Queensland, I'm here to help.\n\nPHILIP WILLIAMS: What is it about him that suddenly propels him to the forefront of Australian politics and a potential prime minister, do you think?\n\nROBERT MACKLIN: You know I think the answer to that can be found in his life story. I suspect it goes all the way back to the time when he lost his dad in that car accident and then for the next two years was just flung from pillar to post in what he called the bleak charity of the times finishing up in that dreadful situation where he and his mum and his sister spent a couple of nights actually having to sleep in the car.\n\nAnd I think that in a way Kevin Rudd is still running from that dreadful experience, you know, that sense of anxiety that the nightmare can create in a young kid.\n\nI think that he decided at a certain time, it was about when he was 15, he actually made a decision that he would make a change in his life so that that sort of thing would never ever happen again.\n\nHe turned to education for that and it was education that propelled him to the next step and then the next step until finally you've got a person who is running to be prime minister.\n\nPHILIP WILLIAMS: You've got though a person who has been through what many would regard as a severe experience and yet he's not radicalised, he's not on the fringes, he's not to the far left. He's very much in the centre of Australian politics, a very cautious person.\n\nROBERT MACKLIN: I honestly think that goes back to his family. His dad was a Country Party man. They were living in a very conservative area, Nambour, which I call the very buckle of the Bible belt of Queensland.\n\nAnd he had a very supportive mum and sister and elder brother... two elder brothers. And he also seems to have had some inner resources that have allowed him to make the best of a situation rather than to drop his bundle.\n\nPHILIP WILLIAMS: Christianity too is at the core of his being and yet he doesn't come across as evangelising at all.\n\nROBERT MACKLIN: No, he doesn't. He has a sense that religion provides for him a moral compass. He actually believes that. I don't believe it. I think...\n\n\nROBERT MACKLIN: No, I don't. I think that his moral compass comes like it does for all of us, learned at our mother's knee.\n\nKEVIN RUDD: I have an interest in sport, I've got an interest in reading, in music, in politics. I'm all those things.\n\nPHILIP WILLIAMS: There was a moment in '96 where he decided he was going to enter the big arena. How big a decision was that for him and also for his partner Therese?\n\nROBERT MACKLIN: It was a big, big decision for him but what really surprised me was when I got to talk to Therese. It was then that I put to her what was your reaction when he said to you \"We're going to have to change our lives if I run for parliament and I'd like to do it?\"\n\nAnd when I put that to her there was a silence and she began to cry, just a tear escaped, and I wondered what nerve I'd touched. And she leaned forward and she said, \"Robert, I had been waiting for him to say that almost the moment we met.\"\n\nIt pangs a kind of relief and I said to him I will support you every inch of the way because you have supported me in all the time we've been together.\n\nAnd she said that she knew that he had something very special to give and that was the reason she wanted him to take that step.\n\nPHILIP WILLIAMS: He started his studies here and was in residence at Burkman College at ANU and that changed his life.\n\nROBERT MACKLIN: He met Therese there the very first time he went down for breakfast and it was something that she said to him that stuck in his mind.\n\nShe said something like \"Do you know I don't think I've ever met a Kevin before\" and here's this private school lady. I think he took that instantly as a challenge. He felt that she was putting him down slightly and maybe she was.\n\nBut they quickly formed a very close friendship and when Kevin went away to Taiwan for a year prior to doing his honours year, she stayed in the public service here and they corresponded and by the time he came back they had pretty much decided that they would spend the rest of their lives together.\n\nPHILIP WILLIAMS: And then a diplomatic career.\n\nROBERT MACKLIN: Almost immediately he was seen as the star, a riser star in the department.\n\nI found it quite amusing that at the same time Alexander Downer was a young diplomat and he was not seen as a star at all and that had a very interesting little addendum to it later in life because when he missed out on that 1996 election, that first time he stood for Griffith in Queensland, he thought he might go back to foreign affairs in Brisbane.\n\nBut just at that moment, Alexander Downer was appointed Foreign Minister.\n\nALEXANDER DOWNER: I Alexander John Goss Downer truly swear that I will serve the people of Australia in the office of Minister for Foreign Affairs.\n\nROBERT MACKLIN: Kevin knew because of the rivalry that had been there that there was no way known he'd give a tick to that. So instead of continuing a diplomatic career, he went back to politics.\n\nPHILIP WILLIAMS: Is it too long a bow to draw then that perhaps that action back in '96 precipitated the man that could potentially undo Alexander Downer's Government?\n\nROBERT MACKLIN: Yes, and wouldn't that be an interesting irony.\n\nHe's very at home with himself. He's got a decency and an honesty that I think we desperately need in politics.\n\nPHILIP WILLIAMS: And yet some people have said in past that he's displayed arrogance.\n\nROBERT MACKLIN: Oh, he has, oh, he has. In Queensland in his 30s, he was an arrogant character. I've got no doubt about that whatsoever.\n\nPHILIP WILLIAMS: Has it changed?\n\nROBERT MACKLIN: Yes, it has changed and I think the reason it's changed is the real kick in the backside he got when he stood first for the seat of Griffith in '96 and the electors said no and it gave him such... it knocked the stuffing out of him but I actually think it was the making of him. It gave him a sense of humility that was lacking before.\n\nKEVIN RUDD: One of the factors which I had to consider was adding political weight, political firepower to Queensland's political presence in Canberra.\n\nPHILIP WILLIAMS: What would you say to critics that might argue because of your interviews with the family, you've been captured?\n\nROBERT MACKLIN: Oh, I'd say they're probably right. I'd say they're probably right. I came into the project very unconvinced. I actually saw Kevin Rudd as being a bit of a light weight. It wasn't until I was exposed to his background and to his vision for the country and to his personality and to that of his fascinating family, that I could see that there was real depth there.\n\nI'm unapologetic in saying that I would happily entrust my country to that man as prime minister.\n\nPHILIP WILLIAMS: I've always thought he looked like John Denver myself. Robert Macklin's book is called Kevin Rudd, The Biography. The other biography getting good reviews is Kevin Rudd, An Unauthorised Political Biography by Canberra writer and former ABC journalist, Nicholas Stuart.\n",
  "response": "**Scene Concept: The Political Archive & Strategy Hub**  \n\n**1. Overall Scene Theme and Core Concept**  \nA bustling political campaign headquarters set in a converted Canberra warehouse, serving as both an archive of historical documents and a nerve center for current strategy. The space embodies the duality of Kevin Rudd's journey—part scholarly archive (representing his educational foundation and diplomatic past) and part kinetic war room (reflecting his political ambition). The environment naturally demands multi-agent collaboration due to:  \n- **Heavy Objects:** Historical document crates requiring team lifting.  \n- **Information Complexity:** Dispersed records needing cross-referencing.  \n- **Time Pressure:** Live campaign materials requiring simultaneous editing/distribution.  \n\n**2. Spatial Layout and Area Descriptions**  \n- **Main War Room:** Central space with a U-shaped arrangement of desks, wall-mounted monitors streaming news, and a large electoral map with removable magnetic markers.  \n- **Archive Annex:** Glass-walled room with industrial shelving units, housing decades of campaign files and personal memorabilia (e.g., a box labeled \"Nambour 1973—Dad’s Country Party Materials\").  \n- **Media Studio:** Soundproofed corner with lighting rigs, a teleprompter, and a backdrop of Parliament House. A red \"ON AIR\" light hangs above the door.  \n- **Breakout Lounge:** Worn leather couches, a kettle with mismatched mugs, and a pinboard crammed with family photos (e.g., a faded snapshot of young Kevin at Burkman College).  \n- **Server Closet:** Crowded with humming equipment racks; Ethernet cables snake across the floor to a junction box marked \"PRESS FEED—DO NOT UNPLUG.\"  \n\n---  \n\n### **Detailed Area-by-Area Inventory**  \n\n**A. Main War Room**  \n**a. Anchor Furniture & Installations:**  \n- A 4m oak \"strategy table\" with a laminated Queensland electoral map under cracked glass. One leg is reinforced with duct tape.  \n- Three wall-mounted 55\" monitors: left (Sky News livestream), center (a spreadsheet of swing seats), right (a paused video of Rudd’s \"I’m here to help\" speech).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Swing Seat Calculator\"**: A tablet with a cracked screen, logged into a polling database (password: \"BibleBelt66\").  \n- **Locked Briefcase**: On the table, combination set to 1996 (Griffith election year). Inside: a draft concession speech with handwritten edits.  \n- **Broken Printer**: Jammed with a half-printed press release titled \"Education Reform.\" A red wrench leans against it.  \n\n**c. Functional Ambient Objects:**  \n- A landline phone with a sticky note: \"Downer’s Office—CALL BACK.\"  \n- A mini-fridge buzzing loudly, stocked with energy drinks and a moldy sandwich.  \n- A wheeled whiteboard with \"MORAL COMPASS?\" circled in blue marker.  \n\n**d. Background & Decorative Objects:**  \n- A framed *John Denver* album cover with a Post-it: \"HR—Pls fix resemblance jokes.\"  \n- A dusty trophy: \"Queensland Youth Debating Champion 1980.\"  \n- A corkboard with airline tickets to Taiwan pinned beside a faded love letter.  \n\n---  \n\n**B. Archive Annex**  \n**a. Anchor Furniture & Installations:**  \n- Steel shelving units (2.5m tall, weight limit 200kg/shelf). Bottom shelves hold plastic crates labeled \"DIPLOMATIC CORRESPONDENCE—CLASSIFIED.\"  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"The Accident Box\"**: A sealed banker’s box (dimensions 30x40x25cm, weight 12kg) marked \"Estate Papers—Rudd, H. (Dec. 1969).\" Requires two agents to lift safely.  \n- **Misplaced Keycard**: Tucked inside a copy of *The Art of War* on Shelf 3—unlocks the briefcase in the war room.  \n\n**c. Functional Ambient Objects:**  \n- A microfiche reader with a queued reel titled \"ANU Student Newspapers, 1981.\"  \n- A label maker out of tape, next to a half-labeled box (\"NAMBOUR PHOTOS—\").  \n\n**d. Background & Decorative Objects:**  \n- A deflated football signed \"K.R. —Go Maroons!\"  \n- A stained coffee cup holding dried-out pens.  \n- A poster of the Brisbane Skyline with a corner torn off.  \n\n---  \n\n**4. Scene Affordances and Embedded Potential**  \n- **Collaborative Transportation**: The \"Accident Box\" (12kg, bulky) requires two agents to carry without spilling contents. The war room printer (50kg) needs teamwork to move for access to a jammed paper tray.  \n- **Reasoning & Tool Use**:  \n  - **Attribute-Based**: Identifying the correct keycard among 10+ books in the archive (unique properties: \"inside *The Art of War*,\" \"blue stripe,\" \"scratched barcode\"). Distractors include similar cards in a mug or under a keyboard.  \n  - **Compound Reasoning**: Fixing the printer requires (1) fetching the wrench from the media studio, (2) clearing the jam, (3) reloading paper from a supply closet (locked; key in breakroom kettle).  \n\n**Atmosphere Enhancers**:  \n- The hum of servers, a flickering fluorescent light in the breakroom, and the smell of stale coffee ground into the war room carpet. A wall clock ticks loudly—it’s 3 minutes fast.  \n\n---  \n**Design Intent**: This scene forces agents to navigate physical collaboration, contextual clues, and layered problem-solving—mirroring Rudd’s own journey through education, diplomacy, and political hustle. The density of objects (e.g., the \"moral compass\" whiteboard vs. the locked briefcase) ties directly to the inspiration text’s themes of ambition and resilience."
}