{
  "id": 1057,
  "raw": "\nRetrieved from http://www.goodreasonblog.com/2011/04/expelled-from-creation-ministries.html\nText:\nSunday, 10 April 2011\n\nEXPELLED from Creation Ministries International!\n\nSo here's how it went down. CMI was doing its creationist thing at UWA, and then later at Curtin. As members of a guild club (UWA Atheists and Skeptics), we had approval to attend and hand out information about evolution.\n\nWe made up quite a crowd -- I'd say 15 or 20 of us from the UWA Atheist and Skeptic Society and the Perth Atheists.\n\nIt started well enough. Before the event, we had a discussion with Dr Silvestru himself, who is an affable guy, although it's scary what must be in his mind. Chatting about science with believers was also quite nice. Strangely, the believers seemed to be almost exclusively young and Asian, and they didn't talk to us. Only the older CMI helpers did.\n\nWhen it was time for the lecture to get started, the door was suddenly blocked by about five Christian door blockers, who told us we weren't welcome to attend.\n\nThat blur in the middle is Kylie Sturgess, working to secure our entry.\n\nWe explained that we just wanted to attend the lecture, assured them that we weren't interested in causing any disruption, but it was no go. We explained that it was a public event, advertised on campus, and we wanted to hear the lecture. (Even Dr Silvestru had no problem with us attending.) They said it was a private church service. Now don't you think that if it were a normal church, they'd love the chance to save an atheist like me?\n\nNegotiations were to no avail, so it was off to Curtin for the second round.\n\nSomeone must have phoned ahead to warn the organisers at Curtin, because we were greeted by more security blocking us from entry. I guess when they realised that infiltrators were trying to walk right in to a public event, they decided to tighten things up.\n\nWe took this as a challenge to see if one of us could get inside. Kylie tried brazenly walking in, but got stopped and was subjected to a long grilling. David from Perth Atheists was able to breach the first level of security, but was nabbed by the more vigilant second tier. Curses!\n\nThe hilarious thing was that Asians were admitted without question, while any Caucasians -- even Christians who had no idea what was going on -- were given the third degree by security. (Where are all the Asian atheists, by the way? Must remember to get some.) They were actually asking people what church they belonged to! One guy refused my handout, but was then interrogated at the door. I heard one guard say, \"Are you sure you go to Victory Life?\"\n\nI think it's revealing that they don't seem to think that their view can sustain the mere presence of non-believers. So much for peer review.\n\nI'd say it was successful. We handed out all 200 flyers. The CMI people were even complaining that in the UWA lecture, people were reading the flyer all the way through the service, instead of watching the presentation!\n\nI don't know if we changed anyone's mind, but that wasn't the point. The point was to raise the cost of spreading misinformation, which we did.\n\nAnd we didn't have to attend a silly and fact-challenged lecture.\n\nUPDATE: Ash from UWAASS questions the legality of the church's actions. Kylie Sturgess gives her take, and I'd like to say that she stole part of my title, right there as we were having coffee. Atheists have no morals.\n\n\n  1. Can I both grr and yay? And yes, I blatantly stole your post title (and what's a photo of me trying to be diplomatic doing online? Did you hold up your laptop?) :)\n\n  2. That's from my mobile. You came out well.\n\n    You can have all my titles! I can't stay mad at you, protest buddy. We have to meet up in a non-protest capacity.\n\n    Be sure and post that photo by (not of) Dr S. I still can't believe you asked him to take a picture of all of us!\n\n  3. Wow, you rebels! Next time maybe a back up group of atheists could hang back and be called in to act as true believers when the muscle steps in. A stealth operation I'd be happy to undertake! (Was busy with kiddlets today but I hope to help out sometime)\n\n  4. I have a theory which may explain all this nonsense.\n\n    Based on some quick sleuthing, it would seem that ZPH (Zion Praise Harvest) have a weekly church service at UWA/Curtin/Murdoch at the exact same time that they had it today. (\n\n    I would guess that Emil was just a visiting speaker who appears at different local community churchs. (This community church just happened to be a university -\n\n    It was probably never intended to be a public or open lecture, it was probably always going to be part of their church sermon.\n\n    Obviously this doesn't excuse their behaviour (which included racial profiling - and forbidding the public from attending, but it might go some ways to explaining the confusion.\n\n  5. Well, that's the thing, Maureen. You're white. You would have been given the third degree and turned away.\n\n    Asians, on the other hand, were admitted without a fuss.\n\n    Long and short of it, Zion Praise Harvest acted like idiots. Formal complaints are being prepared.\n\n  6. Interesting theory, Aaron.\n\n    I have another theory. They intended it to be public, but then chickened out when they saw us and made a snap decision to refuse us entry.\n\n    Why do I think that? They made posters. Do they make posters for their regular services?\n\n    (Actually, that's a real question. Do they?)\n\n\n",
  "response": "### **Overall Scene Theme and Core Concept**  \n**Scene Type:** *University Lecture Hall & Lobby During a Controversial Public Event*  \nThis is a charged academic environment where a creationist lecture is being held, with atheist activists attempting to gain entry. The scene is inherently multi-agent due to:  \n1. **Security Teams:** Multiple door blockers and guards coordinating to filter attendees.  \n2. **Protest Groups:** Atheist activists working in teams to infiltrate or distribute flyers.  \n3. **Lecture Staff:** Organizers, speakers, and assistants managing the event.  \n4. **Attendees:** A mix of believers (predominantly young and Asian) and unsuspecting students.  \n\nThe scene is designed to force **collaborative problem-solving** (e.g., bypassing security, coordinating flyer distribution) and **social reasoning** (e.g., identifying allies, detecting deception).  \n\n---  \n\n### **Spatial Layout and Area Descriptions**  \n1. **Main Lecture Hall** – Seats 200, dimly lit, projector screen showing creationist slides. A podium at the front with a water pitcher and notes.  \n2. **Lobby/Entryway** – Crowded with attendees and security. A folding table with event sign-in sheets and flyers.  \n3. **Security Checkpoint** – Two guards at the main doors checking IDs. A third guard monitors a secondary entrance.  \n4. **Backstage Area** – Storage closet with extra chairs, a locked cabinet (speaker’s notes inside), and a coffee machine.  \n5. **Outdoor Plaza** – Atheist activists huddle here, strategizing. A bench holds backpacks full of flyers.  \n\n---  \n\n### **Detailed Area-by-Area Inventory**  \n\n#### **1. Main Lecture Hall**  \n**a. Anchor Furniture & Installations:**  \n- Podium with a microphone (slightly feedback-prone).  \n- 200 upholstered lecture chairs (10 rows, 20 seats each).  \n- Projector screen (currently displaying a slide titled \"The Flood: Geological Evidence\").  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Speaker’s Laptop** (logged in, slideshow open—could be disrupted).  \n- **Attendee Flyers** (some are reading the atheist rebuttals instead of the lecture).  \n- **Emergency Exit** (alarm will sound if opened).  \n\n**c. Functional Ambient Objects:**  \n- **Water Pitcher** (half-full, condensation on the sides).  \n- **Lectern Light** (flickering slightly).  \n- **Fire Extinguisher** (mounted on the wall, inspection tag outdated).  \n\n**d. Background & Decorative Objects:**  \n- **Faded University Banner** (\"Excellence in Research Since 1911\").  \n- **Dusty Trophy Case** (old debate team awards).  \n- **Scattered Pens & Notepads** (some with doodles, others with lecture notes).  \n\n---  \n\n#### **2. Lobby/Entryway**  \n**a. Anchor Furniture & Installations:**  \n- Folding table with sign-in sheet (attendance log, half-filled).  \n- Bulletin board (event posters, some torn at the edges).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Security Clipboard** (list of \"approved\" attendees—mostly Asian names).  \n- **Atheist Flyer Stack** (200 copies, dwindling fast).  \n- **Locked Donation Box** (small, mounted on the table).  \n\n**c. Functional Ambient Objects:**  \n- **Coffee Dispenser** (empty, stained carafe).  \n- **Trash Bin** (overflowing with discarded flyers).  \n- **Wall Clock** (5 minutes slow).  \n\n**d. Background & Decorative Objects:**  \n- **Mismatched Chairs** (some wobble).  \n- **Outdated Safety Poster** (\"In Case of Fire...\").  \n- **Lost-and-Found Box** (single glove, a USB drive).  \n\n---  \n\n#### **3. Security Checkpoint**  \n**a. Anchor Furniture & Installations:**  \n- Two retractable belt barriers (one slightly broken).  \n- Guard podium (radio charging, crackling occasionally).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **ID Scanner** (glitchy, rejects valid cards sometimes).  \n- **Walkie-Talkie** (left on, picking up chatter).  \n- **\"Restricted Access\" Sign** (hinge loose, swinging slightly).  \n\n**c. Functional Ambient Objects:**  \n- **Metal Detector** (unplugged, non-functional).  \n- **Security Logbook** (last entry: \"White male, denied—no church affiliation\").  \n\n**d. Background & Decorative Objects:**  \n- **Chewed Gum Under Table** (old, hardened).  \n- **Fake Plant** (dusty, leaning to one side).  \n\n---  \n\n### **Scene Affordances & Embedded Potential**  \n#### **Collaborative Transportation Affordances:**  \n- **Donation Box (15kg, bolted to table)** – Requires two agents to lift and move.  \n- **Stack of Foldable Chairs (50kg total, bulky)** – Too heavy for one person.  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:**  \n  - **Five USB Drives** in lost-and-found:  \n    - Only **one** has a label: \"CMI_Backup_Key\" (lecture notes inside).  \n    - Others are blank or contain random files.  \n  - **Distractor:** A nearby laptop (locked, useless unless correct USB is found).  \n- **Compound Reasoning (Tool-Use):**  \n  - **Problem:** Locked cabinet (backstage).  \n  - **Solution:** Keycard inside a guard’s radio holster (requires distraction).  \n\nThis scene is **dense with potential tasks**:  \n- **Stealth Infiltration** (bypassing racial profiling).  \n- **Flyer Sabotage** (replacing creationist handouts).  \n- **Security Subversion** (disabling the ID scanner).  \n- **Information Retrieval** (stealing speaker notes).  \n\nEvery object has **layers of interactivity**, forcing agents to collaborate, reason, and improvise."
}