{
  "id": 1068,
  "raw": "\nRetrieved from http://www.mumsnet.com/Talk/further_education/1703288-Birmingham-uni-A-levels-not-required?pg=2\nText:\nBirmingham uni - A levels not required\n\n(57 Posts)\ncreamteas Fri 08-Mar-13 19:33:04\n\n\n\n\n\nILikeBirds Sat 09-Mar-13 13:14:00\n\nI thought this sort of thing has always gone on. I know people who had two E offers to go to Oxbridge (and this was from a state school background).\n\nIn the current system can you keep an unconditional offer in reserve?\n\nUniversities used to be able to see what other places you'd applied to, I know the university I went to used to give higher offers to those who'd applied to Oxbridge on the basis that they didn't want their offer to be used as a reserve. If you can't keep an unconditional offer in reserve then maybe this is something similar?\n\nNewFerry Sat 09-Mar-13 13:14:17\n\nCreamteas - thanks, thats very interesting ref the students applying who already have their results and confirmed what I had thought was probably the case.\n\nI think I read that unis could take (practically) unlimited numbers of AAB students last year, is that the case this year, or has this changed?\n\nAlso, I too would be interested to know whether the Jan A2 results are down, given DS did very badly in one of his modules scoring a C when he had been scoring 90%+ on mock papers\n\nMariscallRoad Sat 09-Mar-13 13:24:07\n\nCream Birminham requires 2 sorts of entry requirements. The general ones which include 3 A Levels - or other kinds - so one must do them; and also the ’specific entry requirements’ for the chosen course and I understand the issue is there. However, a student who does not perform well in A2 but already has an unconditional they would struggle from the start of the academic course; and I ve known some universities to offer good support to those students with extra tuition so as to avoid dropping off.. So if one has difficulty they expect to sort it. What we parents find most unfair is 9K, fee which rose to that level at once.\n\nBirmingham is in the QS 100 top list and has v good rep.\n\ncreamteas Sat 09-Mar-13 13:27:30\n\nIlike yes some unis used to make unconditional offers but usually only when a separate entrance exam and/or interview had taken place. As far as I know, no, you only get an unconditional offer if Birmingham is your firm. And no, at this point in time, universities can't see where else applicants have applied to.\n\nNew last year AAB+ students were deemed to be outside of student number controls and this is changing to ABB+.\n\nLast year went badly wrong for many of the top unis because the number of students getting AAB+ dropped and it was not possible to fill the places with students of lower grades as they then would be fined by the government (HEFCE worked out the number of AAB+ students expected and deducted these places from universities, but had obviously not talked to Gove/Ofqual who are on a mission to reduce grades).\n\nwebwiz Sat 09-Mar-13 13:28:12\n\nThere is a thread on the studentroom about this, the students seem a bit wary of accepting the offers though:\n\nAlso there's a telegraph article\n\nFor Maths you need to be predicted A* A* A* which a lot of schools would be reluctant to predict. Also if you were predicted that Birmingham wouldn't be the natural choice of university to study at. For the unconditional offer you need to put Birmingham as your first choice so they may pick up some risk averse students who would normally have had them as a back up choice as best.\n\nILikeBirds Sat 09-Mar-13 13:30:05\n\nDo they not interview either then? I had interviews for all the universities I'd applied to\n\nMariscallRoad Sat 09-Mar-13 13:31:41\n\nNewFerry, An exam performance involves for some students stress and might produce different results than those of a mock test where the student might feel differently. Not all students though are the same or feel the same.\n\nwebwiz Sat 09-Mar-13 13:32:29\n\nQuite rare to be interviewed these days ILikeBirds - just for some courses eg medicine\n\ncreamteas Sat 09-Mar-13 13:36:55\n\n\nLike all unis, the reputation overall doesn't mean anything about the quality of teaching in different subject areas. It certainly does not have a good reputation in my subject area. It is also currently in the middle of an dispute over redundancies, with potential strike action, so is not necessarily a good place to either work or study at the minute.\n\nFellNel Sat 09-Mar-13 13:37:44\n\nI was just about to say exactly what lily said in the very first response!\n\nIt sounds to me, if they're asking AA*A predictions, as if they are trying to cream off excellent students before they're snapped up elsewhere?\n\nFWIW, in my subject Birmingham has a great reputation - it does vary a lot, I'm sure. I can imagine this might be a poor idea for students studying something Birmingham isn't great for, but might be good for, say, someone who is tossing up between Oxbridge with a tough offer, or early certainty here.\n\nFellNel Sat 09-Mar-13 13:43:37\n\nI know what creamteas means about Birmingham. My son got an offer from them for BBB, but all his other offers were for AAB. He choose a two non RG universities over Bham in the end, because they both had a better reputation by far, for his specific degree.\n\nMariscallRoad Sat 09-Mar-13 13:46:48\n\nI also agree that some students get they As easily and some others work strenuously to get Bs. And perhaps the grades of some students does not tell much about their academic ability/aptitude for a course and neither tells us the difficulties they encountered in school or learning or other... Perhaps The grading system is not meant to grade ability allways. Some universities know this and use a load of their own testing for selection.\n\nI have a DS in y12 and was under the impression that uni offers were based on AS results - have I got this wrong?\nWasn't there a fuss recently when Michael Gove was threatening to abolish AS levels altogether and return to A levels taken at the end of year 13? If I recall the universities were against the idea because they believed that AS results were a more accurate measure of ability than teacher prediction?\n\ncreamteas Sat 09-Mar-13 14:34:57\n\nsecret Uni offers are made looking at grades achieved so far, but have usually always been on the basis of A2 results. In other words your offer is conditional on you achieving certain grades in your A2s.\n\nIn this case, Birmingham's offers are unconditional, that is if they are accepted, they can attend regardless of their A2 results.\n\nThanks creamteas.\n\nMariscallRoad Sat 09-Mar-13 15:31:41\n\nBhm says 'Pupils taking up maths places must be predicted to score three elite A* grades'. Now, this is a hard condition to achieve.\nNot all elite universities teach every course perfect in all degrees. A lot of things might make a difference in the decisions of parents and students where to study -not just the status. for example B advertise v well themselves how well they support students: they offer a mentor all to all students not just those with specific needs. That makes a difference in the study.\n\ntitchy Sat 09-Mar-13 15:39:24\n\nThe proposal to not have AS as an interim qual for a levels is for current year 9 cohort so you should be ok secret!\n\nCreamteas - Hefce intend to redistribute the number control for 14/15 based on 13/14 intake numbers so maybe that's why Bham is takin this approach? Also interesting is the fee charged by one of the new unis Bedford maybe? Half price if you pay up front!\n\nThere are crappy departments in all universities.\n\nwebwiz Sat 09-Mar-13 15:46:14\n\nFor Maths any students with those sorts of predictions would be looking at the universities with the best reputations for Maths and Birmingham certainly is not considered as on a par with Oxbridge/Imperial/Warwick/Durham/Bath. The only way that Birmingham would have applications of that calibre is if they are a 4th or 5th choice university or if someone doesn't have further maths which will make it difficult to get into one the top universities listed.\n\nI think one university acting in a unilateral way like this distorts things a bit and means that students may make a decision that isn't the best for them in the long run.\n\nfussychica Sat 09-Mar-13 16:35:20\n\nWhen DS applied to B'ham 2 years ago- the last year of low fees - he was given an low offer well below the standard entry requirement without interview, although at the time they stated they always interviewed for his subject area. It didn't make him change his first choice and he rejected the place. They seemed miffed and unlike the other Uni's he rejected they followed it up, which was suprising.\n\nSimilarly, in this case it appears a number of the students who have received these offers are very wary of accepting because they a fairly sure they can meet their offers from what were/are their preferred Uni.\n\nI don't think B'ham are sending the right signals to the students or about their establishment but they obviously feel there is a need to do this to try to secure numbers. Looking at the subjects concerned and the student room comments I don't think other uni's have much to be concerned about.\n\nMariscallRoad Sat 09-Mar-13 22:10:06\n\nweb it is hard to get a place in the colleges you mentioned even with 3xA*s. A grades are not sufficient. Some universities require their own maths/physics test to be taken followed by test at interview. About half to 3/4 in certain cases might pass the test but fewer of those are likely pass the interview. There re people with with A*s who did not apply to a university bec of the cost. But is poss that there are those who would put the place as a top choice.\n\nwebwiz Sat 09-Mar-13 23:44:32\n\nBut if you are predicted 3A* you should be targeting the top universities for your subject. Maths has high entry requirements and can include extra exams like STEP but it isn't so hard to get into that a good mathematician will end up be rejected by lots of courses (unless of course you only apply to the absolute top unis).\n\nDD2 didn't actually consider Birmingham so I don't know anything about Maths there but if you were a top student it would be an insurance type choice rather than a firm.\n\nI'm sure there'll be a rush of applications to Birmingham next year with people hoping for the unconditional offers rather than receiving them unexpectedly like they have this year.\n\nI can imagine if you were someone who gets very nervous about exams, you might find Birmingham's offer attractive enough not to want to go to the slightly better places, though. People are different in terms of how they feel - every year some students will decide to go for a course they're technically over-qualified for, or will decide not to apply for places they might be able to get into, because they don't want to go. Maybe that's what Birmingham is hoping for?\n\nMariscallRoad Sun 10-Mar-13 10:27:32\n\nWeb I do not disagree with you that people with 'predicted' A*s should look at Oxbridge and the colleges you mention. Success rate though, at Ox for example, is about 18 pc. The rest should look for a safe alternative.\n\nIt appears Bhm’s hopes to attract are realistic: a % of A* predictions and offers in maths were not achieved in one uni mentioned; so these applicants need to have another place to go. Many candidates become aware that it is very hard to study in some of these unis. Their exams are v stressful and system is different from the rest . Some students feel this is not where they would want to study even if they have the grades. Still they can study well elsewhere and get a good degree. Finally, I agree some people can get nervous of exams. Stress affects performance in some.\n\nJoin the discussion\n\nJoin the discussion\n\n\nRegister now\n",
  "response": "### **Scene Concept: University Admissions Office During Clearing Week**  \n\n#### **1. Overall Scene Theme and Core Concept**  \nA bustling university admissions office during \"Clearing Week\"—the chaotic period when students scramble to secure university places based on their final exam results. The scene is dense with paperwork, stressed staff, and last-minute applicants, making it a perfect setting for multi-agent collaboration.  \n\n**Why Multi-Agent?**  \n- **Time Pressure:** Documents must be processed quickly before deadlines.  \n- **Physical Constraints:** Heavy boxes of applications, locked filing cabinets, and scattered supplies require teamwork.  \n- **Information Verification:** Cross-checking student records, verifying offers, and resolving discrepancies demand coordinated reasoning.  \n\n---\n\n#### **2. Spatial Layout and Area Descriptions**  \nThe office is divided into four interconnected zones:  \n\n1. **Reception & Waiting Area** – A cramped space with chairs, a coffee machine, and a front desk littered with pamphlets and sign-in sheets.  \n2. **Processing Hub** – The central workstation with scattered documents, printers, and a large whiteboard tracking applicant statuses.  \n3. **Archive Storage** – A backroom filled with labeled filing cabinets, sealed boxes of past applications, and a locked safe for confidential records.  \n4. **Advisor’s Booth** – A semi-private cubicle where staff conduct final interviews with nervous students.  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **Reception & Waiting Area**  \n\n**a. Anchor Furniture & Installations:**  \n- A **worn oak front desk** (2m long, scratched surface, sticky from spilled coffee).  \n- **Steel-framed waiting chairs** (six in total, one with a wobbly leg).  \n- A **wall-mounted digital clock** (slightly slow, displaying 10:47 AM).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Sign-in tablet** (low battery, requires a stylus kept in the front desk drawer).  \n- **Unlabeled USB drive** (left on the counter, contains last-minute applicant updates).  \n- **Coffee machine** (out of water, with an empty jug beneath it).  \n\n**c. Functional Ambient Objects:**  \n- **Brochure rack** (mostly empty except for outdated course catalogs).  \n- **\"Clearing Week\" whiteboard** (eraser missing, marker smudged).  \n- **Waste bin** (overflowing with crumpled applications).  \n\n**d. Background & Decorative Objects:**  \n- A **faded university banner** (peeling at the corners).  \n- **Abandoned student ID card** (found under a chair, name partially scratched off).  \n- **Dusty potted fern** (half-dead, sitting on a filing cabinet).  \n\n---\n\n#### **Processing Hub**  \n\n**a. Anchor Furniture & Installations:**  \n- **Large L-shaped desk** (cluttered with papers, sticky notes, and three monitors).  \n- **Overhead projector** (flickering, casting a dim glow on a wrinkled projection screen).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Priority applications stack** (marked \"URGENT: AAB+ Candidates\").  \n- **Malfunctioning label printer** (jammed, error light blinking).  \n- **Locked document scanner** (requires a keycard kept in the advisor’s booth).  \n\n**c. Functional Ambient Objects:**  \n- **Stapler** (out of staples).  \n- **Three-hole punch** (missing the alignment guide).  \n- **Rotary phone** (cord tangled, receiver slightly off-hook).  \n\n**d. Background & Decorative Objects:**  \n- **A \"Teamwork Wins!\" motivational poster** (one corner torn).  \n- **Half-empty water cooler** (drip tray full).  \n- **A forgotten lunchbox** (unopened, labeled \"Sarah – Admissions\").  \n\n---\n\n#### **Archive Storage**  \n\n**a. Anchor Furniture & Installations:**  \n- **Heavy-duty filing cabinets** (labeled A-Z, one drawer stuck).  \n- **Metal shelving unit** (holding sealed cardboard boxes marked \"2019-2022 Applications\").  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Confidential records safe** (digital keypad, last digit sticky).  \n- **Unprocessed application box** (left on the floor, lid askew).  \n- **Broken step stool** (one leg bent, unsafe for use).  \n\n**c. Functional Ambient Objects:**  \n- **Dusty archive labels** (partially peeled off).  \n- **Unplugged industrial fan** (blades clogged with paper scraps).  \n\n**d. Background & Decorative Objects:**  \n- **Spiderweb in the corner** (with a trapped moth).  \n- **Outdated exam regulation binders** (thick layers of dust).  \n\n---\n\n#### **Advisor’s Booth**  \n\n**a. Anchor Furniture & Installations:**  \n- **Small circular table** (scratched surface, wobbles).  \n- **Two upholstered chairs** (one with a loose spring).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Student’s conditional offer letter** (ink smudged, signature missing).  \n- **Advisor’s keycard** (left on the table, granting access to the scanner).  \n\n**c. Functional Ambient Objects:**  \n- **Desktop reference book** (\"University Admissions Policy 2023\").  \n- **Landline phone** (voicemail light blinking).  \n\n**d. Background & Decorative Objects:**  \n- **Framed diploma** (hanging crookedly).  \n- **A dried-out whiteboard marker** (abandoned on the windowsill).  \n\n---\n\n### **4. Scene Affordances and Embedded Potential**  \n\n#### **Collaborative Transportation Affordances:**  \n- **The \"2019-2022 Applications\" box** (weight: 25kg, dimensions: 60x40x40cm) requires two agents to lift safely.  \n- **The stuck filing cabinet drawer** needs one agent to pull while another jiggles the lock mechanism.  \n\n#### **Reasoning and Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:** Among five USB drives on the desk, only one has a **red cap, \"Admissions Backup\" label, and slight dent**—the correct one for updating records.  \n- **Compound Reasoning:** The **malfunctioning label printer** can be fixed by:  \n  1. Retrieving a **replacement ink cartridge** (stored in the archive room).  \n  2. Using the **advisor’s keycard** to access the locked supply cabinet.  \n\n---\n\n### **Final Notes**  \nThis scene is **ripe for emergent tasks**:  \n- **Coordinated document retrieval** (matching lost applications to students).  \n- **Time-sensitive troubleshooting** (fixing the printer before a deadline).  \n- **Secure data handling** (ensuring confidential records aren’t misplaced).  \n\nThe density of interactive objects, layered properties, and environmental storytelling ensure **deep, dynamic collaboration** is not just possible—it’s necessary."
}