{
  "id": 1071,
  "raw": "\nRetrieved from http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3070260/?tool=pubmed\nText:\nLogo of jbbJournal's HomeManuscript SubmissionAims and ScopeAuthor GuidelinesEditorial BoardHome\nJ Biomed Biotechnol. 2011; 2011: 792362.\nPublished online Feb 14, 2011. doi:  10.1155/2011/792362\nPMCID: PMC3070260\n\nGenetics, Cytogenetics, and Epigenetics of Colorectal Cancer\n\n\nMost of the colorectal cancer (CRC) cases are sporadic, only 25% of the patients have a family history of the disease, and major genes causing syndromes predisposing to CRC only account for 5-6% of the total cases. The following subtypes can be recognized: MIN (microsatellite instability), CIN (chromosomal instability), and CIMP (CpG island methylator phenotype). CIN occurs in 80–85% of CRC. Chromosomal instability proceeds through two major mechanisms, missegregation that results in aneuploidy through the gain or loss of whole chromosomes, and unbalanced structural rearrangements that lead to the loss and/or gain of chromosomal regions. The loss of heterozygosity that occur in the first phases of the CRC cancerogenesis (in particular for the genes on 18q) as well as the alteration of methylation pattern of multiple key genes can drive the development of colorectal cancer by facilitating the acquisition of multiple tumor-associated mutations and the instability phenotype.\n\n1. Introduction\n\nWorldwide, more than one million individuals develop colorectal cancer (CRC) each year, and the disease-specific mortality rate is nearly 33% in the developed world [1]. In Europe cancer of the gastrointestinal tract is the most common cancer: more than half of gastrointestinal cancer cases arise from the colon and around 250,000 new colon cases are diagnosed every year, accounting for around 9% of all the malignancies [2]. Colorectal cancer most commonly occurs sporadically, and only 25% of the patients have a family history of the disease, suggesting a contribution for shared genes and environment. However, only 5%-6% of CRC is due to inherited mutations in major CRC genes whilst the remaining of the familial forms likely result from gene-environment interactions [3]. Rates of this cancer increase with industrialization and urbanisation, further indicating that environmental factors can likely represent risk factors. Diet is definitely the most important exogenous factor identified so far in the etiology of colorectal cancer.\n\nCRC progresses through a series of clinical and histopathological stages ranging from single crypt lesions through small benign tumors (adenomatous polyps) to malignant cancers (carcinomas). Stages are usually defined by the tumor-node-metastasis (TNM) classification, as defined by the American Joint Committee on Cancer (AJCC). TNM is the most commonly used staging system and is based on depth of invasion of the bowel wall, extent of regional lymph node involvement, and presence of distant sites of disease. The depth of tumor invasion defines the T stage and increases from T1 (invasion of the submucosa) to T4 (invasion into the serosa or adjacent structures) [4]. Another grading system is Dukes classification that considers the arrangement of the cells rather than the percentage of the differentiated cells. The initial Dukes approach has evolved into the three-grade system. Grade 1 is the most differentiated, with well-formed tubules and the least nuclear polymorphism and mitoses. Grade 3 is the least differentiated, with only occasional glandular structures, pleomorphic cells and a high incidence of mitoses. Grade 2 is intermediate between Grades 1 and 3 [2].\n\nThe development of colorectal cancer is a multistep process that involves an accumulation of mutations in tumor suppressor genes and oncogenes. It has provided a useful model for the understanding of the multistep process of carcinogenesis. The model of colorectal tumorigenesis includes several genetic changes that are required for cancer initiation and progression [5]. The earliest trigger genetic event is the inactivation of the APC (adenomatous polyposis coli) pathway. Mutations in other tumor suppressor genes (APC, SMAD2, 4, TP53) and oncogenes (KRAS) and likely several other genes/pathways accompany transitions in pathology of the lesions and drive tumor towards malignancy and metastasis [6]. Alongside with gene mutations a deregulated expression of oncogenes and/or tumor suppressor genes can also occur following epigenetic modifications of their promoters.\n\n2. Genetics of Colorectal Cancer\n\nColorectal cancer represents the third most diagnosed cancer in both men and women. About 75% of the patients have sporadic forms of the disease. The remaining 25% of the patients have a family history of the disease, suggesting a contribution for shared genes and environment. However, only 5%-6% of CRC is due to highly penetrant inherited mutations in major genes, whilst the remaining of the familial forms likely result from interactions between less penetrant genes and environmental factors [3].\n\nSeveral studies suggest that first degree relatives of an affected individual diagnosed after age 50 years have a twofold to threefold increased risk of colorectal cancer. Moreover, the number of affected family members and age at cancer diagnosis correlate with disease risk, suggesting that either having more than one first relative with colorectal cancer or a first relative individual diagnosed at an age below 45 years are conditions associated with a threefold to sixfold increased relative risk. When the family history includes two or more relatives with colorectal cancer, the possibility of a genetic syndrome is increased substantially [3, 7].\n\nOther CRC risk factors include the presence of large serrated polyps (serrated adenomas and hyperplastic polyps), a diet rich in total fat and meat, cigarette smoking, male gender, the use of nonsteroidal anti-inflammatory drugs, alcohol intake, a sedentary lifestyle, body mass index (BMI) and abdominal obesity [812]. High intakes of folate, vitamins and dietary fiber, colonoscopy with removal of adenomatous polyps, and postmenopausal hormone use have been associated with decreased CRC risk [1316].\n\n2.1. Major CRC Genes and Syndromes\n\nSome inherited conditions predispose an individual to the development of colorectal cancer. The study of these CRC syndromes has led to the identification of several major CRC genes (Table 1). Among major CRC genetic syndromes there are familial adenomatous polyposis (FAP), attenuated FAP (AFAP), MUTYH-associated polyposis (MAP), and Lynch syndrome (hereditary nonpolyposis colorectal cancer HNPCC). Rare syndromes include hamartomatous polyposis conditions (Peutz-Jeghers syndrome (PJS), juvenile polyposis syndrome (JPS), and others) and hyperplastic polyposis (Table 1).\n\nTable 1\nMajor CRC genes and syndromes.\n\n2.1.1. Familial Adenomatous Polyposis (FAP), Attenuated FAP (AFAP), and Gardner Syndrome\n\nFAP is an autosomal dominant condition characterized by the development of multiple (hundreds to thousands) adenomas in the rectum and colon after the first decade of life, that inevitably result in CRC development in untreated subjects. Males and females are equally likely to be affected. FAP accounts for less than 1% of CRC cases, with an estimated prevalence of 1/11,300–37,600 in the European Union [17]. FAP may present with some extraintestinal manifestations such as osteomas, dental abnormalities, congenital hypertrophy of the retinal pigment epithelium, and extracolonic tumours (desmoid tumors, stomach tumors, duodenum/small bowel tumors, thyroid cancers, pancreas tumors, hepatoblastoma, and central nervous system tumors) [3, 17]. Attenuated FAP (AFAP) is a less aggressive variant of FAP, characterized by fewer colorectal adenomatous polyps (usually 10 to 100), an average 69% lifetime risk of CRC, and later age of adenoma appearance. Some extracolonic tumors also occur in AFAP, including duodenum/periampullary and thyroid cancers [3, 17]. Gardner syndrome is a variant of FAP and results in the manifestation of numerous external and internal symptoms including gastrointestinal polyps, osteomas, dental anomalies, desmoid tumors, and epidermoid cysts [18]. FAP, attenuated FAP, and Gardner syndrome all result from germline mutations in the tumor suppressor Adenomatous Polyposis Coli (APC) gene on chromosome 5q21, which encodes a protein acting as an essential negative regulator in the evolutionarily conserved Wnt/Wingless (Wg) signal transduction pathway [19]. Disease severity and the presence of extracolonic manifestations seem to be correlated with the location of the mutation within APC. Severe polyposis (>1000 adenomas) is found in patients with mutations between codons 1250 and 1464. AFAP is correlated with mutations before codon 157, after codon 1595, and in the alternatively spliced region of exon 9. Mutations in the remainder of the APC gene cause an intermediate phenotype (hundreds to thousands of adenomas). Congenital hypertrophies of the retinal pigment epithelium and desmoid tumors are associated with mutations between codons 311 and 1444 and after codon 1444, respectively [20].\n\n2.1.2. MUTYH-Associated Polyposis (MAP)\n\nMUTYH-associated polyposis (MAP) is an autosomal recessive disorder characterised by adenomatous polyps of the colorectum and a very high risk of colorectal cancer. It shares important gastroenterological features with autosomal dominant FAP. The colonic phenotype of MAP mimics AFAP, and the burden of adenomas ranges from very few to hundreds. Key extracolonic manifestations include a predisposition to duodenal adenomas and cancer and a modest increase in risk for several extraintestinal tumors [3, 21]. The disease is caused by biallelic MUTYH mutations [22]. The Mut Y homolog (MUTYH) gene, located on chromosome 1p, encodes a protein of the DNA base excision repair pathway whose impaired function leads to increased G:C to T:A transversions. The two common MUTYH variants observed in MAP patients are Tyr165Cys and Gly382Asp [22].\n\n2.1.3. Lynch Syndrome (Hereditary Nonpolyposis Colorectal Cancer or HNPCC)\n\nLynch syndrome (LS), also known as hereditary non-polyposis colorectal cancer or HNPCC, is an autosomal dominant condition caused by mutations in one of several DNA mismatch repair (MMR) genes and represents the most common hereditary CRC predisposing syndrome, accounting for approximately 3% of the total CRCs. Unlike FAP, polyposis is rare. Carriers of a Lynch syndrome gene mutation have an estimated 80% lifetime risk of developing CRC [23]. Colon cancers are most likely to develop in the right side, they frequently show mucinous or signet ring cell morphology, are characterized by lymphoid aggregates at the periphery of the tumor and/or lymphocytes infiltrating the tumor, and have an elevated frequency of microsatellite instability [23]. In addition to CRC, patients with Lynch syndrome and their relatives are at increased risk for several types of cancers, including endometrial adenocarcinoma and gastric, ovarian, biliary, urinary tract, small bowel, brain, and pancreatic cancers [3]. Muir-Torre syndrome (MTS) is considered a variant of Lynch syndrome; it is a rare disorder characterized by the presence of at least one sebaceous gland neoplasm and at least one visceral malignancy. Sebaceous adenomas, sebaceous carcinomas, and sebaceous epitheliomas are all characteristic glandular tumors of MTS. The most common visceral malignancies associated with MTS are colorectal, followed by genitourinary. These visceral malignancies frequently have a more indolent course in patients with MTS than they would otherwise. Muir-Torre syndrome is an autosomal dominant disorder, often associated with germline mutations in the MSH2, and the MLH1 genes [24]. The genes responsible for Lynch syndrome include MSH2 (mutS homolog 2) on chromosome 2p16, MLH1 (mutL homolog 1) on chromosome 3p21, MSH6 (mutS homolog 6) on chromosome 2p16, and PMS2 (postmeiotic segregation 2) on chromosome 7p22. These genes encode for MMR proteins that correct base mismatches or small insertions or deletions occurring during DNA replication. Their mutations in Lynch syndrome individuals account for the microsatellite instability observed in tumor cells. MSH2 and MLH1 mutations account for most of the cases of Lynch syndrome, and several recurrent or founder mutations have been identified in these two genes. For example the founder mutation in Ashkenazi Jews (MSH2 1906G>C), a genomic deletion of exon 16 of MLH1 that probably dates back 1000 years or more and accounts for >50% of all Lynch syndrome in Finland, a genomic deletion of exons 1–6 of MSH2 in German American populations, and the recurrent A → T transversion in the donor splice site of intron 5 of MSH2 (designation c.942 + 3A → T), that occurs worldwide and may account for as much as 5%–10% of all Lynch syndrome (for a review see [23]). MTS is often associated with germline MSH2 or MLH1 mutations, though sporadic cases are known [24]. In addition to MSH2, MLH1, MSH6, and PMS2 mutations, little evidence suggests that some cases of Lynch syndrome might be due to germline MLH3 variants [25, 26]. Recently, germline deletions in the TACSTD1 gene (also known as epithelial cell adhesion molecule gene: EpCAM) have been identified in families with Lynch syndrome resulting in multiple TACSTD1/MSH2 fusion transcripts and epigenetic inactivation of the corresponding MSH2 allele [27, 28].\n\n2.1.4. Hamartomatous Polyposis Conditions: Peutz-Jeghers Syndrome, Juvenile Polyposis Syndrome, Mixed Polyposis Syndrome, and Others\n\nPeutz-Jeghers syndrome (PJS) is an inherited, autosomal dominant disorder distinguished by hamartomatous polyps in the gastrointestinal tract and pigmented mucocutaneous lesions, typically presenting in childhood on the lips, buccal mucosa, and perioral region. Prevalence of PJS is estimated from 1 in 8300 to 1 in 280,000 individuals. PJS predisposes sufferers to various malignancies (gastrointestinal, pancreatic, lung, breast, uterine, ovarian and testicular tumors) [29, 30]. The majority of patients that meet the clinical diagnostic criteria have a causative mutation in the tumor suppressor STK11 gene, located at 19p13.3, encoding a serine threonine kinase (STK) protein [31].\n\nJuvenile polyposis syndrome (JPS) is a rare, early-onset disease, characterized by the presence of hamartomatous polyps throughout the gastrointestinal tract [32]. The lifetime CRC risk in JPS individuals is estimated to be 39% [33]. It is estimated that 15%–20% of JPS patients carry autosomal dominant mutations in the SMAD4/DPC4 (deleted in pancreatic cancer locus 4) gene, on chromosome 18q21.1, that encodes a critical cytoplasmic mediator in the transforming growth factor-beta signaling pathway [34], whereas 25%–40% of the patients carry autosomal dominant mutations in the gene encoding bone morphogenetic protein receptor 1A (BMPR1A), on chromosome 10q22-23 [35]. The rest of JPS cases appear to be sporadic.\n\nHereditary mixed polyposis syndrome (HMPS) is characterized by polyps of mixed adenomatous/hyperplastic/atypical juvenile histology that are autosomal dominantly inherited and that eventually lead to colorectal cancer. There is consistent phenotypic overlap between JPS and HMPS. A recent study showed that germline BMPR1A defect is the CRC causing mutation in 50% of Singapore Chinese HMPS families [36]. Linkage between HMPS and chromosome 15q has also been reported [37].\n\nCowden syndrome (CS) is another rare autosomal dominant hamartomatous polyposis condition. 27%–43% of CS patients have been shown to have hamartomatous polyps in the gastrointestinal tract; however, CS seems to confer little, if any, CRC risk [32]. The disease is caused in most of the cases by mutations of the tumor suppressor phosphatase and tensin homolog (PTEN) gene [38].\n\n2.1.5. Hyperplastic Polyposis Syndrome (HPPS)\n\nHPPS is a rare condition characterized by the presence of multiple and/or large hyperplastic polyps throughout the colon that predisposes 50% or more of the patients to CRC development [39]. The World Health Organization (WHO) established that the diagnosis of HPPS must accomplish one of the following criteria: (1) at least five hyperplastic polyps occurring proximal to the sigmoid colon (of which at least two should be larger than 10 mm in diameter); (2) More than 30 hyperplastic polyps distributed throughout the colon; (3) at least one hyperplastic polyp proximal to the sigmoid colon in an individual who has at least one first-degree relative with HPPS [40]. Little is still known about the etiology and the genetics of this condition.\n\n2.1.6. Familial Colorectal Cancer (FCC)\n\nAs detailed in the introduction of this section, a family history of colorectal cancer (i.e., one or more relatives with CRC) confers a twofold to sixfold increased CRC risk, depending on the number of affected family members and the age at diagnosis of the affected relatives. Even if it is estimated that familial clusters of CRC account for almost 20% of CRCs in developed countries, the rare CRC syndromes described above contribute only to a fraction of them, suggesting the existence of other less penetrant genes and/or gene-environment interactions at the basis of familial CRC aggregates The term familial colorectal cancer (FCC) is used to categorize CRC families that do not meet the clinical criteria for a diagnosis of known hereditary CRC syndromes. Several approaches have been performed to identify less penetrant loci that might contribute to familial CRC, including family linkage, affected relative pair studies, and genome-wide association studies. Some of these studies have identified potential loci on chromosomes 8, 9, 11, and 18 (see the review by Jasperson et al. [3], and the next section).\n\n2.2. Genetic Polymorphisms and Colorectal Cancer Risk\n\nPolymorphisms underlying genetic susceptibility to CRC have been investigated either by means of the classical candidate gene approach (based on the known function of the gene and its relevance in pathways likely involved in CRC pathogenesis) or, more recently, by means of genome-wide association studies (GWAS) where half a million or more single nucleotide polymorphisms (SNPs) are tested simultaneously in a large case-control cohort. A continuously updated overview of the genetic polymorphisms associated with CRC risk can be found at the NCI website (http://www.cancer.gov/cancertopics/genetics/colorectal/healthprofessional). Table 2 lists some examples of genes and loci associated with CRC risk.\n\nTable 2\nSome of the genes or loci associated with CRC risk (see the text for details).\n\n2.2.1. Candidate Gene Approaches and Meta-Analyses\n\nSporadic CRC is considered to be a multifactorial disease, in which multiple exposures to endogenous factors interact with individual genetic background in a complex manner, resulting in modulation of the risk. Several genes have been investigated as candidate CRC risk factors, often with conflicting or inconclusive results, and meta-analyses or updated reviews of the literature are currently available. Glutathione S-transferases (GSTs) are particularly attractive candidates for CRC susceptibility because they code enzymes involved in the metabolism of environmental carcinogens; recent meta-analyses of the literature suggest that both GSTM1 and GSTT1 null genotypes are associated with an increased risk of CRC, especially in the Caucasian populations [4143]. Conflicting results have been obtained concerning DNA repair gene polymorphisms and CRC risk [4446]. Cyclooxygenase-2 (COX2), a key enzyme in arachidonic acid metabolism, is overexpressed in several epithelial malignancies including colorectal cancer, and recent meta-analyses revealed that promoter polymorphisms of the COX2 gene may be potential risk factors for cancers of the digestive tract in Asians, including colorectal cancer [4749]. Polymorphisms of genes involved in folate metabolism, such as methionine synthase (MTR) and methylenetetrahydrofolate reductase (MTHFR), might also increase CRC risk [50, 51]. Interaction between smoking status and N-acetyltransferases (NAT1 and NAT2) polymorphisms seem to affect CRC risk [52]. TGF-beta1, its receptor TGFbetaRII, and the signaling proteins Smad4 and Smad7 have been observed in the majority of colorectal cancer tissues [53]. Conflicting results have been obtained concerning TGFbeta receptor I (TGFBR1) polymorphisms and CRC risk [54], whilst increased risk of colon cancer was associated with variants of SMAD7 in several studies [5558]. The I1307K polymorphism in the APC gene occurs almost exclusively in Ashkenazi Jews and increases the risk of colorectal cancer [59]. Some polymorphisms also affect the phenotype of Lynch syndrome (HNPCC). For example, age at onset of CRC in HNPCC is modified by a promoter polymorphism of the insulin-like growth factor gene (IGF1) [60, 61].\n\n2.2.2. Genome-Wide Association Studies (GWAS)\n\nLarge genome-wide association studies (GWAS) identified several loci as possible common low-risk susceptibility alleles, including 8q23.3, 8q24, 10p14, 11q23, 15q13, and 18q21 [62, 63]. A meta-analysis of those GWAS revealed four additional susceptibility loci on 14q22.2, 16q22.1, 19q13.1, and 20p12.3, in addition to the six loci previously identified [64]. A recent GWAS in German familial CRC cases confirmed the two previously reported loci at 8q24 and 11q23, and suggested novel polymorphisms (rs12701937, rs6038071, and rs11014993) associated with CRC in familial cases [65].\n\n2.3. Genes Involved in CRC Progression: TP53 and K-RAS\n\nMutations in TP53 and K-RAS do not cause CRC syndromes, however; they are the genetic abnormalities most exhaustively implicated and studied in CRC progression. TP53 encodes a transcription factor (p53) defined as the “guardian of the genome” since it is involved in the coordination of cellular responses to oxidative stress, DNA damage, cell cycle regulation, apoptosis, and many other pathways. Loss of TP53 function through gene mutation is a critical event in the development and progression of many tumour types including CRC. The majority of TP53 mutations occur in the core domain which contains the sequence-specific DNA binding activity of the protein, and they results in loss of DNA binding. Inactive TP53 mutations were found in 29% of all CRCs and were more frequent in rectal than proximal colon tumours. TP53 mutations were associated with lymphatic invasion in proximal tumors, and with worse survival in distal tumors. Higher frequencies of inactive TP53 mutations were also seen in advanced-stage tumours and in tumours with the poor prognostic features of vascular and lymphatic invasion. Inactive TP53 mutations have been associated with significantly worse outcome only in patients with Dukes stage D tumours [66, 67].\n\nThe RAS signalling pathway is involved in growth differentiation, cell survival, cell proliferation, apoptosis, cytoskeleton organization and function, inflammation, and cell transformation. A glycine to valine mutation on codon 12 of K-RAS, found in 8.6% of all patients, had a statistically significant impact on failure-free survival and overall survival. This mutation also appeared to have a greater impact on outcome in Dukes' C cancers than in Dukes' B tumours. The study demonstrated that not only is the presence of a codon 12 glycine to valine mutation important for cancer progression, but also that it may predispose to more aggressive biological behaviour in patients with advanced colorectal cancer [68].\n\n3. Cytogenetics of Colorectal Cancer: The CIN Phenotype\n\nFor colorectal cancers, the acquisition of genomic instability is considered a key hallmark. Three major molecular subtypes can be recognized: MIN (or MSI, for “microsatellite instability”), CIN (for “chromosomal instability”) and CIMP (for “CpG island methylator phenotype”) [79, 80]. MIN CRC accounts for approximately 15%–20% of sporadic colorectal cancers. It is a well-defined subtype that results from a loss of DNA mismatch repair function, secondary to inactivation of MMR genes (see Lynch syndrome, Section 2.1.3). MIN tumors were at the beginning believed to be near-diploid with few, if any, karyotypic abnormalities [77]. However in MSI tumors, the pathway of chromosome gains is frequently observed whereas that of chromosomal losses is rarely found [75]. On the other hand the definitions of the three pathways (MIN, CIN, and CIMP) are not completely defined and thus not mutually exclusive, it is believed that a tumor can occasionally show features of multiple pathways, although the extent and nature of this overlap remains to be determined [77, 81].\n\nCIN is the most common type of genomic instability observed in colon cancer and occurs in 80%–85% of colorectal tumors [82]. It occurs mainly in non-MIN cancers (or MSS for “microsatellite stable”) which are proficient for mismatch repair.\n\nCIN CRC show several forms of genomic instability, characterized mainly by chromosomal rearrangements and numerical abnormalities at a greatly increased rate compared with normal cells [83].\n\nOriginally, the CIN phenotype was used to describe tumors with a high degree of intercellular heterogeneity in chromosome number, ascertained by counts for a restricted set of chromosome-specific centromeres [79]. CIN was further employed to describe cancers with either aneuploid or polyploid DNA content as measured by cytometry or cytogenetics, or multiple gains or deletions of chromosomes or chromosome arms, or frequent losses of heterozygosity (LOH) [79]. The first cytogenetic observations on cancer cells from colorectal adenocarcinomas were described by Dutrillaux [69]. With classical cytogenetic approach he observed two distinct patterns of chromosomal anomalies. The first one, called “monosomic type”, was characterized by many chromosomes losses, including the losses or deletions of chromosomes 18, 17 (short arm = p), 1p, 4, 14, 5 (long arm = q) and 21. He noticed that this condition frequently evolves towards polyploidy, by duplication of all remaining chromosomes. The second pattern, called “trisomic type”, was characterised by the gain of several chromosomes: 7, 12, X, 5 and 8. The chromosomal anomalies observed seemed at that time to have no topological relationships with oncogenes [69]. Indeed subsequently it became clearer that the cancer-specific aneuploidies generate complex, malignant phenotypes, through the abnormal dosages of the thousands of genes [84].\n\nIn general, genomic copy number changes are frequently found in different types of cancer and are believed to contribute to their development and progression through inactivation of tumour suppressor genes, activation of oncogenes, or more subtlly through gene dosage changes [76]. Chromosomal instability is an efficient mechanism for causing the physical loss of a wild-type copy of a tumor-suppressor gene, such as in CRC: APC, TP53, and SMAD family member 4 (SMAD4), whose normal activities oppose the malignant phenotype [85]. The first cytogenetic studies on primary CRC tumors suffered by limitations due to the poor quality of the preparations. The improvement of molecular cytogenetic studies, performed subsequently with the application of fluorescence in situ hybridization (FISH) based techniques such as comparative genomic hybridization (CGH) and spectral karyotyping (SKY), allowed many groups to show that colorectal carcinomas are characterized by multiple patterns of chromosomal imbalances which sequentially accumulate during adenoma to carcinoma progression [73].\n\nAmong the first findings, Fearon et al. [70] confirmed a frequent genomic loss in CRC at chromosome 18q21. By using comparative genomic hybridization (CGH) Korn et al. [71] found that most frequent gains are at 20q13 and with the same technique De Angelis et al. [72] determined that gains of 20q and losses of 18q were the most frequent aberrations.\n\nAccumulation of losses in 8p21-pter, 15q11-q21, 17p12-13, and 18q12-21, and gains in 8q23-qter, 13q14-31, and 20q13 were found strongly associated with adenoma-to-carcinoma progression, independent of the degree of dysplasia [73].\n\nDiep et al. [74] by applying different statistical analyses and combining these on a large series of genome profiles from reported CRC, were able to identify specific chromosomal alterations linked to the different stages of tumor progression. They found that losses at 17p and 18 and gains of 8q, 13q, and 20 occur early in the establishment of primary CRC whereas loss of 4p is associated with the transition from Dukes' A to B–D stages. They observed that deletion of genes located at chromosome 4 might therefore contribute to increased aggressiveness of the tumor, enabling it to penetrate the muscular layer, and contribute to the establishment of advanced stages; moreover loss of chromosome 4 has been shown to be associated with poor clinical outcome in a large series of CRC [74]. The transition from primary tumor to liver metastasis results correlated with the deletion of 8p and gains of 7p and 17q, whereas losses of 14q and gains of 1q, 11, 12p, and 19 are late events.\n\nIn a pilot study by Fensterer and coworkers [76] using macrodissected paraffin-embedded tissue samples, matrix-CGH was performed. The majority of advanced tumours displayed 13q-gain and 18q-loss. In locally restricted tumours, only half tumours showed a gain on 13q and 7/12 tumours showed a loss on 18q. Interphase-FISH and high-resolution arraymapping of the gain on 13q confirmed the validity of the arraydata and narrowed the chromosomal interval containing potential oncogenes. The amplification on 13q appeared to harbour candidate genes that might confer a more aggressive phenotype to colorectal cancer cells [76].\n\nFinally, to summarize the numerous investigations performed in the last decade in primary colon cancer tumors, including the recent study by Knutsen and co-workers, comparing the CGH patterns in all of these reports, gains were most frequent for 3/3q, 5/5p/5q, 7, 8q, 20/20q, 13, and the X, and losses were most frequent for 8p and 18/18q [78]. Searching for the most frequent structural and numerical aberrations found in the large intestine adenocarcinoma specimens in the Mitelman Database of Chromosome Aberrations in Cancer (http://cgap.nci.nih.gov/Chromosomes/Mitelman), among unbalanced Chromosomal Abnormalities there are 8q10 i(8)(q10) and 17q10 i(17)(q10); among numerical trisomies +7, +13, +20, and +X; among monosomies −4, −5, −8, −10, −14, −15, −17, −18, −21, −22, and −Y. The most recurrent aberration found in all cytogenetic studies performed, either in primary tumors or in colon cancer cell lines or in fixed colorectal cancer tissue blocks is thus 18q (Table 3). LOH of this region indicates an unfavorable outcome in patients with stage II CRC [86]. In the 18q21-18q21.1 region several tumor suppressor genes have been mapped, including SMAD4/DPC4. However, since microsatellite instability was inversely correlated with loss of heterozygosity for chromosomes 5q, 17p, and 18q, it has been hypothesized that some colorectal cancers (MSI in particular) may arise through a mechanism that does not necessarily involve loss of heterozygosity [87].\n\nTable 3\nThe most frequent aberrations found in CRC (see the text for details).\n\n3.1. Mechanisms Responsible of Chromosome Instability in CRC\n\nIn these last years, there has been intense interest in identifying the mechanisms responsible for the CIN. In most carcinomas, including CRC, chromosomal instability proceeds through two major mechanisms, missegregation that results in aneuploidy through the gain or loss of whole-chromosomes, and unbalanced structural rearrangements (unbalanced translocations, deletions, isochromosomes,…) that lead to the loss and/or gain of chromosomal regions [77]. Lengauer and co-workers [79] showed first that CRC tumors without MIN exhibit a striking defect in chromosome segregation, resulting in gain, or losses in excess of 10−2 per chromosome per generation. They performed cell fusion experiments between CIN and non-CIN cells (transfected HT-29 cells) and showed that the CIN phenotype acts dominantly at the cellular level, suggesting that it can arise from gain-of-function mutations; aneuploidy was considered indeed the result of an abnormally high rate of CIN [79].\n\nMuleris et al. [77] performed a study to address the question if CIN occurs mainly as the consequence of either missegregation of normal chromosomes (MSG) or structural rearrangement (SR) by karyotyping a consecutive series of 96 near-diploid colorectal cancers. MSGs and SRs were found not randomly associated within tumors, delineating two major pathways of chromosome alterations that consisted of either chromosome gains by MSG or chromosomal losses by both MSG and SR [77].\n\nRecently Knutsen et al. [78] reviewed the karyotypes of 345 cases of adenocarcinoma of the large intestine listed in the Mitelman Database of Chromosome Aberrations in Cancer and compared them with the types of abnormalities observed in 15 established colorectal cancer cell lines, reflecting those seen in primary tumors, using spectral karyotyping (SKY), fluorescence in situ hybridization, and comparative genomic hybridization (CGH). They found that there were no recurrent translocations in either tumors or cell lines; isochromosomes were the most common recurrent abnormalities; and breakpoints occurred most frequently at the centromeric/pericentromeric and telomere regions. They concluded that copy number alterations appear to be the major mechanism for transcriptional deregulation of cancer genes in CRC [78].\n\nOther research groups performed studies addressed to identify proteins that regulate the fidelity of chromosomes (regulation of DNA fidelity during DNA replication and in response to genotoxic stress) either by means of model organisms, such as yeasts, Drosophila and mice. Chromosomal instability is considered the result of somatic mutations in genes that regulate the mitotic spindle checkpoint, DNA replication checkpoints, DNA damage checkpoints, chromosome metabolism, and centrosome function [81, 82]. In particular, studies were concentrated on three functional pathways: defects in proteins that are involved in double-strand break repair, kinetochore function, and chromatid segregation [88]. Within this context, Pino and Chung [81] observed that although over 100 genes can cause chromosomal instability in the yeast Saccharomyces cerevisiae, only a few of them have been observed in human tumors. Genes such as hMAD, hBUB1, hBUBR1, hZw10, hZwilch, hRod, CENP-A, CENP-H, and APC are involved in the mitotic checkpoint that allows a proper chromosome separation. Mutations of these genes have been found in human cancers, for example mutated hMAD1 and hMAD2 have been found in leukaemia and breast cancer, mutations of hZw10, hZwilch, and hRod have been found in CRC, and mutations of hBUB1 and hBUBR1 resulted in no checkpoint arrest in cancer cell lines [81]. The role of APC in CRC pathogenesis has been largely described in Section 2.1.1. The APC gene product is involved in the Wingless/Wnt signal pathway and has a role even in chromosome segregation. Other categories of genes that might contribute to the CIN phenotype in CRC tissues are those involved in centrosome function and duplication, such as those encoding the protein kinase Aurora A (AURKA) and the serine/threonine kinase Plk1 (PLK1), and those involved in the DNA damage response machinery, particularly TP53 [81]. Diep and co-workers (see previous paragraph) supplemented their findings aimed at the identification of chromosomal aberrations that differentiate among the Dukes' stages of colorectal cancer as well as those that are responsible for the progression into liver metastases, with a list of potential target genes for the specific alterations from a publicly available microarray expression dataset of CRC [74]. For instance a gene that shows reduced expression in colorectal carcinomas is CENT1, located at 18p11.32. The relative protein, a member of the calcium-binding EF-hand protein super-family, has an important role in the determination of centrosome position and segregation, and in the process of microtubule severing. One of the early changes is gain of 20q; the expression data revealed a potential candidate gene for this chromosomal alteration MYBL2, located at 20q13.12 and directly regulated by the CDKN2A/CCND/RB/E2F pathway along with many critical S-phase genes; increased expression of this gene has been observed in several tumors [74]. The expression dataset revealed moreover that IGFBP1 as a gene that may be one of the targets for gain of 7p. IGFBP1, an insulin like growth factor-binding protein, has been observed to have an effect on cell growth, and increased expression of this gene has been seen in different cancer types [74].\n\nBarber et al. [89], through bioinformatic approaches compared 102 human genes highly related to 96 yeast CIN genes and showed that downregulation or genetic disruption of genes directly involved in sister chromatid cohesion (such as MRE11A and CDC4) play a major role in the CIN phenotype in human colorectal tumors [89].\n\nThe comparison of array-CGH and gene expression microarray data for primary CRCs and CRC cell lines showed that MSI-associated gene expression changes broadly reflect systematic DNA copy-number differences between MSI tumors, which tend to be near-diploid, and MSS tumors, which tend to be aneuploid [90]. These data demonstrate that DNA copy number changes in cancer cells have profound effects on gene expression, and therefore, this mechanism contributes to the clinical differences between MSI and MSS tumors.\n\nEither TP53 or K-RAS mutations are involved in CRC progression and, given their respective functions (see Section 2.3), both genes could contribute to CIN [81]. According to Pino and Chung [81] other factors that could drive CIN in CRC are telomere dysfunction and loss of heterozygosity (LOH) for the genes on 18q.\n\n3.2. Cytogenetic Aberrations in CRC as Biomarkers\n\nIn general cytogenetic aberrations found in cancers are considered biomarkers for disease since they can provide diagnostic, prognostic, and treatment-related information for the associated cancers. However in CRC molecular biomarkers instead of cytogenetic ones are more studied and standardized, compared to other cancers. For example, germ-line mutations in tumor-suppressor genes, such as APC, MLH1, and MSH2, indicate a very high risk of colorectal cancer and guide the frequency of CRC surveillance and recommendations for prophylactic surgery [85] (see also the previous Section 2.1).\n\nA few genomic markers are useful for prognosis. Microsatellite instability and loss of heterozygosity at chromosome 18q are the two best-defined molecular prognostic markers [91].\n\nStudies have been performed to understand functional relevance of chromosomal aberrations for colorectal cancer progression but these somatic markers have modest or unconfirmed prognostic value and are not currently used to direct care. Patients with MSI sporadic colorectal cancers generally have a favorable prognosis [91]; poor survival in stage II and III colon cancers is associated with the loss of p27 (a proapoptotic regulator of the cell cycle) or the loss of heterozygosity at chromosomal location 18q [78, Makowitz et al., 2009]. However in a large prospective study of patients with non-MSI-high colorectal cancer, 18q LOH or allelic imbalance was not associated with patient survival [92].\n\nMutations in K-RAS, observed in approximately 40% of colon tumours, have significant implications for predicting likelihood of response to the antibody-based EGFR inhibitors (cetuximab and panitumumab) therapy, with K-RAS mutant patients now clearly shown to be inherently resistant to these agents [1].\n\n4. Epigenetics and Colorectal Cancer\n\nEpigenetics is defined as heritable changes in gene expression that are not accompanied by changes in DNA sequence. An epigenetic modification is DNA methylation, a covalent addition of a methyl group (CH3) to the nucleotide cytosine. In mammals, most of the DNA CpG sites are methylated (90%–98%), but there are specific CpG-rich areas of DNA where most CpGs are not methylated (CpG islands); a few genes are imprinted genes, regulated by methylation of the CpG islands in their promoter, and the markings are stably replicated during cell division but are reversed when inherited through an individual of the opposite sex. Promoter hypomethylation has been associated with an increased gene transcription. DNA hypermethylation occurs at specific regulatory sites in the promoter regions or repetitive sequences. A heavy density of cytosine methylation in the CpG islands of the tumor suppressor gene promoters can lead to a complete block of transcription, and many types of cancer use this mechanism to inactivate tumor suppressor genes. Epigenetic events are a characteristic of human cancer, including CRC. Other epigenetic modifications include histone acetylation and gene silencing mediated by small noncoding RNA (microRNA or miRNA). Table 4 shows epigenetic alterations observed in CRC.\n\nTable 4\nEpigenetic alterations in colorectal cancer.\n\n4.1. DNA Methylation in CRC\n\nMethylation of CDKN2A, a tumour suppressor gene, is detected in 40% of colorectal cancers and has been found also in colorectal adenoma. Methylation of P16 was found in colorectal cancer (Dukes stage C) suggesting that P16 inactivation was important for tumorigenesis [93]. Also, Wettergren and co-workers found an increase of P16 methylation in older than younger patients; moreover the frequency of P16 hypermethylation was highest in right-sided colon followed by rectum and left-sided colon. Furthermore patients without methylation of P16 in mucosa, survived more than patients with hypermethylation [94]. Keyes and coworkers [95] found that aging causes DNA bypomethylation, but increases p16 promoter methylation in mouse colons and the effect is dependant on dietary folate.\n\nA different CDH13 methylation between poorly differentiated colorectal cancer and differentiated cancer was found. A significant increase of HACE1 gene methylation in colorectal cancer was observed in the maximal tumour size. A significant alteration of UNC5C methylation in colorectal cancer, principally in Dukes stage C than in earlier stages was also observed [93]. Wasson and coworkers [96] demonstrated that in folate depleted colon cells, there was an increment of global DNA hypomethylation; particularly there was a major hypomethylation in the region of TP53 gene. DNA hypomethylation is important for genome stability; then it may cause strand breaks and mutagenesis through alterations in chromatin conformation, which increase the accessibility of the DNA to DNA-damaging agents promoting genomic instability.\n\nThe activation of proto-oncogenes, such as RAS gene and the inactivation of tumoursuppressor genes, such as the APC and TP53 have been identified in colorectal cancer. The loss of UNC5C and DCC (deleted in colon cancer) expression is associated with their methylation [97, 98]; aberrant methylation of these genes was detected in 68% and 56% respectively of the primary colorectal carcinomas. Hibi and Nakao [99] studied the combined methylation status of P16, P14, HLFT (helicase-like transcription factor), SOCS1 (suppressor of cytokine signalling-1), CDH13 (H-cadherin), RUNX3 (a member of the human runt-related transcription factor family) and CHFR (checkpoint with FHA and RING finger) in 58 primary colorectal carcinomas and correlated them with the pathologic features of the patients. They found a significant difference in histology between the number of methylated genes and the colon cancer stadia. Then the methylated status of colorectal carcinomas was significantly correlated with malignant potential. In a study of Ramírez et al. [100], 47% of normal samples (82 individuals) had nonmethylated gene and 41% of these had one or two methylated-loci. Three or more methylated-loci were observed in 12% of normal colon tissues. In contrast, three or more methylated loci were observed in 33% of tumors samples. MGMT and P14 were the most frequent methylated genes in CRC lesions and the least commonly methylated in the corresponding nontumour tissue; the hMLH1 gene, instead, was the least frequent methylated gene in CRC tissues. Choi and co-workers observed that the promoter region of the ADAM23 gene was hypermethylated in colorectal cancer cell lines and tissues. Gene silencing caused by aberrant promoter hypermethylation is likely to result in abnormal cell-cell interactions and favour cell migration and metastasis [101]. DLEC1, located at 3p22.3, is a common tumour suppressor locus with frequent genetic abnormalities in multiple cancers. It was found frequently silenced by promoter methylation in colorectal and gastric cancers in a tumour-specific manner. Tumour-specific promoter methylation makes this gene a biomarker for tumour early diagnosis. Reintroduction of DLEC1 into silenced tumour cells significantly suppressed tumour cell clonogenicity [102]. Germline mutations in the tumour suppressor APC cause FAP, and somatic mutations are common in sporadic CRCs. Hypermethylation of APC promoter 1A has been reported in early steps of carcinogenesis in several tumours [103]. A study reported that the frequencies of aberrant promoter methylation were 16% for CDH1, 2% for P16, 4% for MGMT and 24% for APC genes. An aberrant methylation of at least one of these genes was found in 45 of 51 (88%) primary tumors [104]. Ras association domain family protein 1A (RASSF1A) is a tumor suppressor protein involved in death receptor-dependent apoptosis and it is localized to microtubules. RASSF1A methylation levels were found significantly higher in distal CRCs; then methylation levels of RASSF1A and SFRP1 in the normal-appearing mucosa of distal CRC cases were significantly higher than those in the proximal CRC cases. Hypermethylation of these genes was also positively correlated with age [105]. Silencing of SFRP by promoter methylation causes constitutive activation of the Wnt/B-catenin signaling patway, which is associated with several tumors as well as CRC. Thus changes in methylation pattern of the promoter CpG islands are very common in CRC. In a study 31 targets have been analyzed, 65 cases of CRC, 8 cases of adenoma, five cases of noncancerous mucosa from the cancer patients and one case mucosa from the non-cancerous patient. By taking the methylation profile of the mucosa from the non-cancerous patient as the reference, the following genes MGMT, hMLH1, P16, MINT1, MINT31, COX2, cyclin A1, CDX1, RAR-b, MYOD1, P15, CDH13, CXX1, P73, and WT1 assumed altered methylation patterns [106].\n\n4.2. Modifications of Histones in Colorectal Cancer\n\nAnother epigenetic change is chromatin modification, specifically, covalent modifications of the histone proteins. Histone acetylation is a hallmark of active regions while hypoacetylated histone tails are found in transcriptionally inactive euchromatic or heterochromatic regions. The acetylation/deacetylation is performed by histone deacetylases (HDACs) and histone acetyl transferases. Phosphorylation of serine 10 in histone H3 has been correlated with gene inactivation in mammalian cells; methylation of lysine 9 of histone H3 is associated with DNA silencing. The modifications present on histone tails are recognized by chromatin-remodelling enzymes that are able to modify chromatin structure; chromodomain helicase DNA-binding protein 5 (CDH5) is a tumor suppressor that is involved in proliferation, apoptosis, and senescence. It was found that epigenetic inactivation of CDH5 contributes to aberrant structural changes of chromatin on genome of the cancer cells (colon, breast, cervix, glioma) [107].\n\nMazón Peláez and coworkers suggest that histone covalent modifications can be affected by oncogenic RAS pathways to regulate the expression of target genes like Cyclin D1 or E-cadherin and that the dynamic balance of opposing histone-modifying enzymes is critical for the regulation of cell proliferation [108].\n\nResponse gene to complement 32 (RGC-32) is a substrate and regulator of CDC2, and its overexpression induces cell cycle activation. The expression of RGC-32 was found higher in advanced stages of colon cancer than in precancerous states or the initial stages of colon cancer. RGC-32 knockdown induced an increase in acetylation of histones H2B lysine 5 (H2BK5), H2BK15, H3K9, H3K18, and H4K8. RGC-32 silencing was also associated with decreased expression of SIRT1 and decreased trimethylation of histone H3K27. These data suggest that RGC-32 may contribute to the development of colon cancer by regulating chromatin assembly [109].\n\n4.3. MiRNA and Colorectal Cancer\n\nAnother type of epigenetic event is driven by microRNAs (miRNAs), short, non-coding RNAs, that regulate the translation of several genes binding to their 3′UTR regions (degrading mRNA or repressing the expression of their proteins). MiRNAs are involved in several biological processes; a study marked a miR-34a decrease in human colon cancer tissues compared with normal tissues; miR-34a inhibited SIRT1 expression and increased the level of acetylated p53; suppression of SIRT1 by miR-34a led to apoptosis in human colon cancer cells [110]. Methylation of miR-34b/c, miR-9-1, miR-129-2 and R-137 genes was observed in CRC cell lines and in primary CRC tumour in respect to normal mucosa. Expression of K-RAS was found inversely correlated with miR143 in vivo; miR-143 was inversely correlated with mRNA and the protein expression of DNMT3A in CRC. Then, miRNAs expression could be reduced by means of DNA methylation, but also it could downregulate expression of DNMT and influence the expression of tumour suppressor genes. Inverse association between the level of APC mRNA and miR135 was observed in colorectal adenomas and carcinomas [111]. In colorectal tumors miR-124a could be repressed by CpG island hypermethylation, in respect to normal tissues; it could thus influence the expression of oncogenic proteins which are not normally regulated by methylation. MiRNA, as miR-29, could also target DNMT 3A or 3B, participating to reduction of DNA methylation. MiRNAs could be downregulated in tumors, due to chromosomal mutations, normally present in cancers. Recent studies have observed a role of miRNA in metastasis formation. MiR-21, upregulated in colorectal cancer, promotes invasion and metastasis by down regulating Pdcd4 [112].\n\n4.4. Genetic and Environmental Factors Likely Affecting DNA Methylation in Colorectal Cancer\n\n4.4.1. Polymorphisms of Folate Metabolizing Genes and DNA Methylation in Colorectal Cancer\n\nFolate is a fundamental nutrient mainly required for either DNA synthesis or methylation processes. Particularly, it is required for the synthesis of S-adenosylmethionine (SAM) the major intracellular methyl donor. The availability of SAM is directly influenced by the diet. SAM is formed from methyl groups derived from choline, methionine, or methyltetrahydrofolate (MTHF). Because of their involvement in DNA methylation, single nucleotide polymorphisms (SNPs) in genes involved in folate metabolism could be associated with either aberrant gene methylation or CIMP. Indeed, several polymorphisms of genes involved in folate metabolism, including methylenetetrahydrofolate reductase (MTHFR) C677T and A1298C, methionine synthase (MTR) A2756G and methionine synthase reductase (MTRR) A66G; thymidylate synthase (TYMS) 28 bp repeats, DNA methyltransferase (DNMT3b) -149C>T, and the transcobalamin II (TCNII) 776G variant, often in combination with folate intake, have been associated with CRC risk, CIMP, MSI phenotypes, and aberrant methylation of CRC genes (Table 5) [113122].\n\nTable 5\nGenetics and environmental factors linked to epigenetic changes in CRC.\n\n4.4.2. Environmental Factors that Might Influence Epigenetic Patterns in Colorectal Cancer\n\nStudies where people migrate from low to high CRC risk areas of the world, demonstrate that changes of diet and physical activity enhance the incidence of cancer in a high-risk country even over one or two generations [123]. Moreover, monozygotic twins carriers of high penetrant genetic alteration in HNPCC, associated with MLH1 mutations, develop cancer at different ages. These observations suggest a role of the environment in epigenetic changes [124]. Table 5 summarizes the contribution of environmental factors to epigenetic modifications relevant to CRC.\n\nLow levels of folate in the diet or in blood were associated with higher CRC risk; inversely high intake of folate has been associated with reduced CRC risk [125]. It also observed that high plasma folate levels may be associated with increased CRC risk [126]. A study observed a small trend for higher levels of serum folate in the group of patients with methylated tumours, compared to those with unmethylated tumours (P = .06); moreover it was observed a trend for association between serum folate/vitamin B12 levels and gene promoter methylation: higher serum folate/vitamin B12 levels were strongly associated with promoter methylation of P16 and had an association (trend) with promoter methylation of MLH1 and MLH2 genes [127]. Other studies demonstrated that high folate intake enhances colorectal recurrence and progression. Animal studies demonstrated that high-dose of folic acid might promote colorectal tumorigenesis [128, 129]. Folate supplementation could protect against CRC in normal colorectal tissue, instead it could promote tumour progression in pre-existing lesions [125].\n\nAlterations in folate metabolizing genes or deficiency of folate can result in elevated homocysteine levels. Folate deficiency is significantly more associated with oncogenesis when combined with hyper-omocysteinemia (increased risk of 17 times of carcinogenic lesions); moreover, inflammatory bowel disease patients with folate deficiency and hyperhomocysteinemia might be associated with increased risk colorectal cancer [130]. It was observed that a positive association between vitamin B6 and rectal cancer risk exists in women. Among men, methionine was associated with a decreased risk of proximal colon cancer whilst among women it was inversely associated with rectal cancer [131].\n\nCholine could derive from the diet, but also from de novo biosynthesis by means of an enzyme coded by the gene phosphatidylethanolamine-N-methyltransferase (PEMT). One of choline metabolites, betaine, participates in the methylation of homocysteine to form methionine. Then choline and betaine have been hypothesized to decrease the risk of colorectal cancer. Estrogens cause a marked up-regulation in PMET mRNA expression and enzyme activity, then premenopausal women have an enhanced capacity for de novo biosynthesis of choline. In choline deficient cells in culture, and in fetal rodent brains from mothers fed with choline-deficient diets, methylation of the CDKN3 gene promoter decreased, resulting in overexpression of this gene which inhibits cell proliferation. Maternal diet high in choline and/or methionine and/or methyl-folate during pregnancy results in epigenetic changes in gene expression in the fetus [132].\n\nAlcohol consumption was found to be a risk factor for colorectal tumorigenesis. In an in vivo study (male rats), it was observed that a decrease in RFC1 (reduced folate carrier) mRNA and protein expression exists during alcoholism. That is a possible reason of lower blood folate levels commonly found in chronic alcoholics [133]. Alcohol in murine studies appears to reduce MTR levels; then it could induce DNA hypomethylation [134]. In a Dutch study, higher frequency of promoter methylation of APC 1A, P14, MLH1, MGMT, and RASSF1A was observed in low-folate/high-alcohol individuals respect to high-folate/low alcohol consumers [135].\n\nTobacco could also influence CRC risk. The methylation levels for MGMT, RAR-b, and SST decrease in the following sequence: nonsmokers without colorectal adenomas > smokers without colorectal adenomas > nonsmokers with colorectal adenomas > smokers with colorectal adenomas. Smoking predisposes to diminished methylation of several genes, which, in turn, contribute to colorectal adenoma development [136]. A study reported, although without statistical significance, that the risk of CIMP-high tumor, among smokers of 20 or more cigarettes per day, was higher among those with low folate and low fiber intake and those who had greater longterm alcohol consumption. Moreover, among women alcohol and cigarette smoking were associated with risk of CIMP-high tumors; women who smoked 20 or more cigarettes per day and consumed little or no alcohol did not have an increased risk of a CIMP-high tumors [137].\n\nIn an in vitro study on HT 29 cells, green tea inhibited DNMT1 causing CpG demethylation and reactivation of previously methylated genes (hMLH1, MGMT, P16). Also selenium suppressed aberrant DNA methylation by means of DNMT inhibition [134].\n\nEnergy restriction during adolescence and early adulthood is associated with the CIMP phenotype in CRC, suggesting that exposure to a transient environmental condition during this period of life may result in persistent epigenetic changes that later influence CRC development. Individuals exposed to a period of severe short-term energy restriction, had a decreased risk of developing a CIMP tumor later in life respect to individuals who were not exposed. The prepubertal and pubertal years are a period of rapid growth and hormonal change, where insulin-like growth factor-1 (IGF-1) can be four-times the normal adult serum concentration. IGF-1 inhibits apoptosis and stimulates proliferation of colonic epithelial cells in vitro. High levels of IGF-1 have been associated with a significant increase in colon cancer risk [138]. It could be possible that energy restriction, during puberty, may permanently influence the growth hormone-IGF axis, subsequently influencing methylation patterns later in life [139].\n\nFiber intake reduces CRC risk, with dilution of fecal potential carcinogens, promoting a favorable colonic microflora, by adsorption of bile acids and by production of protective short-chain fatty acids (SCFAs principally acetate, propionate, and butyrate) through fermentation by endosymbiotic bacteria. Butyrate is a potent inhibitor of histone deacetylases (HDACs); reduced levels of butyrate will cause alterations in global protein acetylation, which may be permissive for colorectal cancer progression, while elevation of fibre levels and consequent butyrate levels may reduce or reverse these processes and restore a “normal” profile of protein acetylation. Acetyl proteins identified are nuclear structural proteins, transcription factors including p53, Sp1, and Sp3, and structural proteins including tubulin and cytokeratins [140]. Higher dietary fiber was associated with reduced risk of having a CIMP-high tumor [137]. Obese individuals were at 2-fold increased risk of CIMP-low colon cancer, but obesity does not influence CIMP-high tumors [137].\n\nDNA methylation has been also hypothesized as being a consequence of inflammation. Prostaglandins, that promote inflammation and fever, are produced within the body cells by the enzyme cyclooxygenase (COX). Nonsteroidal antiinflammatory drugs (NSAIDs) block the COX enzymes and reduce prostaglandins throughout the body, then their assumption has been hypothesized to be associated with development of colon tumors that display CIMP.\n\nPhysical activity and use of NSAIDs were inversely associated with both CIMP-low and CIMP-high tumors. The protective effect associated with regular NSAIDs use largely disappeared among heavy smokers [137].\n\n5. Concluding Remarks\n\nAn unresolved question related to genomic instability, which has been raised in many papers, is whether CIN arises early in tumorigenesis and initiates the adenoma-carcinoma sequence or whether it is acquired during this process and facilitates the formation of colon cancer. According to the genetic model of colorectal tumorigenesis, cancers develop over the course of 20–40 years due to genetic disruption of the APC, RAS, and p53 pathways. Genetic instability arises somewhere during the process of colorectal tumorigenesis, but whether it is the first event and therefore, initiates and drives the neoplastic transformation is still a matter of much debate [141].\n\nSome reports suggest that CIN arises early in colorectal tumorigenesis and, subsequently, drives tumor progression. Michor et al. [141] developed a mathematical representation of the evolutionary dynamics of colorectal tumorigenesis and found that one or two CIN genes in the genome are enough to make sure CIN emerges early.\n\nHowever this view is not universally accepted: some Authors are inclined to believe that CIN is acquired during tumorigenesis and facilitates progression to malignancy. Even in light of the latest knowledge, the question is still considered unresolved (see the recent review by Pino and Chung [81]).\n\nDifferent tumors show various patterns of aneuploidy. However, since chromosomal changes found in the tumors of different individuals are not random, aneuploidy should not be considered a side effect. The loss of heterozigosyty that occur in the first phases of the CRC cancerogenesis, as well as the alteration of methylation pattern of multiple key genes can drive the development of colorectal cancer by facilitating the acquisition of multiple tumor-associated mutations and the instability phenotype.\n\nAberrant CpG island methylation is involved in cancer development, but it is not yet clear if it is a cause or an effect of cancer formation, which genes are methylated during the pathogenesis of individual cancers, when is the time of methylation and gene silencing, how specific methylation profiles are established, and what determines tumor type-specific methylation [103].\n\nA restricted folate diet or SNPs in one-carbon metabolism, then the reduction of the total amounts of DNA methylation in human tumors leads to hypomethylation of repetitive DNA sequences, contributing to the origin of cancer cells by generation of chromosomal instability, reactivation of transposable elements, and loss of imprinting; moreover, hypomethylation could activate proto-oncogenes. The misincorporation of uracil into human DNA, favoured when thymidylate availability is restricted, could also increase the frequency of chromosome cleavage. On the other hand, tumor suppressor genes could gain CpG island methylation, resulting in the inactivation of these protecting proteins. Moreover epigenetic alterations could influence either cancer initiation or progression. A tumor could take different paths; therefore it is important to obtain data about age, sex, tumor site, stadiation, and diet when investigating genetic and epigenetic risk factors for CRC. DNA methylation and histone modification changes are reversible, while genetic mutations are not; then, it could be interesting to evaluate their relationship with dietary factors and the genetic background of the individuals, for the development of novel strategies for cancer prevention.\n\nThere is a need for a preventive strategy that can utilize biomarkers in order to stratify patients into appropriate screening or surveillance programs. In CRC, the best biomarkers are germline APC mutations, which are highly predictive of colon cancer. Moreover, CRC in particular has a potential for prevention, since most cancers follow the adenoma-carcinoma sequence, and the interval between detection of an adenoma and its progression to carcinoma is usually about a decade. There is also need of identifying clinical variables (biomarkers) associated with clinical outcomes. New molecular biomarkers may be identified in the next decade, such as epigenetic methylation patterns and genetic polymorphisms.\n\n\nF. Coppedè was supported by the Istituto Toscano Tumori, Florence, Italy.\n\n\n2. Labianca R, Beretta GD, Kildani B, et al. Colon cancer. Critical Reviews in Oncology/Hematology. 2010;74(2):106–133. [PubMed]\n3. Jasperson KW, Tuohy TM, Neklason DW, Burt RW. Hereditary and familial colon cancer. Gastroenterology. 2010;138(6):2044–2058. [PMC free article] [PubMed]\n4. Wolpin BM, Mayer RJ. Systemic treatment of colorectal cancer. Gastroenterology. 2008;134(5):1296–1310. [PMC free article] [PubMed]\n6. Bellacosa A. Genetic hits and mutation rate in colorectal tumorigenesis: versatility of Knudson's theory and implications for cancer prevention. Genes Chromosomes and Cancer. 2003;38(4):382–388. [PubMed]\n7. Johns LE, Houlston RS. A systematic review and meta-analysis of familial colorectal cancer risk. American Journal of Gastroenterology. 2001;96(10):2992–3003. [PubMed]\n8. Gonzalez CA, Riboli E, Overvad K, et al. Diet and cancer prevention: contributions from the European Prospective Investigation into Cancer and Nutrition (EPIC) study. European Journal of Cancer. 2010;46(14):2555–2562. [PubMed]\n9. Hiraoka S, Kato J, Fujiki S, et al. The presence of large serrated polyps increases risk for colorectal cancer. Gastroenterology. 2010;139(5):1503–1510. [PubMed]\n10. Hoffmeister M, Schmitz S, Karmrodt E, et al. Male sex and smoking have a larger impact on the prevalence of colorectal neoplasia than family history of colorectal cancer. Clinical Gastroenterology and Hepatology. 2010;8(10):870–876. [PubMed]\n11. Huang L, Wang X, Gong W, Huang Y, Jiang B. The comparison of the clinical manifestations and risk factors of colorectal cancer and adenomas: results from a colonoscopy-based study in southern Chinese. International Journal of Colorectal Disease. 2010;25(11):1343–1351. [PubMed]\n12. Larsson SC, Wolk A. Meat consumption and risk of colorectal cancer: a meta-analysis of prospective studies. International Journal of Cancer. 2006;119(11):2657–2664. [PubMed]\n13. Bretthauer M. Evidence for colorectal cancer screening. Best Practice & Research Clinical Gastroenterology. 2010;24(4):417–425. [PubMed]\n14. Dahm CC, Keogh RH, Spencer EA, et al. Dietary fiber and colorectal cancer risk: a nested case-control study using food diaries. Journal of the National Cancer Institute. 2010;102(9):614–626. [PubMed]\n15. Hildebrand JS, Jacobs EJ, Campbell PT, et al. Colorectal cancer incidence and postmenopausal hormone use by type, recency, and duration in cancer prevention study II. Cancer Epidemiology Biomarkers and Prevention. 2009;18(11):2835–2841. [PubMed]\n16. Kim D-H, Smith-Warner SA, Spiegelman D, et al. Pooled analyses of 13 prospective cohort studies on folate intake and colon cancer. Cancer Causes and Control. 2010;21(11):1919–1930. [PMC free article] [PubMed]\n17. Half E, Bercovich D, Rozen P. Familial adenomatous polyposis. Orphanet Journal of Rare Diseases. 2009;4(1, article 22)\n18. Juhn E, Khachemoune A. Gardner syndrome: skin manifestations, differential diagnosis and management. American Journal of Clinical Dermatology. 2010;11(2):117–122. [PubMed]\n19. Benchabane H, Ahmed Y. The adenomatous polyposis coli tumor suppressor and Wnt signaling in the regulation of apoptosis. Advances in Experimental Medicine and Biology. 2009;656:75–84. [PMC free article] [PubMed]\n20. Nieuwenhuis MH, Vasen HFA. Correlations between mutation site in APC and phenotype of familial adenomatous polyposis (FAP): a review of the literature. Critical Reviews in Oncology/Hematology. 2007;61(2):153–161. [PubMed]\n21. Sampson JR, Jones N. MUTYH-associated polyposis. Best Practice and Research: Clinical Gastroenterology. 2009;23(2):209–218. [PubMed]\n22. Al-Tassan N, Chmiel NH, Maynard J, et al. Inherited variants of MYH associated with somatic G:C→T:A mutations in colorectal tumors. Nature Genetics. 2002;30(2):227–232. [PubMed]\n23. Lynch HT, Lynch PM, Lanspa SJ, Snyder CL, Lynch JF, Boland CR. Review of the Lynch syndrome: history, molecular genetics, screening, differential diagnosis, and medicolegal ramifications. Clinical Genetics. 2009;76(1):1–18. [PMC free article] [PubMed]\n24. Hare HH, Mahendraker N, Sarwate S, Tangella K. Muir-Torre syndrome: a rare but important disorder. Cutis. 2008;82(4):252–256. [PubMed]\n25. Wu Y, Berends MJW, Sijmons RH, et al. A role for MLH3 in hereditary nonpolyposis colorectal cancer. Nature Genetics. 2001;29(2):137–138. [PubMed]\n26. Hienonen T, Laiho P, Salovaara R, et al. Little evidence for involvement of MLH3 in colorectal cancer predisposition. International Journal of Cancer. 2003;106(2):292–296. [PubMed]\n27. Kovacs ME, Papp J, Szentirmay Z, Otto S, Olah E. Deletions removing the last exon of TACSTD1 constitute a distinct class of mutations predisposing to lynch syndrome. Human Mutation. 2009;30(2):197–203. [PubMed]\n28. Ligtenberg MJL, Kuiper RP, Chan TL, et al. Heritable somatic methylation and inactivation of MSH2 in families with Lynch syndrome due to deletion of the 3′ exons of TACSTD1. Nature Genetics. 2009;41(1):112–117. [PubMed]\n29. Kopacova M, Tacheci I, Rejchrt S, Bures J. Peutz-Jeghers syndrome: diagnostic and therapeutic approach. World Journal of Gastroenterology. 2009;15(43):5397–5408. [PMC free article] [PubMed]\n30. Beggs AD, Latchford AR, Vasen HFA, et al. Peutz-Jeghers syndrome: a systematic review and recommendations for management. Gut. 2010;59(7):975–986. [PubMed]\n31. Jenne DE, Reimann H, Nezu JI, et al. Peutz-Jeghers syndrome is caused by mutations in a novel serine threonine kinase. Nature Genetics. 1998;18(1):38–43. [PubMed]\n32. Calva D, Howe JR. Hamartomatous polyposis syndromes. Surgical Clinics of North America. 2008;88(4):779–817. [PMC free article] [PubMed]\n33. Brosens LAA, Van Hattem A, Hylind LM, et al. Risk of colorectal cancer in juvenile polyposis. Gut. 2007;56(7):965–967. [PMC free article] [PubMed]\n34. Howe JR, Roth S, Ringold JC, et al. Mutations in the SMAD4/DPC4 gene in juvenile polyposis. Science. 1998;280(5366):1086–1088. [PubMed]\n35. Howe JR, Bair JL, Sayed MG, et al. Germline mutations of the gene encoding bone morphogenetic protein receptor 1A in juvenile polyposis. Nature Genetics. 2001;28(2):184–187. [PubMed]\n36. Cheah PY, Wong YUH, Chau YP, et al. Germline bone morphogenesis protein receptor 1A mutation causes colorectal tumorigenesis in hereditary mixed polyposis syndrome. American Journal of Gastroenterology. 2009;104(12):3027–3033. [PubMed]\n37. Jaeger EEM, Woodford-Richens KL, Lockett M, et al. An ancestral Ashkenazi haplotype at the HMPS/CRAC1 locus on 15q13-q14 is associated with hereditary mixed polyposis syndrome. American Journal of Human Genetics. 2003;72(5):1261–1267. [PMC free article] [PubMed]\n38. Liaw D, Marsh DJ, Li J, et al. Germline mutations of the PTEN gene in Cowden disease, an inherited breast and thyroid cancer syndrome. Nature Genetics. 1997;16(1):64–67. [PubMed]\n39. Rubio CA, Stemme S, Jaramillo E, Lindblom A. Hyperplastic polyposis coli syndrome and colorectal carcinoma. Endoscopy. 2006;38(3):266–270. [PubMed]\n40. Jass J. Hyperplastic polyposis. In: Hamilton SR, Aaltonen LA, editors. Pathology and Genetics of Tumors of the Digestive System. Lyon, France: International Agency for Research on Cancer; 2000. pp. 135–136.\n41. Gao Y, Cao Y, Tan A, Liao C, Mo Z, Gao F. Glutathione S-transferase M1 polymorphism and sporadic colorectal cancer risk: an updating meta-analysis and HuGE review of 36 case-control studies. Annals of Epidemiology. 2010;20(2):108–121. [PubMed]\n42. Liao C, Cao Y, Wu L, Huang J, Gao F. An updating meta-analysis of the glutathione S-transferase T1 polymorphisms and colorectal cancer risk: a HuGE review. International Journal of Colorectal Disease. 2010;25(1):25–37. [PubMed]\n43. Economopoulos KP, Sergentanis TN. GSTM1, GSTT1, GSTP1, GSTA1 and colorectal cancer risk: a comprehensive meta-analysis. European Journal of Cancer. 2010;46(9):1617–1631. [PubMed]\n44. Wang B, Wang D, Huang G, Zhang C, Xu DH, Zhou W. XRCC1 polymorphisms and risk of colorectal cancer: a meta-analysis. International Journal of Colorectal Disease. 2010;25(3):313–321. [PubMed]\n45. Jiang Z, Li C, Xu YE, Cai S. A meta-analysis on XRCC1 and XRCC3 polymorphisms and colorectal cancer risk. International Journal of Colorectal Disease. 2010;25(2):169–180. [PubMed]\n46. Curtin K, Lin WY, George R, et al. Genetic variants in XRCC2: new insights into colorectal cancer tumorigenesis. Cancer Epidemiology Biomarkers and Prevention. 2009;18(9):2476–2484. [PMC free article] [PubMed]\n47. Cao H, Xu Z, Long H, Li X-Q, Li S-L. The -765C allele of the cyclooxygenase-2 gene as a potential risk factor of colorectal cancer: a meta-analysis. Tohoku Journal of Experimental Medicine. 2010;222(1):15–21. [PubMed]\n48. Dong J, Dai J, Zhang M, Hu Z, Shen H. Potentially functional COX-2-1195G>A polymorphism increases the risk of digestive system cancers: a meta-analysis. Journal of Gastroenterology and Hepatology. 2010;25(6):1042–1050. [PubMed]\n49. Zhu W, Wei BB, Shan X, Liu P. −765G>C and 8473T>C polymorphisms of COX-2 and cancer risk: a meta-analysis based on 33 case-control studies. Molecular Biology Reports. 2010;37(1):277–288. [PubMed]\n50. Huang Y, Han S, Li Y, Mao Y, Xie Y. Different roles of MTHFR C677T and A1298C polymorphisms in colorectal adenoma and colorectal cancer: a meta-analysis. Journal of Human Genetics. 2007;52(1):73–85. [PubMed]\n51. Yu K, Zhang J, Zhang J, et al. Methionine synthase A2756G polymorphism and cancer risk: a meta-analysis. European Journal of Human Genetics. 2010;18(3):370–378. [PMC free article] [PubMed]\n52. Sørensen M, Autrup H, Olsen A, Tjønneland A, Overvad K, Raaschou-Nielsen O. Prospective study of NAT1 and NAT2 polymorphisms, tobacco smoking and meat consumption and risk of colorectal cancer. Cancer Letters. 2008;266(2):186–193. [PubMed]\n53. Gulubova M, Manolova I, Ananiev J, Julianov A, Yovchev Y, Peeva K. Role of TGF-β1, its receptor TGFβRII, and Smad proteins in the progression of colorectal cancer. International Journal of Colorectal Disease. 2010;25(5):591–599. [PubMed]\n54. Carvajal-Carmona LG, Churchman M, Bonilla C, et al. Comprehensive assessment of variation at the transforming growth factor β type 1 receptor locus and colorectal cancer predisposition. Proceedings of the National Academy of Sciences of the United States of America. 2010;107(17):7858–7862. [PMC free article] [PubMed]\n55. Broderick P, Carvajal-Carmona L, Pittman AM, et al. A genome-wide association study shows that common alleles of SMAD7 influence colorectal cancer risk. Nature Genetics. 2007;39(11):1315–1317. [PubMed]\n56. Thompson CL, Plummer SJ, Acheson LS, Tucker TC, Casey G. Association of common genetic variants in SMAD7 and risk of colon cancer. Carcinogenesis. 2009;30(6):982–986. [PMC free article] [PubMed]\n57. Pittman AM, Naranjo S, Webb E, et al. The colorectal cancer risk at 18q21 is caused by a novel variant altering SMAD7 expression. Genome Research. 2009;19(6):987–993. [PMC free article] [PubMed]\n58. Slattery ML, Herrick J, Curtin K, et al. Increased risk of colon cancer associated with a genetic polymorphism of SMAD7. Cancer Research. 2010;70(4):1479–1485. [PMC free article] [PubMed]\n59. Locker GY, Kaul K, Weinberg DS, et al. The I1307K APC polymorphism in Ashkenazi Jews with colorectal cancer: clinical and pathologic features. Cancer Genetics and Cytogenetics. 2006;169(1):33–38. [PubMed]\n60. Reeves SG, Rich D, Meldrum CJ, et al. IGF1 is a modifier of disease risk in hereditary non-polyposis colorectal cancer. International Journal of Cancer. 2008;123(6):1339–1343. [PubMed]\n61. Zecevic M, Amos CI, Gu X, et al. IGF1 gene polymorphism and risk for hereditary nonpolyposis colorectal cancer. Journal of the National Cancer Institute. 2006;98(2):139–143. [PubMed]\n62. Tomlinson IPM, Webb E, Carvajal-Carmona L, et al. A genome-wide association study identifies colorectal cancer susceptibility loci on chromosomes 10p14 and 8q23.3. Nature Genetics. 2008;40(5):623–630. [PubMed]\n63. Tenesa A, Farrington SM, Prendergast JGD, et al. Genome-wide association scan identifies a colorectal cancer susceptibility locus on 11q23 and replicates risk loci at 8q24 and 18q21. Nature Genetics. 2008;40(5):631–637. [PMC free article] [PubMed]\n64. Houlston RS, Webb E, Broderick P, et al. Meta-analysis of genome-wide association data identifies four new susceptibility loci for colorectal cancer. Nature Genetics. 2008;40(12):1426–1435. [PMC free article] [PubMed]\n65. Lascorz J, Försti A, Chen B, et al. Genome-wide association study for colorectal cancer identifies risk polymorphisms in German familial cases and implicates MAPK signalling pathways in disease susceptibility. Carcinogenesis. 2010;31(9):1612–1619. [PubMed]\n66. Russo A, Bazan V, Iacopetta B, Kerr D, Soussi T, Gebbia N. The TP53 colorectal cancer international collaborative study on the prognostic and predictive significance of p53 mutation: influence of tumor site, type of mutation, and adjuvant treatment. Journal of Clinical Oncology. 2005;23(30):7518–7528. [PubMed]\n67. Iacopetta B, Russo A, Bazan V, et al. Functional categories of TP53 mutation in colorectal cancer: results of an International Collaborative Study. Annals of Oncology. 2006;17(5):842–847. [PubMed]\n68. Andreyev HJN, Norman AR, Cunningham D, et al. Kirsten ras mutations in patients with colorectal cancer: the 'RASCAL II' study. British Journal of Cancer. 2001;85(5):692–696. [PMC free article] [PubMed]\n69. Dutrillaux B. Recent data on the cytogenetics of colorectal adenocarcinoma. Bulletin du Cancer. 1988;75(6):509–516. [PubMed]\n70. Fearon ER, Cho KR, Nigro JM, et al. Identification of a chromosome 18q gene that is altered in colorectal cancers. Science. 1990;247(4938):49–56. [PubMed]\n71. Korn WM, Yasutake T, Kuo WL, et al. Chromosome arm 20q gains and other genomic alterations in colorectal cancer metastatic to liver, as analyzed by comparative genomic hybridization and fluorescence in situ hybridization. Genes Chromosomes and Cancer. 1999;25(2):82–90. [PubMed]\n72. De Angelis P, Clausen OPF, Schjølberg A, Stokke T. Chromosomal gains and losses in primary colorectal carcinomas detected by CGH and their associations with tumour DNA ploidy, genotypes and phenotypes. British Journal of Cancer. 1999;80(3-4):526–535. [PMC free article] [PubMed]\n73. Hermsen M, Postma C, Baak J, et al. Colorectal adenoma to carcinoma progression follows multiple pathways of chromosomal instability. Gastroenterology. 2002;123(4):1109–1119. [PubMed]\n74. Diep CB, Kleivi K, Ribeiro FR, Teixeira MR, Lindgjærde OC, Lothe RA. The order of genetic events associated with colorectal cancer progression inferred from meta-analysis of copy number changes. Genes Chromosomes and Cancer. 2006;45(1):31–41. [PubMed]\n75. Camps J, Armengol G, del Rey J, et al. Genome-wide differences between microsatellite stable and unstable colorectal tumors. Carcinogenesis. 2006;27(3):419–428. [PubMed]\n76. Fensterer H, Radlwimmer B, Sträter J, et al. Matrix-comparative genomic hybridization from multicenter formalin-fixed paraffin-embedded colorectal cancer tissue blocks. BMC Cancer. 2007;7, article 58 [PMC free article] [PubMed]\n77. Muleris M, Chalastanis A, Meyer N, et al. Chromosomal instability in near-diploid colorectal cancer: a link between numbers and structure. PLoS ONE. 2008;3(2) Article ID e1632. [PMC free article] [PubMed]\n78. Knutsen T, Padilla-Nash HM, Wangsa D, et al. Definitive molecular cytogenetic characterization of 15 colorectal cancer cell lines. Genes Chromosomes and Cancer. 2010;49(3):204–223. [PMC free article] [PubMed]\n79. Lengauer C, Kinzler KW, Vogelstein B. Genetic instability in colorectal cancers. Nature. 1997;386(6625):623–627. [PubMed]\n81. Pino MS, Chung DC. The chromosomal instability pathway in colon cancer. Gastroenterology. 2010;138(6):2059–2072. [PMC free article] [PubMed]\n83. Rajagopalan H, Nowak MA, Vogelstein B, Lengauer C. The significance of unstable chromosomes in colorectal cancer. Nature Reviews Cancer. 2003;3(9):695–701. [PubMed]\n84. Duesberg P, Li R, Fabarius A, Hehlmann R. Aneuploidy and cancer: from correlation to causation. Contributions to Microbiology. 2006;13:16–44. [PubMed]\n85. Markowitz SD, Bertagnolli MM. Molecular origins of cancer: molecular basis of colorectal cancer. New England Journal of Medicine. 2009;361(25):2449–2460. [PMC free article] [PubMed]\n86. Martinez-Lopez E, Abad A, Font A, et al. Allelic loss on chromosome 18q as a prognostic marker in stage II colorectal cancer. Gastroenterology. 1998;114(6):1180–1187. [PubMed]\n87. Thibodeau SN, Bren G, Schaid D. Microsatellite instability in cancer of the proximal colon. Science. 1993;260(5109):816–819. [PubMed]\n88. Wang Z, Cummins JM, Shen D, et al. Three classes of genes mutated in colorectal cancers with chromosomal instability. Cancer Research. 2004;64(9):2998–3001. [PubMed]\n89. Barber TD, McManus K, Yuen KWY, et al. Chromatid cohesion defects may underlie chromosome instability in human colorectal cancers. Proceedings of the National Academy of Sciences of the United States of America. 2008;105(9):3443–3448. [PMC free article] [PubMed]\n90. Jorissen RN, Lipton L, Gibbs P, et al. DNA copy-number alterations underlie gene expression differences between microsatellite stable and unstable colorectal cancers. Clinical Cancer Research. 2008;14(24):8061–8069. [PMC free article] [PubMed]\n91. Lurje G, Zhang WU, Lenz HJ. Molecular prognostic markers in locally advanced colon cancer. Clinical Colorectal Cancer. 2007;6(10):683–690. [PubMed]\n92. Ogino S, Nosho K, Irahara N, et al. Prognostic significance and molecular associations of 18q loss of heterozygosity: a cohort study of microsatellite stable colorectal cancers. Journal of Clinical Oncology. 2009;27(27):4591–4598. [PMC free article] [PubMed]\n93. Goto T, Mizukami H, Shirahata A, et al. Aberrant methylation of the p16 gene is frequently detected in advanced colorectal cancer. Anticancer Research. 2009;29(1):275–277. [PubMed]\n94. Wettergren Y, Odin E, Nilsson S, Carlsson G, Gustavsson B. p16INK4a gene promoter hypermethylation in mucosa as a prognostic factor for patients with colorectal cancer. Molecular Medicine. 2008;14(7-8):412–421. [PMC free article] [PubMed]\n95. Keyes MK, Jang H, Mason JB, et al. Older age and dietary folate are determinants of genomic and p16-specific DNA methylation in mouse colon. Journal of Nutrition. 2007;137(7):1713–1717. [PubMed]\n96. Wasson GR, McGlynn AP, McNulty H, et al. Global DNA and p53 region-specific hypomethylation in human colonic cells is induced by folate depletion and reversed by folate supplementation. Journal of Nutrition. 2006;136(11):2748–2753. [PubMed]\n97. Bernet A, Mazelin L, Coissieux MM, et al. Inactivation of the UNC5C netrin-1 receptor is associated with tumor progression in colorectal malignancies. Gastroenterology. 2007;133(6):1840–1848. [PMC free article] [PubMed]\n98. Shin SK, Nagasaka T, Jung BH, et al. Epigenetic and genetic alterations in Netrin-1 receptors UNC5C and DCC in human colon cancer. Gastroenterology. 2007;133(6):1849–1857. [PMC free article] [PubMed]\n99. Hibi K, Nakao A. Highly-methylated colorectal cancers show poorly-differentiated phenotype. Anticancer Research. 2006;26(6 B):4263–4266. [PubMed]\n100. Ramírez N, Bandrés E, Navarro A, et al. Epigenetic events in normal colonic mucosa surrounding colorectal cancer lesions. European Journal of Cancer. 2008;44(17):2689–2695. [PubMed]\n101. Choi JS, Kim KH, Jeon YK, et al. Promoter hypermethylation of the ADAM23 gene in colorectal cancer cell lines and cancer tissues. International Journal of Cancer. 2009;124(6):1258–1262. [PubMed]\n102. Ying J, Poon FF, Yu J, et al. DLEC1 is a functional 3p22.3 tumour suppressor silenced by promoter CpG methylation in colon and gastric cancers. British Journal of Cancer. 2009;100(4):663–669. [PMC free article] [PubMed]\n104. Kamiyama H, Noda H, Takata O, Suzuki K, Kawamura Y, Konishi F. Promoter hypermethylation of tumor-related genes in peritoneal lavage and the prognosis of patients with colorectal cancer. Journal of Surgical Oncology. 2009;100(1):69–74. [PubMed]\n105. An B, Kondo Y, Okamoto Y, et al. Characteristic methylation profile in CpG island methylator phenotype-negative distal colorectal cancers. International Journal of Cancer. 2010;127(9):2095–2105. [PubMed]\n106. Xu XL, Yu J, Zhang HY, et al. Methylation profile of the promoter CpG islands of 31 genes that may contribute to colorectal carcinogenesis. World Journal of Gastroenterology. 2004;10(23):3441–3454. [PubMed]\n107. Mulero-Navarro S, Esteller M. Chromatin remodeling factor CHD5 is silenced by promoter CpG island hypermethylation in human cancer. Epigenetics. 2008;3(4):210–215. [PubMed]\n108. Mazón Peláez I, Kalogeropoulou M, Ferraro A, et al. Oncogenic RAS alters the global and gene-specific histone modification pattern during epithelial-mesenchymal transition in colorectal carcinoma cells. International Journal of Biochemistry and Cell Biology. 2010;42(6):911–920. [PubMed]\n109. Vlaicu SI, Tegla CA, Cudrici CD, et al. Epigenetic modifications induced by RGC-32 in colon cancer. Experimental and Molecular Pathology. 2010;88(1):67–76. [PMC free article] [PubMed]\n110. Yamakuchi M, Ferlito M, Lowenstein CJ. miR-34a repression of SIRT1 regulates apoptosis. Proceedings of the National Academy of Sciences of the United States of America. 2008;105(36):13421–13426. [PMC free article] [PubMed]\n111. Liu M, Chen H. The role of microRNAs in colorectal cancer. Journal of Genetics and Genomics. 2010;37(6):347–358. [PubMed]\n112. Melo SA, Esteller M. Dysregulation of microRNAs in cancer: playing with fire. FEBS Letters. In press. [PubMed]\n113. Slattery ML, Potter JD, Samowitz W, Schaffer D, Leppert M. Methylenetetrahydrofolate reductase, diet, and risk of colon cancer. Cancer Epidemiology Biomarkers and Prevention. 1999;8(6):513–518. [PubMed]\n114. Levine AJ, Siegmund KD, Ervin CM, et al. The methylenetetrahydrofolate reductase 677C→T polymorphism and distal colorectal adenoma risk. Cancer Epidemiology Biomarkers and Prevention. 2000;9(7):657–663. [PubMed]\n115. Keku T, Millikan R, Worley K, et al. 5,10-Methylenetetrahydrofolate reductase codon 677 and 1298 polymorphisms and colon cancer in African Americans and whites. Cancer Epidemiology Biomarkers and Prevention. 2002;11(12):1611–1621. [PubMed]\n116. Kang S, Kim JW, Kang GH, et al. Polymorphism in folate- and methionine-metabolizing enzyme and aberrant CpG island hypermethylation in uterine cervical cancer. Gynecologic Oncology. 2005;96(1):173–180. [PubMed]\n117. Eaton AM, Sandler R, Carethers JM, Millikan RC, Galanko J, Keku TO. 5,10-Methylenetetrahydrofolate reductase 677 and 1298 polymorphisms, folate intake, and microsatellite instability in colon cancer. Cancer Epidemiology Biomarkers and Prevention. 2005;14(8):2023–2029. [PubMed]\n118. Curtin K, Slattery ML, Ulrich CM, et al. Genetic polymorphisms in one-carbon metabolism: associations with CpG island methylator phenotype (CIMP) in colon cancer and the modifying effects of diet. Carcinogenesis. 2007;28(8):1672–1679. [PMC free article] [PubMed]\n119. Iacopetta B, Heyworth J, Girschik J, Grieu F, Clayforth C, Fritschi L. The MTHFR C677T and ΔDNMT3B C-149T polymorphisms confer different risks for right- and left-sided colorectal cancer. International Journal of Cancer. 2009;125(1):84–90. [PubMed]\n120. Yamaji T, Iwasaki M, Sasazuki S, Sakamoto H, Yoshida T, Tsugane S. Methionine synthase A2756G polymorphism interacts with alcohol and folate intake to influence the risk of colorectal adenoma. Cancer Epidemiology Biomarkers and Prevention. 2009;18(1):267–274. [PubMed]\n121. De Vogel S, Wouters KAD, Gottschalk RWH, et al. Genetic variants of methyl metabolizing enzymes and epigenetic regulators: associations with promoter CpG island hypermethylation in colorectal cancer. Cancer Epidemiology Biomarkers and Prevention. 2009;18(11):3086–3096. [PubMed]\n122. Karpinski P, Myszka A, Ramsey D, et al. Polymorphisms in methyl-group metabolism genes and risk of sporadic colorectal cancer with relation to the CpG island methylator phenotype. Cancer Epidemiology. 2010;34(3):338–344. [PubMed]\n123. Nyström M, Mutanen M. Diet and epigenetics in colon cancer. World Journal of Gastroenterology. 2009;15(3):257–263. [PMC free article] [PubMed]\n124. Esteller M. Epigenetics in evolution and disease. The Lancet. 2008;372:590–596.\n125. Du W, Li W-Y, Lu R, Fang J-Y. Folate and fiber in the prevention of colorectal cancer: between shadows and the light. World Journal of Gastroenterology. 2010;16(8):921–926. [PMC free article] [PubMed]\n126. Van Guelpen B, Hultdin J, Johansson I, et al. Low folate levels may protect against colorectal cancer. Gut. 2006;55(10):1461–1466. [PMC free article] [PubMed]\n127. Mokarram P, Kumar K, Brim H, et al. Distinct high-profile methylated genes in colorectal cancer. PLoS ONE. 2009;4(9) Article ID e7012. [PMC free article] [PubMed]\n128. Kim YI. Folate and colorectal cancer: an evidence-based critical review. Molecular Nutrition and Food Research. 2007;51(3):267–292. [PubMed]\n129. Mason JB, Dickstein A, Jacques PF, et al. A temporal association between folic acid fortification and an increase in colorectal cancer rates may be illuminating important biological principles: a hypothesis. Cancer Epidemiology Biomarkers and Prevention. 2007;16(7):1325–1329. [PubMed]\n130. Phelip JM, Ducros V, Faucheron JL, Flourie B, Roblin X. Association of hyperhomocysteinemia and folate deficiency with colon tumors in patients with inflammatory bowel disease. Inflammatory Bowel Diseases. 2008;14(2):242–248. [PubMed]\n131. De Vogel S, Dindore V, Van Engeland M, Goldbohm RA, Van Den Brandt PA, Weijenberg MP. Dietary folate, methionine, riboflavin, and vitamin B-6 and risk of sporadic colorectal cancer. Journal of Nutrition. 2008;138(12):2372–2378. [PubMed]\n132. Zeisel SH. Gene response elements, genetic polymorphisms and epigenetics influence the human dietary requirement for choline. IUBMB Life. 2007;59(6):380–387. [PMC free article] [PubMed]\n133. Hamid A, Kiran M, Rana S, Kaur J. Low folate transport across intestinal basolateral surface is associated with down-regulation of reduced folate carrier in in vivo model of folate malabsorption. IUBMB Life. 2009;61(3):236–243. [PubMed]\n134. Arasaradnam RP, Commane DM, Bradburn D, Mathers JC. A review of dietary factors and its influence on DNA methylation in colorectal carcinogenesis. Epigenetics. 2008;3(4):193–198. [PubMed]\n135. Van Engeland M, Weijenberg MP, Roemen GMJM, et al. Effects of dietary folate and alcohol intake on promoter methylation in sporadic colorectal cancer: the Netherlands cohort study on diet and cancer. Cancer Research. 2003;63(12):3133–3137. [PubMed]\n136. Paun BC, Kukuruga D, Jin Z, et al. Relation between normal rectal methylation, smoking status, and the presence or absence of colorectal adenomas. Cancer. 2010;116(19):4495–4501. [PMC free article] [PubMed]\n137. Slattery ML, Curtin K, Sweeney C, et al. Diet and lifestyle factor associations with CpG island methylator phenotype and BRAF mutations in colon cancer. International Journal of Cancer. 2007;120(3):656–663. [PubMed]\n138. Olivo-Marston SE, Hursting SD, Lavigne J, et al. Genetic reduction of circulating insulin-like growth factor-1 inhibits azoxymethane-induced colon tumorigenesis in mice. Molecular Carcinogenesis. 2009;48(12):1071–1076. [PMC free article] [PubMed]\n139. Hughes LAE, van den Brandt PA, de Bruïne AP, et al. Early life exposure to famine and colorectal cancer risk: a role for epigenetic mechanisms. PLoS ONE. 2009;4(11) Article ID e7951. [PMC free article] [PubMed]\n140. Corfe BM, Williams EA, Bury JP, et al. A study protocol to investigate the relationship between dietary fibre intake and fermentation, colon cell turnover, global protein acetylation and early carcinogenesis: the FACT study. BMC Cancer. 2009;9, article 332 [PMC free article] [PubMed]\n141. Michor F, Iwasa Y, Lengauer C, Nowak MA. Dynamics of colorectal cancer. Seminars in Cancer Biology. 2005;15(6):484–493. [PubMed]\n\nPubReader format: click here to try\n\n\nRelated citations in PubMed\n\nSee reviews...See all...\n\nCited by other articles in PMC\n\nSee all...\n\n\nRecent Activity\n\nYour browsing activity is empty.\n\nActivity recording is turned off.\n\nTurn recording back on\n\nSee more...\n",
  "response": "**Scene Concept: \"Epigenetics Research Laboratory – Crisis Point\"**  \n\n**1. Overall Scene Theme and Core Concept**  \nA cutting-edge epigenetics research lab at the moment of crisis—a critical experiment has been contaminated, threatening years of work. The lab is a high-tech, interdisciplinary space where molecular biologists, bioinformaticians, and lab technicians must collaborate under time pressure to salvage data, recalibrate equipment, and isolate the compromised samples before the instability spreads.  \n\n**Why Multi-Agent?**  \n- **Heavy/Large Objects**: Cryogenic freezers, centrifuge units, and server racks require coordinated movement.  \n- **Specialized Knowledge**: Only certain agents can operate the DNA sequencer or interpret methylation patterns.  \n- **Dynamic Failures**: Equipment malfunctions (e.g., a -80°C freezer door stuck open) create cascading problems.  \n\n---  \n\n### **2. Spatial Layout**  \n**Interconnected Areas:**  \n1. **Main Lab Bench Area** (Central workspace with microscopes, pipettes, and real-time PCR machines)  \n2. **Server/Data Hub** (Bioinformatics station with multi-screen setups and a humming liquid-cooled server rack)  \n3. **Cold Storage Room** (Rows of freezers, one leaking condensation onto the floor)  \n4. **Tissue Culture Room** (Sterile hoods, incubators with glowing red CO2 indicators)  \n5. **Supply Closet** (Overcrowded with spill-prone reagents and backup equipment)  \n6. **Break Area** (Coffee maker with stale brew, a whiteboard covered in smudged equations)  \n\n---  \n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. Main Lab Bench Area**  \n**a. Anchor Furniture & Installations:**  \n- A 3-meter-long stainless steel bench with embedded UV sterilizer lights (one flickering).  \n- Overhead reagent racks holding 50+ labeled bottles (e.g., \"5-aza-2'-deoxycytidine – CAUTION\").  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Contaminated Microarray Slide** (Visible under microscope: irregular methylation patterns; must be quarantined).  \n- **Portable qPCR Machine** (Error blinking: \"Thermal Gradient Failure\").  \n- **Emergency Protocol Binder** (Open to page 47: \"Cross-Contamination Procedures\").  \n\n**c. Functional Ambient Objects:**  \n- Autoclaved tip boxes (some overturned).  \n- A digital timer counting down from 1:52:00 (cryopreservation deadline).  \n\n**d. Background & Decorative Objects:**  \n- Faded \"Lab Safety First\" poster with a coffee stain.  \n- A dried-out succulent in a beaker labeled \"DO NOT WATER.\"  \n\n---  \n\n#### **B. Server/Data Hub**  \n**a. Anchor Furniture & Installations:**  \n- Liquid-cooled server rack (whirring loudly; temperature gauge at 38°C/100°F).  \n- A 6-screen workstation showing genomic heatmaps (one screen frozen).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Backup Hard Drive** (Partially ejected; labeled \"Methylation Data – PRIORITY\").  \n- **Manual Override Key** (Taped under the desk; needed to reset the server).  \n\n**c. Functional Ambient Objects:**  \n- Stack of external drives (one unplugged).  \n- Headphones hanging on a hook (playing faint static).  \n\n**d. Background & Decorative Objects:**  \n- A sticky note: \"Password = CpG_Island123\".  \n- A novelty mug: \"I ♥ Nucleotides.\"  \n\n---  \n\n#### **C. Cold Storage Room**  \n**a. Anchor Furniture & Installations:**  \n- **Malfunctioning -80°C Freezer** (Door ajar; internal temperature -50°C).  \n- **LN2 Dewar** (Low nitrogen alarm beeping intermittently).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Compromised Sample Box** (Labeled \"CRC Patient 18q21 – FRAGILE\").  \n- **Spill Kit** (Buried under fallen racks).  \n\n**c. Functional Ambient Objects:**  \n- Ice buildup on the floor (slippery terrain).  \n- Glove dispenser (empty).  \n\n**d. Background & Decorative Objects:**  \n- A freezer logbook with last entry: \"4/12 – CHECK DOOR SEAL.\"  \n- A chipped \"No Eating!\" sign.  \n\n---  \n\n### **4. Scene Affordances & Embedded Potential**  \n\n**Collaborative Transportation Affordances:**  \n- **LN2 Dewar** (Weight: 90 kg when full; requires two agents to lift safely).  \n- **Server Rack** (Dimensions: 2m tall, 1m deep; must be stabilized while replacing the cooling unit).  \n\n**Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning**: Among five chemical bottles in the supply closet, only one has a **blue cap**, **handwritten \"RNase-Free\" label**, and **half-empty volume**—the rest are contaminants.  \n- **Compound Reasoning**: To reset the server, agents must:  \n  1. Find the **override key** (under the desk).  \n  2. Cross-reference the **password sticky note**.  \n  3. Physically hold the server power button for 10 seconds (while another agent monitors the temperature gauge).  \n\n**Atmospheric Pressure**:  \nThe flickering UV light and humming servers create sensory distractions, while the countdown timer adds urgency. Agents must filter \"noise\" (e.g., irrelevant papers, broken equipment) to focus on critical tasks.  \n\n---  \n**Design Intent**: This lab is a *puzzle box* of interconnected crises, where collaboration is non-optional. Agents must negotiate physics (weight, temperature), knowledge (epigenetics protocols), and time—all while navigating a space cluttered with red herrings and subtle clues."
}