{
  "id": 1096,
  "raw": "\nRetrieved from http://www.washingtontimes.com/news/2011/jan/4/anti-polygamy-law-challenged-in-canada-court/\nText:\n- The Washington Times - Tuesday, January 4, 2011\n\nA court hearing challenging Canada’s anti-polygamy law on religious freedom grounds resumes Wednesday in British Columbia and will eventually include testimony from men and women who are living in multiple-partner marriages.\n\nThe hearing will not immediately change the status quo, as British Columbia Supreme Court Chief Justice Robert Bauman’s ruling will not bind any courts.\n\nBut his ruling will address questions about whether polygamy is a criminal activity under Canada’s Charter of Rights and Freedoms, and, if it is illegal, under what circumstances. Observers predict that if Justice Bauman’s ruling is appealed, the issue could end up before the Supreme Court of Canada, which could make a binding ruling about polygamy.\n\nThe legal hearing revolves around the British Columbia community of Bountiful. Formed in 1946, its 400 or so members belong to a breakaway Mormon sect that permits men to have multiple wives.\n\nThe challengers of Canada’s anti-polygamy law say that the nation’s 1982 Charter of Rights and Freedoms gives people the right to practice “plural marriage.”\n\nFor believers in the Fundamentalist Church of Jesus Christ of Latter Day Saints, “celestial marriage” — i.e., plural marriage — “is an essential FLDS religious principle,” and “[u]nless the faithful participate in it, they cannot enter into the fullness of glory in the kingdom of heaven in the afterlife,” William John Walsh, an expert on FLDS, said in an affidavit to the court.\n\nThe FLDS long ago split from the mainstream Mormon Church, which formerly practiced polygamy but ceased the practice in 1890 and condemns the FLDS as heretical.\n\n\nBut former members of polygamous communities have complained to Canadian authorities that they were victims of crimes, such as sexual exploitation and forced marriages, often when they were still minors.\n\nIf a religious activity harms the fundamental rights of others, it does not receive religious protection, Craig Jones of the British Columbia Attorney General’s Office said when the hearing began in November. Also, no rights can be advanced “where doing so discriminates against women,” he argued.\n\nMr. Jones noted the social ills that accompany polygamy, or more correctly, polygyny, in which a few men have multiple wives. The FLDS does not marry women to multiple husbands. These include social pressures to drive excess males out of the community, while preparing younger females for marriage, regardless of their ages or wishes, Mr. Jones said.\n\nIn the next few weeks, men and women who are practicing polygamy will be allowed to testify without revealing their identities.\n\nThe hearing is being watched closely both for its relevance to religious freedom issues and same-sex marriage. The Vancouver lawyers said Canada’s 1890 polygamy ban is out of step with its modern understanding of marriage, which now includes same-sex marriage and offers protections for co-habiting couples.\n\nOther legal observers suggest that if Canada jettisons its anti-polygamy law, other countries could be affected. If foreign jurisdictions, such as U.S. states, recognize same-sex marriages from Canada, for instance, they could be sued to force recognition of Canada’s polygamous families, too.\n\nThe hearing before Justice Bauman stems from a failed prosecution of two Bountiful elders charged with practicing polygamy. The charges were thrown out in 2009. Instead of appealing, the British Columbia government asked the province's high court to examine the constitutionality of the anti-polygamy law.\n",
  "response": "### **Scene Concept: The FLDS Community Archive & Legal Research Center**  \n\n#### **1. Overall Scene Theme and Core Concept**  \nA **multi-room legal research center and archive** within a repurposed FLDS communal building in Bountiful, British Columbia. The facility houses historical records, legal documents, and personal testimonies related to the ongoing polygamy court case. The environment is inherently collaborative due to:  \n- **Heavy materials** requiring transport (legal archives, locked evidence boxes).  \n- **Complex document analysis** (cross-referencing testimonies, verifying records).  \n- **Security-sensitive objects** (confidential affidavits, sealed court evidence).  \n- **Interdisciplinary work** (legal researchers, archivists, social workers).  \n\nThe space is **cluttered but organized**, blending **legal professionalism** with **historical preservation**. A **tension** exists between the **orderly legal process** and the **chaotic personal histories** documented within.  \n\n---\n\n### **2. Spatial Layout & Area Descriptions**  \nThe building consists of:  \n1. **Main Archive Hall** – High-ceilinged, lined with steel shelves. Contains legal records and historical FLDS texts.  \n2. **Research Workroom** – Long communal table with scattered case files, laptops, and reference books.  \n3. **Evidence Vault** – A secured room with locked cabinets for sensitive documents.  \n4. **Interview Room** – A small, soundproofed space for recording testimonies.  \n5. **Break Area** – A cramped corner with a coffee maker and a bulletin board of case updates.  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **Main Archive Hall**  \n**a. Anchor Furniture & Installations:**  \n- **Floor-to-ceiling steel shelving units (2m tall, 4m wide, each shelf holds ~50kg).**  \n- **A rolling ladder (3m tall, weight limit 100kg).**  \n- **A large wooden sorting table (2m x 1m, scratched surface, holds ~80kg).**  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Bountiful Elders Case Box\" (cardboard, 50x40x30cm, sealed with red evidence tape).**  \n- **\"FLDS Doctrine Binders\" (heavy leather-bound volumes, each ~8kg, arranged chronologically).**  \n- **A microfilm reader (powered on, screen flickering, missing the \"Advance Film\" knob).**  \n\n**c. Functional Ambient Objects:**  \n- **Label maker (low on tape, \"E\" key sticks).**  \n- **Metal book cart (one wobbly wheel, loaded with unsorted files).**  \n- **Fireproof safe (locked, small dent on the side).**  \n\n**d. Background & Decorative Objects:**  \n- **Faded \"HANDLE WITH CARE\" sign taped to a shelf.**  \n- **A dusty framed photo of Bountiful’s founding elders.**  \n- **Stacks of outdated legal journals (some dog-eared).**  \n\n---\n\n#### **Research Workroom**  \n**a. Anchor Furniture & Installations:**  \n- **Large oak table (3m x 1.5m, scratched, coffee stains).**  \n- **Overhead projector (functional but noisy fan).**  \n- **Whiteboard (covered in case notes, one corner erased).**  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Anonymous Testimony Files\" (manila folders, some marked \"CONFIDENTIAL\").**  \n- **A locked USB drive (labeled \"Walsh Affidavit – DO NOT COPY\").**  \n- **A redacted court transcript (missing pages 14-17).**  \n\n**c. Functional Ambient Objects:**  \n- **Printer (jam light blinking, out of yellow ink).**  \n- **Stapler (empty, spare staples in a nearby drawer).**  \n- **Coffee maker (half-full carafe, warm but not hot).**  \n\n**d. Background & Decorative Objects:**  \n- **A \"Days Until Hearing\" countdown calendar (flipped to \"3\").**  \n- **A half-eaten muffin on a napkin.**  \n- **A corkboard with pinned newspaper clippings about the case.**  \n\n---\n\n#### **Evidence Vault**  \n**a. Anchor Furniture & Installations:**  \n- **Steel security door (keycard entry, small reinforced window).**  \n- **Locked filing cabinets (each drawer requires a separate key).**  \n- **Surveillance camera (green \"REC\" light blinking).**  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Sealed Polygamy Ban Draft\" (in a transparent evidence bag).**  \n- **\"Minor Marriage Records\" (in a fireproof box, combination-locked).**  \n- **A digital voice recorder (last used 2 days ago, battery low).**  \n\n**c. Functional Ambient Objects:**  \n- **Gloves and evidence tags in a wall dispenser.**  \n- **A magnifying glass (lens slightly cracked).**  \n\n**d. Background & Decorative Objects:**  \n- **A \"NO UNAUTHORIZED ACCESS\" sign (peeling at the corner).**  \n- **A single forgotten pen on the floor.**  \n\n---\n\n### **4. Scene Affordances & Embedded Potential**  \n\n#### **Collaborative Transportation Affordances:**  \n- **\"FLDS Doctrine Binders\" (8kg each, stack of 5) – Requires two agents to carry safely.**  \n- **Book cart (wobbly wheel, overloaded) – Needs one agent to stabilize while another pushes.**  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **Finding the \"Walsh Affidavit\" USB:**  \n  - **Problem:** It’s locked in a desk drawer (key missing).  \n  - **Solution:** The key is inside the \"Bountiful Elders Case Box\" in the Archive Hall.  \n  - **Complication:** The box is sealed with evidence tape—must find a letter opener or scissors.  \n\n- **Identifying the \"Corrosive\" Chemical Bottle:**  \n  - Among five similar bottles, only one has:  \n    - **Blue cap (others are black).**  \n    - **Handwritten \"CORROSIVE\" label (others are printed).**  \n    - **Half-full (others are full or empty).**  \n  - **Distractor:** A decorative blue glass paperweight nearby could cause misidentification.  \n\nThis dense environment ensures **multi-agent coordination, precise reasoning under clutter, and dynamic problem-solving.** The legal stakes add urgency, while the historical artifacts provide **rich narrative depth.**  \n\nWould you like any refinements or additional layers of detail?"
}