{
  "id": 1098,
  "raw": "\nRetrieved from http://www.wowwiki.com/Starting_a_Druid\nText:\nStarting a druid\n\n102,281pages on\nthis wiki\n\nRedirected from Starting a Druid\n\nQuests Dk Dr Hu Ma Mo Pa Pr Ro Sh Wl Wr\nAbilities Dk Dr Hu Ma Mo Pa Pr Ro Sh Wl Wr\nSpec Dk Dr Hu Ma Mo Pa Pr Ro Sh Wl Wr\nTalents Dk Dr Hu Ma Mo Pa Pr Ro Sh Wl Wr\nTrainers Dk Dr Hu Ma Mo Pa Pr Ro Sh Wl Wr\nGlyphs Dk Dr Hu Ma Mo Pa Pr Ro Sh Wl Wr\nBuilds Dk Dr Hu Ma Mo Pa Pr Ro Sh Wl Wr\nTactics Dk Dr Hu Ma Mo Pa Pr Ro Sh Wl Wr\nPvE Dk Dr Hu Ma Mo Pa Pr Ro Sh Wl Wr\nPvP Dk Dr Hu Ma Mo Pa Pr Ro Sh Wl Wr\nMacros Dk Dr Hu Ma Mo Pa Pr Ro Sh Wl Wr\n\nSo, you're thinking of playing a druid? This page is intended to give a short overview of what to do over the first 10 levels or so, just to get you started on the right path. If you're looking for more of an overview of the class's abilities, see the main druid page. For more advanced topics, see druid tactics.\n\nFor a guide to leveling a druid further, see leveling a druid\n\nFor a more general overview on starting out playing WoW, see the newbie guide\n\nRace selection Edit\n\nEach faction has two races that can be druids. If you want to be a druid for the Horde, then you will be either a Tauren or Troll. Alliance druids are Night Elf and Worgen. Trolls and Worgen were given this class with the Cataclysm expansion.\n\nIf you don't care about faction, then looking at the racial traits should give you an idea which to play. Tauren get a 5% increase to total health, which will help druid tanks, and War Stomp, one of the few stuns a druid can get and thus very powerful if used correctly. Night elves get an increase to dodge, Shadowmeld, which can be used as a method for escaping combat, and Elusiveness, which will greatly help your stealth, since this trait stacks upon your Prowl spell also. Worgen have a +40% speed racial ability, are slightly resistant to shadow and nature damage, and they have a slight critical chance.\n\nEarly leveling Edit\n\n\nYou will spend levels 1 to 5 in your starting town. Between level 5 and 6 you'll find yourself heading off to your second town and a new trainer who can reset your various things. At the second town, repeat the process - do each and every quest you can find. It's important to keep up with your abilities and your gear. Now is also an appropriate time to start training in your chosen professions.\n\nAt early levels, a druid will mostly use their [Wrath] DD spell and [Moonfire] DoT spell to kill mobs intermixed with melee attacks. Outside, when you get [Entangling Roots], hit mobs with that first and cast a few ranged damage spells before resorting to melee combat.\n\nLevels 1 - 2 Edit\n\nInitially, you're equipped with just a ranged attack spell.\n\nBegin combat at maximum range with [Wrath], spamming it until the mob comes into melee range. Since [Wrath] is a missile attack, combat may not actually begin until the missile strikes, giving you the opportunity to cast another bolt while the first one is in flight. While up close, switch to your melee attack. Heal when necessary. For tauren, you can [War Stomp] a mob at melee range to stun it, buying you time to cast spells or heal.\n\nFor ranged mobs, try to out-spam them at maximum range. If you run out of mana, wait, or run up to engage in melee. If the mob runs out of mana, it will often run to you, giving you the opportunity to engage or increase distance to spam again.\n\nLevels 3 - 5 Edit\n\nAt level 3, you can learn [Moonfire]. Continue to open combat with [Wrath], throwing in a periodic [Moonfire] to land the debuff, walking backwards or strafing to increase distance. Even at melee range, throw in a [Moonfire] when necessary, since as an instant cast, it isn't susceptible to spell interruption. [Moonfire] is also good at tagging the last blow when a mob is weak or running. Keep the [Moonfire] debuff active at all times during combat. Use [Rejuvenation] HoT spell early on to keep your health up.\n\nUse [Rejuvenation] to supplement your direct healing. Use [Healing Touch] for large, time-critical gaps in health.\n\nLevels 6 - 7 Edit\n\n\nLevels 8 - 9 Edit\n\n\nLevel 10 - 11 Edit\n\nAt level 10, you learn your first crowd-control spell, [Entangling Roots]. Continue to open combat with two [Wrath]s and a [Moonfire]. When the mob comes running towards you, root it in place. Now, you have many options. You can run away, rebuff yourself, or increase distance to help spam spells. As you fight mobs, try to keep them rooted at all times and away from you. Use Entangling Roots to halt runners from calling more mobs.\n\nNotable early quests Edit\n\nThe intention is to link into the Quests page here with a few low-level quests once they are added, with particular emphasis on including quests with nice druid rewards, and any Class-specific quests. No real need to include the very basic starting quests as everybody will see those easily enough -- Goldark\n\nIt is interesting to note that there is a druid trainer in Silvermoon City as well as one near the Exodar. It is therefore possible for druids to train in those zones, instead of in their native ones.\n\nDruid flexibility Edit\n\nA hallmark of the druid class is extreme flexibility. While talents will tailor a druid towards a certain specialization, it is not the only factor to consider. Gear sets specialized for different uses and shapeshifting into the alternate forms can go a long way towards allowing a druid of one talent spec to function in an off-spec role. A feral druid with a set of caster gear will be able to do a fairly competent job of healing or DPS spellcasting in caster form. Likewise, a balance or restoration spec druid in feral form with a feral gear set should be able to DPS or even tank in many cases. This is particularly true at the lower levels where players of all classes have incomplete talent selections making talents less of a factor. As levels increase and talent selections are filled in, the ability to play off-spec will diminish. For example, Moonkin Form becomes available to balance druids with 31 talent points (level 40). This is a game changing talent that significantly enhances the balance druid as a caster over off-spec casting druids.\n\nFeral leveling Edit\n\nWhile it is perfectly possible to level using balance or restoration, you will probably not level as fast as a feral druid. Here is the talent order for a fast leveling feral druid. This build allows for questing and grinding in cat form. Bear form should be used when against 3 or more mobs, tanking dungeons, or emergency situations. As far as gear, this build will allow you to level using only trash gear and gear won from quests. Also, this is outdated.\n\nLevels 10 - 14\n\nFerocity - Rank 5/5\n\nReduces the cost of your Maul, Swipe, Claw, Rake and Mangle abilities by 5 Rage or Energy.\n\nLevels 15 - 16\n\nSavage Fury - Rank 2/2\n\nIncreases the damage caused by your Claw, Rake, Mangle (Cat), Mangle (Bear), and Maul abilities by 25%.\n\nLevels 17 - 19\n\nThick Hide - Rank 3/3\n\nIncreases your Armor contribution from items by 10%. Very helpful when in bear form, and a extra boost of armor is needed.\n\nLevels 20 - 22\n\nSharpened Claws - Rank 3/3\n\n\nLevels 23 - 24\n\nFeral Swiftness - Rank 2/2\n\nIncreases your movement speed by 30% while outdoors in Cat Form and increases your chance to dodge while in Cat Form, Bear Form and Dire Bear Form by 4%.\n\nLevels 25 - 27\n\nPredatory Strikes - Rank 3/3\n\nIncreases your melee attack power in Cat, Bear, Dire Bear and Moonkin Forms by 150% of your level and 20% of any attack power on your equipped weapon.\n\nLevels 28 - 29\n\nPrimal Fury - Rank 2/2\n\n\nLevel 30\n\nFeral Charge - Rank 1/1\n\n\n\n\nLevels 31 - 32\n\nBrutal Impact - Rank 2/2\n\nIncreases the stun duration of your Bash and Pounce abilities by 1.0 sec and decreases the cooldown of Bash by 30 sec. Good cross-over to tanking as well; you'll quickly learn that you can't rely on your DPS to interrupt.\n\nLevel 33\n\nSurvival Instincts - Rank 1/1\n\nYou have to stay alive in order to level, and this is one of your only survival-oriented cooldowns.\n\nLevel 34\n\nFeral Instinct - Rank 1/3\n\nSwipe will be your frequent companion, this improves swipe and lets you prowl around a little easier in cat form.\n\nLevels 35 - 39\n\nHeart of the Wild - Rank 5/5\n\nIncreases your Intellect by 20%. In addition, while in Bear or Dire Bear Form your Stamina is increased by 20% and while in Cat Form your attack power is increased by 10%.\n\nLevel 40\n\nLeader of the Pack - Rank 1/1\n\nWhile in Cat, Bear or Dire Bear Form, the Leader of the Pack increases ranged and melee critical chance of all party members within 45 yards by 5%.\n\nLevels 41 - 43\n\nSurvival of the Fittest - Rank 3/3\n\nIncreases all attributes by 3% and reduces the chance you'll be critically hit by melee attacks by 3%.\n\nLevels 44 - 45\n\nImproved Leader of the Pack - Rank 2/2\n\n\nLevels 46 - 47\n\nPrimal Precision - Rank 2/2\n\nIncreases your expertise by 5, and you are refunded 40% of the energy cost of a finishing move if it fails to land.\n\nLevels 48 - 49\n\nFeral Instinct - Rank 3/3\n\nSpend 2 points to get further along the talent tree, and improve swipe even further.\n\nLevel 50\n\nMangle - Rank 1/1\n\nMangle the target, inflicting damage and causing the target to take additional damage from bleed effects for 12 sec. This ability can be used in Cat Form or Dire Bear Form. Mangle will effectively replace Claw as your bread-n-butter combo attack. It crits more often, and does more damage. It also applies a debuff that makes your Shred ability bleed more.\n\nAt this point, you'll take a quick break from the feral tree. Move over to the restoration tree for more talents.\n\nLevel 51 - 52\n\nImproved Mark of the Wild - Rank 2/2\n\nThe 40% improvement to [Mark of the Wild] applies to all party or raid members, and though the passive 2% bonus to stats applies only to the druid, it is helpful to both cats and bears (all specs actually) and it scales with your gear. Excellent way to spend some points.\n\nLevel 53 - 55\n\nFuror - Rank 3/5\n\nGives you 60% chance to gain 10 Rage when you shapeshift into Bear and Dire Bear Form, and you keep up to 60 of your Energy when you shapeshift into Cat Form, and increases your total Intellect while in Moonkin form by 6%.\n\nLevels 56 - 60\n\nNaturalist - Rank 5/5\n\nReduces the cast time of your Healing Touch spell by 0.5 sec and increases the damage you deal with physical attacks in all forms by 10%.\n\nLevel 61\n\nOmen of Clarity - Rank 1/1\n\nEach of the druid's damage, healing spells and auto attacks has a chance of causing the caster to enter a Clearcasting state. The Clearcasting state reduces the mana, rage or energy cost of your next damage, healing spell or offensive ability by 100%.\n\nMove back to the feral tree for the final talents.\n\nLevel 62 - 64\n\nInfected Wounds - Rank 3/3\n\nLevel 65\n\nProtector of the Pack - Rank 1/3\n\nLevel 66 - 70\n\nRend and Tear - Rank 5/5\n\nLevel 71\n\nBerserk - Rank 1/1\n\nLevel 72\n\nPrimal Gore - Rank 1/1\n\nLevel 73 - 74\n\nProtector of the Pack - Rank 3/3\n\nLevel 75 - 77\n\nNatural Reaction - Rank 3/3\n\nLevel 78 - 79\n\nShredding Attacks - Rank 2/2\n\nLevel 80\n\nImproved Mangle - Rank 1/3\n\nHere is the level 70 build.\n\nOn soloing and grouping Edit\n\nSoloing Edit\n\nEven at early levels, the soloing druid acts as the versatile character he or she is supposed to be. Typical fights will include a Direct Damage spell ([Starfire] or ([Wrath]) to start, a Damage over Time spell ([Moonfire]), a Healing over Time spell ([Rejuvenation]), and some melee attacks.\nAs a druid, you should never lose your powerful Mark of the Wild Buff spell. Having this buff on you is like wearing your armor. You would not fight nude, would you? Thorns is a damage shield and should always be visible in your buff list too.\nThese spells are all available at level 4; Thorns is a available at level 6. Edit: thorns no longer in-game.\n\nGrouping Edit\n\nThe druid is one of the most versatile classes in WoW, (after level 20) because you can be almost any part of a 5-man dungeon/raid. It can be quite hard to learn to play all the roles a druid is capable of, but the versatility and ease of finding a group is worth it. No tank? Use your bear form. No healer? Keep an eye on the party's health bars, and heal when they're injured. Need a scout? Use your cat form. Communicate! Ask the others what they plan to do, what they expect from you.\n\nDon't forget your crowd control spells, Entangling Roots and later Hibernate, can be useful if the group gets more enemies than expected.\n\nIf you're dpsing a group, remember to attack the same target as the other dpsers. This is most easily achieved through the /assist command, causing you to target the same target as the one you assist. It might not be all that important at early levels, but its an important habit to get used to for later levels.\n\nIf you are the Tank, use your Bear form, and remind your group to always assist you in battle, to ensure you focus your party's firepower on one mob. They can do this by selecting you (use the F1-F5 keys to target group members) and then pressing \"F\". This way, mobs will die faster.\n\nThe druid is a very versatile class. Especially when acting as a dpser, you have the ability to offheal, offtank, combat rez and Innervate if needed, saving the group from what would otherwise be a wipe. It can be done if acting as a tank or healer as well, but is much harder to pull off.\n\nTip: Don't cast Thorns on someone who isn't supposed to be hit in a fight (generally, everyone but the tank). It causes relatively little damage, and will cause the mobs to generate threat towards them.\n\nUseful professions Edit\n\nThe druid can benefit directly and indirectly from many of the professions available.\n\nPrimary professions Edit\n\nThis combination will be immediately useful to the druid. Expect to wear a combination of found items and items you make yourself as your leatherworking keeps pace with your level. Skinning will increase naturally (you can actually max out at 300 while still in your 40's) but you will spend a lot of money levelling your leatherworking skill. Also, a lot of leatherwork items will sell for less than the cost of the raw materials (because there are a lot of other people out there trying to level their skills too and they will flood the market) - it is only when you hit on the niche items that you can make a profit (things like the Gem Studded Belt, Feathered Breastplate, Ironfeather items, etc.) Furthermore, leatherworking allows you to create \"Armor Kits\" which will increase the armor value of Chest, Hands, Legs, and Feet armor items.\nEven though, as a caster, the druid can rely on his own abilities to heal and buff himself, additional potions are always welcome (though notably, they can't be used in feral forms). It is especially notable that night elves and tauren are both particularly suited to a career in herbalism, and thus alchemy as well. Tauren receive +15 levels of Herbalism skill and the elven zones are remarkably abundant in flowers to pick.\nThe ability to stealth in Cat Form can also prove quite useful, as it allows you to search for herbs (or other gathering professions) without having to fight mobs in the area. Note that you will pop out of stealth when you gather, and the cooldown will prevent you from stealthing for a few seconds when you are done, so use with caution.\nThe druid quest Gathering the Cure requires you to gather a bunch of Earthroot - which task is certainly made easier if you can pick them yourself. The spell Soothe Animal also has its use when herb picking, as it can save you the time needed to fight that beast which would otherwise attack you.\nA mix of the two above, this is very good for players who don't care so much for making things themselves, but would rather sell the raw materials for money. Another benefit with this combo is that you can often find a Leatherworker or Alchemist willing to make the item/potion you want if you supply the materials, possibly with a small fee if the recipe is rare.\n\nStart your profession early! It's usually not too expensive, and you want to ensure that anything you create with your skills is applicable to your druid's level.\n\nSecondary professions Edit\n\nCooking is always useful for any class, as it provides food that affects your stats. Fishing supports this profesion. As for First-Aid, it is certainly less beneficial for you than it is for other classes, but not entirely. Not only do bandages not use your mana, they also don't trigger the 5-second rule (even your instant-cast heals stops your mana regeneration for next 5 seconds).\n\nLong-term goals Edit\n\nSome of the main abilities of the druid are obtained through quests. These include the Bear Form and Abolish Poison spell (an improved version of the Cure Poison spell). These quests are given to the druid by one of the druid trainers of your capital city (Thunder Bluff for tauren and Darnassus for night elves). The druid trainer will first provide you with a special teleport spell: Teleport: Moonglade. Moonglade is a sacred place for all druids, shared by tauren and night elves. Remember that this spell can also be used as a sort of second hearthstone, providing easy access to northern Kalimdor.\n\nSee also Edit\n\nExternal links Edit\n\nAround Wikia's network\n\nRandom Wiki\n",
  "response": "### **Scene Concept: \"The Arcane Botany Laboratory\"**  \n\n#### **1. Overall Scene Theme and Core Concept**  \nInspired by the druidic themes of nature magic and shapeshifting, this scene is a **highly specialized Arcane Botany Laboratory** where researchers cultivate magical flora and study their transformative properties. The lab is a chaotic blend of science and mysticism, with plants that react to arcane energy, rare reagents, and experimental growth chambers.  \n\n**Why Multi-Agent?**  \n- **Heavy Objects:** Some plant specimens are massive, requiring coordinated lifting.  \n- **Precision Tasks:** Delicate procedures (e.g., extracting volatile essences) need synchronized actions.  \n- **Hazard Management:** Magical contamination zones require one agent to stabilize while another works.  \n\n---\n\n#### **2. Spatial Layout and Area Descriptions**  \nThe lab consists of **three interconnected zones**:  \n\n1. **Main Cultivation Chamber** – A greenhouse-like space with glowing flora, irrigation systems, and unstable magical growth pods.  \n2. **Alchemical Preparation Station** – A cluttered workstation with vials, mortars, and a glowing distillation apparatus.  \n3. **Specimen Storage Vault** – A locked cold-storage room with cryo-preserved magical plants and hazardous samples.  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **Main Cultivation Chamber**  \n**a. Anchor Furniture & Installations:**  \n- **Arcane Growth Pod (Large, 2m tall, glass-enclosed, pulsating blue light)** – Contains a rapidly mutating vine.  \n- **Irrigation Control Panel (Steel, with leaky pipes, manual valve wheel)** – Regulates nutrient flow.  \n- **Overgrown Trellis (Wooden, entangled with bioluminescent vines, partially collapsed)** – Blocks a side passage.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Unstable Blossom (Glowing red petals, emits hallucinogenic spores when disturbed)** – Must be harvested carefully.  \n- **Rootbound Tome (Leather-bound, locked with a vine, titled *\"The Verdant Codex\"*)** – Contains crucial notes.  \n- **Broken Mana Infuser (Copper coils exposed, sparking intermittently)** – Needs repair to stabilize the growth pod.  \n\n**c. Functional Ambient Objects:**  \n- **Herb Drying Rack (Wooden, with bundles of Moonleaf and Frostbloom)** – Some are fresh, some brittle.  \n- **Watering Can (Enchanted, self-filling, but cracked at the base)** – Puddles form beneath it.  \n- **Workbench (Cluttered with soil samples, labeled jars, a magnifying lens)** – One jar is leaking purple fluid.  \n\n**d. Background & Decorative Objects:**  \n- **Faded \"CAUTION: VOLATILE SPECIMENS\" poster (Torn at the corner, hanging crookedly).**  \n- **Dusty Druidic Totem (Carved owl figurine, non-functional, resting on a shelf).**  \n- **Discarded Gloves (One is ripped, the other stained with glowing sap).**  \n\n---\n\n#### **Alchemical Preparation Station**  \n**a. Anchor Furniture & Installations:**  \n- **Distillation Apparatus (Glass coils, bubbling green liquid, pressure gauge in the red zone).**  \n- **Reagent Shelf (Overloaded with jars, some labels peeling off).**  \n- **Enchanted Mortar & Pestle (Runes glow faintly, residue from last use still inside).**  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Sealed Essence Vial (Labeled \"Phasebloom Extract – DO NOT SHAKE\").**  \n- **Scorched Recipe Book (Open to a page titled \"Lunar Infusion – WARNING: Reactive\").**  \n- **Faulty Mana Regulator (Emitting a high-pitched whine, needs adjustment).**  \n\n**c. Functional Ambient Objects:**  \n- **Assorted Crystal Phials (Some empty, some half-full with colored liquids).**  \n- **Precision Scales (Dusted with powdered Moonpetal, slightly miscalibrated).**  \n- **Liquid Dispenser (Stuck in \"ON\" position, dripping slowly).**  \n\n**d. Background & Decorative Objects:**  \n- **Chalkboard with half-erased formulas (Some numbers smudged beyond recognition).**  \n- **Coffee Mug (Used as a pen holder, stained with dried potion residue).**  \n- **Potted Withered Sprig (Once a test subject, now just decorative).**  \n\n---\n\n#### **Specimen Storage Vault**  \n**a. Anchor Furniture & Installations:**  \n- **Cryo-Preservation Unit (Frost-covered, humming, warning light blinking \"LOW POWER\").**  \n- **Heavy Security Door (Locked, requires a keycard and voice authorization).**  \n- **Specimen Catalog (Digital, flickering, some entries corrupted).**  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Frozen Heartbloom (Glows faintly, encased in ice, label: \"DO NOT THAW UNSUPERVISED\").**  \n- **Security Keycard (Buried under paperwork in the adjacent room).**  \n- **Malfunctioning Cooling System (Vents spewing cold mist erratically).**  \n\n**c. Functional Ambient Objects:**  \n- **Biohazard Suits (Hanging on a rack, one sleeve torn).**  \n- **Emergency Shutoff Lever (Rusted, requires force to pull).**  \n- **Temperature Logbook (Last entry: \"WARNING: FLUCTUATIONS DETECTED\").**  \n\n**d. Background & Decorative Objects:**  \n- **Old Holiday Garland (Faded, draped over a shelf).**  \n- **Shattered Beaker (Glass shards near the drain).**  \n- **\"Employee of the Month\" Certificate (Dated five years ago).**  \n\n---\n\n### **4. Scene Affordances and Embedded Potential**  \n\n#### **Collaborative Transportation Affordances:**  \n- **Arcane Growth Pod (Weight: 250kg, Fragile Glass)** – Requires two agents to move safely.  \n- **Overgrown Trellis (Bulky, Entangled Vines)** – Needs one agent to hold vines back while another cuts.  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **\"Find the correct essence vial\" (Blue cap vs. green cap vs. unlabeled).**  \n- **\"Fix the Broken Mana Infuser\" (Requires a wrench from the prep station).**  \n- **\"Stabilize the Distillation Apparatus\" (Adjust pressure valve while another monitors the gauge).**  \n\n#### **Compound Problem-Solving Example:**  \n- **Problem:** The **Cryo-Preservation Unit** is failing.  \n- **Solution:**  \n  1. Retrieve the **Security Keycard** from under paperwork.  \n  2. Access the **Emergency Shutoff Lever** (requires force).  \n  3. Use the **Temperature Logbook** to diagnose the issue.  \n\n---\n\n### **Final Notes:**  \nThis environment is **rich in interactive potential**, designed to **force agents to reason about object states, collaborate on heavy tasks, and navigate hazards**. The sheer **density of tools, hazards, and ambient details** ensures that no task is trivial—agents must **observe carefully, communicate, and adapt** to succeed."
}