{
  "id": 1092,
  "raw": "\nRetrieved from http://www.tvguide.com/News/Griffin-Dunne-House-Lies-1034460.aspx\nText:\nGriffin Dunne\n\nGriffin Dunne, who will appear on the upcoming season of Damages, has joined Showtime's upcoming House of Lies, according to The Hollywood Reporter.\n\nBased on Martin Kihn's tell-all House of Lies: How Management Consultants Steal Your Watch and Tell You the Time, the dark comedy stars Don Cheadle as Marty, a cutthroat consultant who uses any means necessary to procure information for his clients. Dunne will play a renowned consultant who teams up with Marty's firm.\n\nVIDEO: Season 4 Damages trailers bring naked terror\n\nHe joins former Veronica Mars star Kristen Bell who stars as Jeannie Van Der Hooven, a bright Ivy League graduate at the firm.\n\nDunne played a judge on the past season of The Good Wife and plays a foreign correspondent on the fourth season of Damages, which premieres on Wednesday, July 13 on DirecTV.\n",
  "response": "### **Overall Scene Theme and Core Concept**  \n\n**Scene Type:** High-Stakes Corporate Consulting Office  \n**Core Concept:** A sleek, high-pressure consulting firm where cutthroat strategists manipulate data, clients, and each other to win lucrative contracts. The environment is a blend of polished corporate aesthetics and chaotic undercurrents—whiteboards filled with ruthless strategies, hidden documents, and the constant hum of power plays.  \n\nThis scene is inherently multi-agent due to:  \n- **Collaborative Problem-Solving:** Teams must parse through dense financial reports, manipulate presentations last-minute, and extract hidden leverage from data.  \n- **Physical & Social Coordination:** Heavy presentation equipment, locked client files, and high-value props (e.g., prototype products) require teamwork to transport or secure.  \n- **Deception & Secrecy:** Hidden compartments, encrypted drives, and private meeting nooks create a need for surveillance and information control.  \n\n---  \n\n### **Spatial Layout and Area Descriptions**  \n\n1. **Main Bullpen (Open-Plan Workspace)**  \n   - A maze of glass-walled cubicles with standing desks, littered with financial models and half-empty espresso cups.  \n   - Large digital dashboards display real-time stock tickers and client KPIs.  \n\n2. **\"War Room\" (Strategy Hub)**  \n   - A soundproofed, windowless chamber with a massive touchscreen table.  \n   - Smudged whiteboards list aggressive tactics like \"Exploit Competitor Weakness – Q3\" and \"Leverage CFO’s Divorce.\"  \n\n3. **Private Office of \"Marty\" (Lead Consultant)**  \n   - Dimly lit, with a vintage globe bar and a wall of framed \"Deal of the Year\" awards.  \n   - A false-bottomed drawer hides burner phones and confidential dossiers.  \n\n4. **Client Showroom (Impressions Room)**  \n   - Minimalist, with a prototype self-driving car on a rotating platform.  \n   - Interactive screens demo \"success simulations\" with doctored metrics.  \n\n5. **Supply Closet (Improvised Spy Nest)**  \n   - Crowded with spare projectors, backup hard drives, and a janitor’s cart (used for discreet document transport).  \n\n6. **Rooftop Lounge (Dealmaking Terrace)**  \n   - Outdoor heaters, a cigar humidor, and a locked briefcase (client bribes?) chained to a lounge chair.  \n\n---  \n\n### **Detailed Area-by-Area Inventory**  \n\n#### **1. Main Bullpen**  \n**a. Anchor Furniture & Installations:**  \n- **Modular Standing Desks (x12):** Adjustable height, embedded wireless chargers, and biometric logins.  \n- **Central Data Tower:** A 2m-tall server node with blinking LEDs, physically housing the firm’s \"black box\" of client secrets.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Project Phoenix\" Files:** A redacted folder (weight: 3kg) in a locked drawer, accessible only via two keycards (held by Marty and Kristen’s character).  \n- **Fraudulent Presentation Slides:** A USB drive (labeled \"BACKUP – DO NOT SHOW\") hidden inside a hollowed-out \"World’s Best Consultant\" mug.  \n\n**c. Functional Ambient Objects:**  \n- **Coffee Robot:** A semi-functional prototype that sporadically spills almond milk.  \n- **Printer:** Jammed, with a crumpled page titled \"Termination List – Draft\" stuck in the tray.  \n\n**d. Background & Decorative Objects:**  \n- **Motivational Posters:** \"ETHICS ARE COSTLY\" in sleek Helvetica.  \n- **Fake Plants:** Dusty, with one fern holding a tucked-away AirTag (tracking a rival consultant?).  \n\n---  \n\n#### **2. \"War Room\"**  \n**a. Anchor Furniture & Installations:**  \n- **Smart Table:** A 3m interactive surface showing a live merger simulation, frozen on \"Hostile Takeover – Phase 3.\"  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Erasable Marker Set:** One marker (red) is actually a voice recorder.  \n- **Weighted \"Decoy\" Documents:** A 10kg binder labeled \"Boring Tax Stuff\" hiding the real client list underneath.  \n\n**c. Functional Ambient Objects:**  \n- **Sound Masker:** A white-noise emitter (humming at 65dB) to foil eavesdropping.  \n\n**d. Background & Decorative Objects:**  \n- **Framed \"Art\":** A fake Rothko hiding a wall safe (biometric scan required).  \n\n---  \n\n### **Scene Affordances and Embedded Potential**  \n\n**Collaborative Transportation Affordances:**  \n- **Prototype Car (Client Showroom):** Requires 4+ agents to rotate the 800kg platform without triggering the motion alarm.  \n- **Data Tower (Bullpen):** The 150kg server node must be lifted by two agents simultaneously to access its emergency shutdown lever.  \n\n**Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:** Among five identical USB drives on the war room table, only one (with a nearly invisible scratch near the port) contains the incriminating files. Agents must ignore the decoy drives in the supply closet.  \n- **Compound Reasoning:** The wall safe requires both Marty’s fingerprint *and* a code written on the back of a business card (currently in the pocket of a jacket hung in the lounge).  \n\n---  \n\n**Final Atmosphere Notes:**  \n- **Sounds:** Muffled arguments behind closed doors, the occasional *click* of a briefcase lock.  \n- **Smells:** Overbrewed coffee, ozone from the overloaded data tower.  \n- **Lights:** Harsh LEDs in the bullpen, dim amber in Marty’s office (the better to hide lies).  \n\nThis environment is a pressure cooker of collaboration, deception, and physical challenges—ripe for AI agents to negotiate, manipulate, and outmaneuver."
}