{
  "id": 1093,
  "raw": "\nRetrieved from http://www.twincities.com/ci_22610944/student-expelled-from-brainerd-nursing-school-facebook-comments?source=rss\nText:\nCraig Keefe was a semester away from finishing his studies to be a registered nurse. Like a lot of college students -- like a lot of Americans -- he was on the social networking site Facebook.\n\nBut in December, officials at Brainerd's Central Lakes College took exception to some of Keefe's posts on his private Facebook page and kicked him out of school.\n\nKeefe says he wasn't told what the problems were with his posts, nor was he told why or how anything he did violated school policy. Angered, he has taken his complaint to court.\n\nIn a lawsuit filed in U.S. District Court, Keefe, 37, of Gull Lake, Minn., says he wants to be reinstated in school and wants damages from the defendants, which include the school's president, Larry Lundblad, a vice president, a dean, the head of the nursing program and the chief executive of the state's college system.\n\nKeefe's attorney, Jordan Kushner of Minneapolis, said school officials never gave Keefe a specific explanation for his expulsion and violated the college's published rules by denying him an appeal.\n\n\nLundblad did not immediately return a call for comment.\n\nThe suit claims school officials complained to Keefe that two of his Facebook posts were \"disturbing.\" One post allegedly used the phrase \"stupid bitch\" and the other was \"a comment about there not being enough whiskey for anger management,\" the complaint alleges.\n\n\n\n\nKushner said Keefe's case differs significantly from that of former University of Minnesota mortuary science student Amanda Tatro, who was disciplined -- but not expelled -- after she posted comments about a cadaver in her anatomy class and made statements school officials considered threatening.\n\nShe sued. Last summer, the Minnesota Supreme Court said the university's action was justified because Tatro violated \"narrowly tailored\" rules involving standards of professional conduct.\n\nThe woman's Facebook posts \"fell within a narrow scope of expression that could be regulated because it pertained to her professional work and violated specific professional standards,\" Kushner said.\n\nHe said that differs from Keefe's case because \"to the best of our knowledge, his 'offending' Facebook posts had nothing to do with his work as a nurse or nursing student. We do not see how the posts could be any of the school's business, and the reasoning of the Tatro case would support this position.\"\n\n\nThe suit says that on Dec. 3, the head of the school's nursing program, Connie Frisch, called Keefe and asked him to attend a meeting with her and another administrator. Frisch is one of the defendants named in the suit.\n\n\"Frisch refused to provide any explanation of the reason for the meeting except that it involved professional boundaries,\" the suit contends. Keefe followed up with an email, asking for more information, and Frisch replied that she preferred \"to review the topic with you in person at that time rather than via phone or email. Please be assured that you do not need to prepare in any way for our meeting.\"\n\nKeefe went to the meeting Dec. 5. Frisch was there, as was Beth Adams, Central Lake's dean of students, and another defendant named by Keefe. Frisch allegedly confronted him about the purported \"stupid bitch\" and \"whiskey\" posts on his Facebook page.\n\n\"She then asked Keefe for an explanation, while refusing to let him see the documents,\" the suit says. \"Keefe stated that the comment about whiskey was a joke, that his Facebook account had been hacked a couple of weeks ago and he had tried to delete comments which had been posted.\"\n\nFrisch then told Keefe they were kicking him out of the program. \"She held up a stack of papers which was allegedly Keefe's entire Facebook page and told him she had read the whole page and found it disturbing,\" the suit says. \"Frisch refused to allow Keefe to see the documents.\"\n\nTwo days later, Keefe got a letter telling him he'd been kicked out for \"behavior unbecoming of the profession and transgression of professional boundaries,\" the suit says.\n\nThe letter told him he had five days to appeal the expulsion to Kelly McCalla, the school's vice president for academic affairs. McCalla also is named as a defendant.\n\nKeefe appealed and asked McCalla why he was being expelled. Keefe says in his suit that McCalla told him he'd provide him with the allegedly disturbing Facebook posts but never did.\n\nThe suit contends that on Jan. 2, McCalla left a voicemail message for Keefe saying that his appeal was denied and that there had been no violation of due process. Keefe responded with an email asking for a contested hearing before an administrative law judge, an option provided for under the college's Student Conduct Code.\n\nThe suit says that several days later, McCalla left another voicemail for Keefe, telling him he wasn't entitled to a contested case hearing or any further appeal because Keefe \"was removed for an 'academic' rather than 'disciplinary' violation under the Conduct Code, and therefore a contested case hearing was inapplicable.\"\n\nIn an interview, Kushner said that because Central Lake's nursing program isn't accredited, Keefe can't transfer his credits to another school to finish his studies and become a registered nurse.\n\n\nThe fifth person named as a defendant is Steven Rosenstone, chancellor and chief executive of Minnesota State Colleges and Universities, the statewide system that Central Lakes College is part of.\n\nThe suit accuses the defendants of conspiring to violate Keefe's constitutional rights to privacy, free speech and due process. It also says that when they accessed his private Facebook account, they violated his Fourth Amendment protection against unlawful search and seizure.\n\n\"That's another issue here,\" Kushner said of how the officials got the Facebook posts. \"These are not posts that are open to the public. Apparently, a student complained, and they would not tell him how they got into his Facebook page.\"\n\nThe lawyer said it was possible other students provided administrators with the Facebook pages, \"but we don't know. They wouldn't tell him.\n\n\"They haven't been straight with him about anything in this,\" he said.\n\nDavid Hanners can be reached at 612-338-6516.\n",
  "response": "# **Scene Concept: Nursing School Administration Office & Student Records Room**  \n\n## **1. Overall Scene Theme and Core Concept**  \nThis scene is a **Nursing School Administration Office** combined with an adjacent **Student Records Room**, set in a contentious atmosphere following a student’s controversial expulsion. The environment is **densely layered with bureaucratic paperwork, digital records, and procedural tools**, making it inherently collaborative due to the **need for multi-agent coordination in handling sensitive documents, verifying records, and resolving disputes**.  \n\nThe space is **highly procedural**—some tasks require physical document retrieval, digital cross-referencing, or simultaneous verification between multiple agents. The scene is also **emotionally charged**, with subtle clues (e.g., hastily scribbled notes, a locked \"disciplinary case\" folder) hinting at the underlying conflict described in the inspiration text.  \n\n---  \n\n## **2. Spatial Layout and Area Descriptions**  \nThe environment consists of three interconnected areas:  \n\n1. **Main Administration Office** – A cluttered, high-traffic workspace with desks, file cabinets, and a reception counter.  \n2. **Student Records Room** – A secured side room with filing cabinets, a locked safe for disciplinary records, and a networked computer terminal.  \n3. **Dean’s Private Office** – A smaller, more organized space with a meeting table, a locked drawer containing expulsion letters, and a whiteboard with case notes.  \n\n---  \n\n## **3. Detailed Area-by-Area Inventory**  \n\n### **Main Administration Office**  \n\n#### **a. Anchor Furniture & Installations**  \n- **Reception Counter (L-shaped, 2.5m long)** – Scuffed laminate surface with a sign-in sheet, a small bell, and a security badge scanner (flashing red, awaiting swipe).  \n- **Two Heavy Steel File Cabinets (1.8m tall, 80kg each)** – One labeled \"Active Student Files,\" the other \"Disciplinary Actions – Restricted Access.\" The latter has a **physical lock** requiring a key.  \n- **Administrative Desk (2m wide, clutter-heavy)** – Computer monitor displaying a login screen, a mug labeled \"World’s Best Dean\" (cold coffee inside), and a **stack of printed Facebook posts** (paperclipped, with highlighted sections).  \n\n#### **b. Key Interactive & Task-Relevant Objects**  \n- **Disciplinary Case Folder (thick, red \"CONFIDENTIAL\" stamp)** – Placed haphazardly on the desk, containing **handwritten notes** (\"Keefe – FB posts – no due process?\").  \n- **Keycard (worn, clipped to a lanyard)** – Hanging on a hook near the Records Room door. Required for access.  \n- **Fax Machine (out of paper, blinking error light)** – A half-sent document (\"APPEAL DENIED – McCalla\") jammed in the tray.  \n\n#### **c. Functional Ambient Objects**  \n- **Printer (HP LaserJet, low toner)** – Stack of blank appeal forms beside it.  \n- **Landline Phone (call log showing missed calls from \"Kushner, J.\")**  \n- **Wheeled Office Chair (one wheel squeaks loudly when moved)**  \n\n#### **d. Background & Decorative Objects**  \n- **Notice Board (crowded with outdated memos)** – One pinned note: \"Remember: Social Media Policy Review – MONDAY.\"  \n- **Dying Pothos Plant (yellowing leaves, overwatered)** – In a chipped \"Nurses Save Lives\" mug.  \n- **Coffee Stain (dried, circular)** – On the desk near the disciplinary folder.  \n\n---  \n\n### **Student Records Room**  \n\n#### **a. Anchor Furniture & Installations**  \n- **Secure Filing Cabinet (1.5m tall, biometric lock)** – Contains **student expulsion records**.  \n- **Computer Terminal (logged into the school database, screensaver on)** – Requires a password to wake.  \n- **Locked Safe (small, wall-mounted)** – Holds **original signed expulsion letters**.  \n\n#### **b. Key Interactive & Task-Relevant Objects**  \n- **USB Drive (left plugged into the terminal)** – Labeled \"FB Evidence – Keefe Case.\"  \n- **Master Key (hidden under a stack of blank forms)** – Opens the disciplinary file cabinet in the main office.  \n\n#### **c. Functional Ambient Objects**  \n- **Document Scanner (dusty, unused)** – Error message: \"Driver not installed.\"  \n- **Shredder (partially full)** – A torn corner of a Facebook post visible in the bin.  \n\n#### **d. Background & Decorative Objects**  \n- **Framed Nursing School Accreditation Certificate (slightly crooked)** – Expiration date: \"2022.\"  \n- **Dusty Box of Discontinued Student Handbooks** – Labeled \"Old Policy – Do Not Distribute.\"  \n\n---  \n\n### **Dean’s Private Office**  \n\n#### **a. Anchor Furniture & Installations**  \n- **Executive Desk (dark wood, locked drawer)** – Key kept in a false-bottomed pencil holder.  \n- **Meeting Table (scratched surface, four chairs)** – One chair slightly pulled out, as if someone left in a hurry.  \n\n#### **b. Key Interactive & Task-Relevant Objects**  \n- **Expulsion Letter Draft (hand-edited)** – On the desk, with a line crossed out: \"~~violation of professional boundaries~~ → academic violation.\"  \n- **Whiteboard (scribbled names: \"Keefe,\" \"Tatro case,\" \"Supreme Court ruling?\")**  \n\n#### **c. Functional Ambient Objects**  \n- **Landline with Speakerphone (muted, blinking hold light)**  \n- **Laptop (sleep mode, password-protected)**  \n\n#### **d. Background & Decorative Objects**  \n- **Fake Plant (plastic, unnaturally green)**  \n- **\"Employee of the Month\" Plaque (dated two years ago)**  \n\n---  \n\n## **4. Scene Affordances and Embedded Potential**  \n\n### **Collaborative Transportation Affordances**  \n- **Heavy File Cabinet (80kg, requires two agents to move)** – Contains critical student records.  \n- **Secure Safe (wall-mounted, requires one agent to hold a ladder while another unlocks it)** – Holds original expulsion documents.  \n\n### **Reasoning and Tool-Use Affordances**  \n- **Attribute-Based Reasoning:** Among **five USB drives** on the desk, only **one (labeled \"FB Evidence\")** has a **scratched-off serial number and a red cap**, distinguishing it from the others.  \n- **Compound Reasoning:** The **locked disciplinary file cabinet** requires the **master key hidden under forms in the Records Room**, which itself is accessed via a **keycard left at reception**.  \n\n### **Dynamic Problem-Solving**  \n- The **fax machine error** requires agents to **manually feed paper** while another **retrieves the original document from the Dean’s locked drawer**.  \n- The **computer terminal** is logged in but **on screensaver**, forcing agents to **find the password** (written on a sticky note under the keyboard).  \n\n---  \n\n### **Final Notes on Potential Task Generation**  \nThis scene is **designed for procedural, legal, and ethical reasoning**:  \n- **Verifying expulsion legitimacy** by cross-referencing digital and physical records.  \n- **Retrieving \"lost\" evidence** (e.g., the USB drive, the original Facebook printouts).  \n- **Bypassing bureaucratic obstacles** (e.g., locked drawers, missing appeal forms).  \n\nThe **density of documents, conflicting records, and embedded secrecy** ensures that agents must collaborate to **uncover the truth**—mirroring the real-world dispute in the inspiration text."
}