{
  "id": 1107,
  "raw": "\nRetrieved from http://edition.cnn.com/TRANSCRIPTS/1109/07/qmb.01.html\nText:\nReturn to Transcripts main page\n\n\nGerman High Court Rules Greek Bailout Legal; Italy's Parliament Votes to Enact Austerity Measures\n\nAired September 7, 2011 - 14:00   ET\n\n\nRICHARD QUEST, CNN ANCHOR, QUEST MEANS BUSINESS: It's a huge leap forward. Germany rejects a challenge to bailouts.\n\nThe net effect of a falling share price. Yahoo!'s chief executive fired.\n\nAnd a taxing issue. Some of the top minds economics say Britain's 50 P rate does more harm than good.\n\nI'm Richard Quest. I mean business.\n\nGood evening.\n\nToday we are seeing signs of political will to deal with economic challenges. And the results are being seen in the market. Italy, Germany, Greece, all took steps today to deal with their problems. And you are seeing what's happened. Take a look at the Doe Jones.\n\n\nDo that properly. Take a look at the Dow Jones in New York, up 217. A strong robust session, not only on the back of what's happening in Europe but also, of course, on the prospect of what President Obama will say tomorrow and U.S. matters; a gain of nearly 2 percent for the market.\n\nIn Europe stocks were up extremely sharply. The DAX saw the best of the day. Up 4 percent. With the FTSE up also up 3 percent; big gains bouncing back from a two-year low.\n\nSo what was behind it all? Very simply, where there is a will, there is a way. Eurozone politicians facing a battle on the home front, as country, by country, they are now getting to grips with the debt crisis. Or at least that is the way things seem for the moment. The fundamentals are shaking. But without the political will Europe doesn't stand a chance. And that is our focus at least at the start here tonight.\n\nJoin me in the library as we go through them. Let's start with Angela Merkel, in Germany. Now forget yesterday's or the weekend's dreadful results for her in the local elections. There was a Germany court ruling today from the constitutional court that basically said the bailout to Greece was legal. In certain circumstance, it said, it is possible for the chancellor to give these monies to other countries. Angela Merkel made it a call to arms speech in parliament. The message was simple and clear. The euro must be defended at all costs.\n\n\nANGELA MERKEL, CHANCELLOR OF GERMANY (through translator): The euro is a guarantee of unified Europe, or to put it differently, if the euro failed, Europe failed. And because a democratic and free Europe is our home, the euro must not be allowed to fail. And it will not fail.\n\n\nQUEST: So the DAX is up 4 percent and stocks like BMW really were very strongly. And indeed, German industrial production was up very strongly as well.\n\nThe Greek austerity plan: Greek stocks were up 8 percent. Largely, partly, because their money is secure from the German constitutional court decision, even though parliament has the vote. But Greece is now promising no more twiddling of thumbs. The Finance Minister Venizelos, has hit the turbo button. There will be pledges on faster privatization, more public sector caps, the troika of the IMF, the EC and the ECB, has been unhappy, but now Greek austerity is once again getting serious.\n\nItaly austerity bill faces a confidence vote, which is set tonight, in Rome; 76 billion in cuts. You know the problem. It has been a flip- floppery, flip-flopperoo. From the prime minister, as they have gone backwards and forwards, but now it seems that Italy is about to make the decision on what is to be decided.\n\nStephen Pope joins me now. The managing partner of the Spotlight Ideas analyst's group.\n\nStephen, good to have you with us tonight.\n\nDo you get the feeling-do you get the feeling that Europe is at last getting to grips? Or is this just all smoke and mirrors?\n\nSTEPHEN POPE, MANAGING PARTNER, SPOTLIGHT IDEAS: No, this political will that we are seeing demonstrated today is being driving by the realities of the come (ph) through from the marketplace.\n\nGermany recognizes that 40 percent of their exports go into the Eurozone. So if they there were no euro a new deutsche mark would accelerate in the same way we see the Swiss franc. It would ruin Germany industry. If you take the Greeks they know now that they can't sort of fiddle around and sort of fudge anymore because the paymasters won't tolerate dalliance on the austerity measures. And In Italy, would Berlusconi have acted with austerity if the markets had not pushed his bond yields above 6 percent. The answer is no. But now we have to see him deliver and stop tinkering with this 45 billion budget cut that he needs to make.\n\nQUEST: Which begs the question: Is it temporary, this political will? I mean, what could blow it off course?\n\nPOPE: I think what you will see is that behind all of this, the timing of the electoral cycle in each given nation plays a major part. Now, I think what you will find is that if the market suddenly decides that there is some watering down of the austerity program in Greece, suddenly you'll pressure upon their yields. Can the ECB go and buy my bonds? They have already bought 30 billion euros of Italian bonds. If you start seeing any backtracking in Greece, because they are not effective at calculating taxes or imposing cuts, then the markets will react once again.\n\nQUEST: But we have the Dow up 200 points today. We have President Obama speaking tomorrow. And in many ways the U.S. is still the big problem. Because of its failure to grapple with the political un-will and the deficit.\n\nPOPE: Yes, I mean, there again, you saw the classic example trying to raise the debt ceiling of playing politics, right to the wire, once again before they finally found a way to raise the debt ceiling so no U.S. default. Now, what we are going to have tomorrow is this big program. But is it going to create jobs? Government cannot create jobs. They do not create wealth. It has to be private sector allowances.\n\nQUEST: So, finally, are you-as you look tonight, and I read lots of your comments, and your daily e-mail. Are you more confident that Europe's governments are getting grips? Or cynical?\n\nPOPE: They are getting to grips because they have to. But I remain the ultimate cynic, because I think this is a passing wind-\n\nQUEST: Ah, come on.\n\nPOPE: Passing the fairs (ph).\n\nQUEST: Really?\n\nPOPE: Yes.\n\nQUEST: It doesn't bode well, for the rest of the month.\n\nPOPE: Well, we will have a reaction to this, Germany speaking, it is always a reaction after the event.\n\nQUEST: Stephen, many thanks, indeed. We'll talk more about this in the weeks ahead.\n\nNow, Europe's current climate isn't hampering its strongest economies, when it comes to competitiveness. Despite currency concerns, Switzerland- Switzerland, yes, tops the World Economic Forum's latest rankings. It followed Singapore in the top four, and Sweden and Finland. Worryingly, the United States is down for the third year in a row, slipping one place, to fifth. The report says concerns about government inefficiency and a lack of public trust in American politicians. It is the third year in a row, as I say, that the U.S. has fallen back.\n\nSixth place Germany dropped one spot as well. The WEF noted, reforms will be key to revitalizing growth.\n\nI asked the World Economic Forum's managing director, Robert Greenhill, how important political will is, to continue our theme, when it comes to improving a country's competitiveness?\n\n\nROBERT GREENHILL, MANAGING DIRECTOR, WORLD ECONOMIC FORUM: The issue of courageous leadership, to stick to these key competitive issues right now, is probably more important now than ever. If you look at Greece, if we look at some of the tougher areas in the Eurozone crisis, it will be a real test. When you look at some of the issues of the United States, the willingness of Congress to address some of these core economic and fiscal issues, is likely to be critical to where the United States ends up in the next few years.\n\nQUEST: Would you say that when you look at the competitiveness index, and the relationship to it, the importance of political will cannot be overstated, because the absence of it affects everything else, particularly the way society regards its future.\n\nGREENHILL: Absolutely true. And that is the challenge today, as I said, when you look at the politicians in many of the countries today, they are shaken by the economic news, but they haven't been moved to the actual action, or stirred to the action they really need to address these issues.\n\nQUEST: I can think particularly of Europe, where we have had two to three years of talk, summits, communiques, agreements, and yet we are still in this situation that we are in now.\n\nGREENHILL: Look at Germany, from a positive point of view? The last 10 years they have put in place some very structural reforms in their labor markets, in their fiscal situation, so in fact, the core of Europe, in this economy, is actually quite strong now. Stronger than it was five years ago.\n\nThe elements that are being put in place in Spain, in Italy, in Greece, in Portugal, in Ireland, are probably the right policies. So the good news is the issues have been identified and are starting to be addressed. The question is can it be done in time to restore the confidence necessary.\n\nQUEST: If you are right, and there is no reason to believe you are not, what has gone wrong for the United States?\n\nGREENHILL: Well, in a sense, while they are doing very well on things sophisticated business, great universities, they are missing on the basics. Their physical infrastructure isn't as good as other countries. Their investment in primary and secondary education isn't good. And actually the trust in government and other institutions has dropped a lot. So trust in the effectiveness of politicians, they have dropped from 21st to 50th place in the last few years.\n\nQUEST: But why does it matter? Why does it matter.\n\nGREENHILL: Well, it matters a lot in terms of whether the government is seen as being an effective partner in the development when companies are looking at where they are going to invest around the world. If we look at what recently happened with the challenge around the debt ceiling and in Congress. That was a great example of where people no longer trust that the system works. The challenge is that it is not clear that politicians yet reacted to any kind of shaken by the news, but not yet stirred to action.\n\nQUEST: All right. And if we look within the European Union countries, as well.\n\n\nQUEST: I mean, again, they are middling around. France moved quite a bit.\n\n\nQUEST: But frankly, the U.K., and Germany, and it didn't move much, one place in either direction.\n\nGREENHILL: Well, the interesting thing about-there is almost two Europes. You actually have the ones on the periphery, the Italys, the Spains, the Portugals, who are very weak competitors (ph). But you have the core, the Nordic nations and Germany, that are actually doing well, and improving. And that is a good sign for Europe at a time when people are wondering if it can hold together.\n\n\nQUEST: The question of competitiveness and the political will moving forward.\n\nIn a moment, imagine expanding your business from two countries to more than 40, and you do so in a little more than a week. The Netflix founder Reed Hastings, who has taken his movie streaming business beyond North America. After the break, QUEST MEANS BUSINESS, good evening.\n\n\nQUEST: The online move and TV provider that dominates the American market is now going south of the border. This week Netflix introduced its streaming service in Brazil as part of a push into Latin America. It will include more than 40 countries over the next few days. It is a big challenge, no doubt. Before we hear from the chief executive and we hear about Netflix, I need to tell you we were talking a moment ago about the Italy report.\n\nItaly's senate has approved the government austerity package.\n\n\nIt has just been announced in Rome. That is the package that increases VAT, it includes the wealth act, it alters the retirement age, amongst many other things. But Italy's senate has now approved the government austerity package, which has just happened. We'll get more details on that.\n\nWhile we wait to get more details, returning to Netflix. So, Netflix has expanded into Latin and Central America. As Felicia Taylor reports, the company's founder has defied the critics.\n\n\nFELICIA TAYLOR, CNN BUSINESS CORRESPONDENT (voice over): Once the nerve center of Netflix's thriving empire, DVD mail order centers like this one are now giving way to online streaming for its 25 million subscribers.\n\nADAM HANFT, BRAND STRATEGIST: Netflix has had an incredible run in the last couple of years. It wasn't long ago when every analyst was saying to write Netflix off, because it would never be able to pivot their business. But they defied all odds and they really navigated that transition beautifully. They've got a lot of content. They made a lot of streaming deals.\n\nTAYLOR: At the helm is this man, CEO Reed Hastings, who founded the company after being charged $40 for a late DVD. And industry pioneer, he was named \"Business Person of the Year\" by \"Fortune\" magazine.\n\nHANFT: He is a classic entrepreneurial, driven founder, who loves his business. Eats, drinks, sleeps, breathes the business. And is thinking about the business in some innovative ways.\n\nTAYLOR: But now, the company has hit a roadblock.\n\nJOHNNY DEPP, AS CAPTAIN JACK SPARROW: There should be a captain in there somewhere.\n\nTAYLOR: Negotiations with Starz, the provider of Disney and Sony content have broken down, leaving questions over future deals. It comes as the firm launches in Brazil, the first stage in an ambitious plan to expand into Latin America.\n\n\nQUEST: Felicia Taylor reporting there. And I've just received and e- mail from Jorge Balatan (ph), who tells me that Netflix is in Argentina since today. Well, as Netflix embarks on that expansion there will be new challenges. It will have to contend with patchy broadband in some areas, and established competitors in others. As you just saw, the company founder, Reed Hastings, has overcome obstacles before. And I asked him, what sets his service apart, if anything?\n\n\nREED HASTINGS, FOUNDER, CEO, NETFLIX: You know we focused on steaming from the very beginning. And so we have developed lots of very specialized technology for to make the streaming experience great over various bandwidths. We have also invested heavily in our partnership with Samsung and LG and Sony, to be built right into the smart TV. So we are very focused on this.\n\nBut you know, in the United States, as an example, us and our competitors are all growing. So broadband creates such a big opportunity for online video that I think all the companies in Latin America and Brazil are going to continue to grow.\n\nQUEST: We can't mention Netflix, you can't Google Netflix, you can't Google your name on Netflix, at the moment without seeing the naysayers and doomsayers telling me that the loss of the Starz contract on content is going to be your Achilles' heel, and you may as well switch the lights off.\n\nHASTINGS: You know, that is the great thing about the news, you want to hear contrary opinions. The Starz deal is only in the United States and it is less than 10 percent of our content. So, you know, it is something, but it is not a huge deal. And we are actively working to replace that content by next March, when the Starz content goes off. So we are feeling great about that and our ability to replace it. And again, that is in the United States only.\n\nQUEST: Who has the whip hand in all of this? Is it the content providers, who have the material that you so badly want and demand, or is it yourselves as the distributors, because let's face it, fewer of us are going to movies and we are watching more at home. I'm trying to decide-I can't decide.\n\n\nWho actually is in the driving seat here?\n\nHASTINGS: Well, I'd say the content owners are really in the driving seat. We put forth offers to license that content for millions of dollars per year. And then it is up to them if they have a better offer or want to accept our offer. So mostly it is us making offers to them.\n\nQUEST: When do you trans-Atlantic? When do you go to Europe? Which is a much more closed environment in many countries; it is a more regulated environment. And some would say it is a much more expensive environment to do business in.\n\nHASTINGS: You know there is great opportunity for streaming and online video, really, around the world. We haven't figured out the exact timing. We are working on that now. But over the next two to four years we want to offer our service anywhere in the world. So we are figuring that out, country by country.\n\nQUEST: Final question to you, Reed, on a big, big picture thought, if you like. The Internet is so much of a global marketplace. Do you get frustrated by national boundaries that prevents me, in the U.K., from accessing your site?\n\nHASTINGS: The opportunity ahead, as the Internet, as you said, as a global medium, is really amazing. Because more and more subscribers are going to be able to access content, anywhere in the globe. They will pay for a Netflix subscription, a very modest fee, and with that be able to access content. And so, bit by bit, the world coming together, getting more interconnected through services like Netflix that eventually offer a fully global service.\n\n\nQUEST: Reed Hastings of Netflix, who was joining me then, from San Paolo.\n\nSome news coming into CNN. There have been strong tremors that have been felt in New Delhi, in India, by residents. Our sister network, IBN, affiliate network, in India, says a magnitude 6.6 quake appears to have hit in New Delhi. We are waiting for more information. Any pictures, any damage, all of those sort of things, which will come in the next few moments. And we will bring you-or I'll bring you and update you, the moment some more details-the tremors, apparently, although they were felt in New Delhi, were also felt in Kashmir Province and Utra Province, as well.\n\nNow, when we return, we are going to return to a very naughty, thorny, controversial subject. What is the right amount of tax in a time of economic crisis? A leading economist tells us why Britain's 50 pence tax rate should be scrapped, in a moment.\n\n\nQUEST: Now, that is a 50 pence piece. A battle is brewing in the United Kingdom over the 50 percent tax rate. That was introduced by the last Labour government and it has been confirmed by the current conservative coalition government. The tax rate of 50 percent remains for anybody earning over 150,000 pounds a year. It's about $225,000, $230,000 a year.\n\nNow in a letter to the \"Financial Times\", 20 leading economists have called for the 50 pence rate to be scrapped. Saying it damages Britain's competitiveness. Professor Keith Pilbeam is a professor of economics at City University in London. He helped, and wrote the letter, and signed it. He told me why 50 pence isn't working.\n\n\nKEITH PILBEAM, ECONOMICS PROFESSOR, CITY UNIVERSITY, LONDON: I actually want to create jobs in this country. And it is a globally competitive economy now. And you send a very bad signal to the rest of the world, even when you have a 50 percent tax rate it is up there with the Belgiums and the Netherlands of this world. And, you know, Switzerland offers them 11 percent, well, that is far too low, in my view.\n\nSo, you know, you deter people coming into the country. And they bring in money and jobs for the rest of us.\n\nQUEST: If you do reduce the 50 pence, the majority of people who would benefit would be the high-paid professionals, the city workers, the lawyers, the accountants.\n\nPILBEAM: Yes. That is probably the case. But also there are many entrepreneurs that earn 400,000, 300,000 a year, that actually have 50 employees. And if they decide to go out of this country because they don't like the tax rate, not only are we not getting their taxes, we are-you know, we have 50 people who loose their jobs. And they are unemployed and the tax rate goes up for the rest of us.\n\nQUEST: The TUC has not surprisingly said that what you are suggesting is monstrous at a time of cut backs and hacking back on things like health and the provision of social services. You can certainly see that your idea is poor politics.\n\nPILBEAM: I'm not a politician, I'm an economist. And I'm trying to look at the medium to long-term prospects of this economy. And yes, in the short-term we might get a few extra pound out of it. But in the medium to long-term we send out an extremely bad signal to the rest of world, don't come to Britain, we'll tax you. And if these executives-do you think a Japanese executive wants to come here and pay 50 percent tax and put factories in this country, when they have to be subject to 50 percent. I don't think so.\n\nQUEST: The government has said it is temporary. Or George Osborne said it was temporary. The last Labour government said it was an emergency measure. If I understand, or I'm guessing, forgive me. But you probably think what is temporary often becomes permanent.\n\nPILBEAM: Not only that, not only will it become permanent, but also, you know, it is affecting us now. Investment is actually falling. People are not investing in Britain. And we need investment because we haven't got the domestic demand, at the moment from, you know, the domestic economy is suffering.\n\nQUEST: I was reading many of the blogs and the Web sites, and not surprisingly your idea is completely and utterly excoriated as being, you know, a bastion for the rich. But I suspect you, and the other authors of this letter knew that when you wrote it.\n\nPILBEAM: Yes, but I don't justify bankers salaries, yet there are bankers salaries are too high. Yet, that is a separate issue from the taxation issue. We mustn't get into the politics of envy.\n\nQUEST: All right. So, the politics of envy, fine. But finally, why did you decide to pop your head over the parapet on an issue like this that is so clearly unpopular and not going to win you any friends?\n\nPILBEAM: Well, because I actually think we need to create jobs and people need jobs in the British economy at this moment. And if we deter the decision makers, you know, that make for decisions, that can put that investment in Britain. And we send them a signal, don' come here. Then everyone is going to suffer; You, me, and everybody.\n\n\nQUEST: Professor Pilbeam, we are making sure of course, I got the 50 pence piece before anybody else managed to steal it around here.\n\nThe head of Starbucks says more than 100,000 people have joined his campaign to force U.S. politicians to stop squabbling and deal with the national debt. Howard Schulz previously called on Americans to stop donating to politicians until the deficit problem was dealt with. He held an open phone conversation with thousands of people last night in the U.S. And this morning he spoke to our good friend, CNN's Ali Velshi about the crusade.\n\nHOWARD SCHULTZ, CEO, STARBUCKS: There is something wrong in Washington. And when we look at what happened with the debt debacle. And we look at the fractured of confidence that exists in American, and now around the world, as a result of the leadership in Washington. We have to ask our selves a question, and that is: are these people really there and representing the values and a direction of the country that we think is best for us.\n\nLast night we had 100,00 people across the country, on a telephone conference call.\n\nALI VELSHI, CNN ANCHOR: This was an online-a call that you-\n\n\nVELSHI: -were part of?\n\nSCHULTZ: Yes, 100,000 people. It is not just 140 CEOs that have signed. We are getting thousands of people who are trying to say, listen, we are better than this. There is a fracturing of trust and confidence. There is a crisis in America. It is not-it is no longer a situation where we can just sit by and allow Washington-\n\nVELSHI: But you are taking a moderate position.\n\n\nVELSHI: When in fact, typically, corporations have backed positions to lobby for something that is a special interest. I mean, can you get to a point where you compete with that? There are still more CEOs working to keep that gridlock that we have in Washington going?\n\nSCHULTZ: Well, the point is this. That what we are watching is a situation in which ideology is the rule of the day.\n\n\nSCHULTZ: And what I'm saying, and I think a lot of people are feeling is, this is more about citizenship than partisanship, than any other time in our history.\n\nVELSHI: Uh-huh?\n\nSCHULTZ: And as a result of that we need Congress and the administration to reach a long-term deal. And we have to have a laser focus on job creation and growing the economy in America.\n\n\nQUEST: That is Howard Schultz of Starbucks. Continuing our theme tonight of political will. Twitter gives us all a chance to weigh in. For \"Tweets From The Top\" we hear the political will and we have gone straight to the top.\n\nSo first of all, Nouriel Roubini, the economist and NYU professor, has the Tweeted today.\n\n\"Battle underway for soul of United States of Europe.\" Controversially, of course, United States of Europe, but he's a controversial professor.\n\nJeff Joerres is the chairman of Manpower, the group Tweets: \"Has been a challenging few weeks for jobs market companies still seek people with right blend of tech and soft skills.\" We talked about that on our program last night.\n\nAnd finally, Carl Bildt is Sweden's foreign minister. He Tweets quite a lot, our dear ol' Carl Bildt. \"Sweden replaces U.S. as world's second most competitive economy, according to WEF.\" We reported on that. \"Great! Our task now is to make it last in a fast-changing world.\"\n\nOh, I see, not to make Sweden last, but to make it last.\n\nYou see the difference?\n\nRead that the wrong way around and you really could end up in a very nasty mess.\n\nTweets from the Top of this program.\n\nIf you want to chat with me on Twitter, it is That's where you and I have our dialogue.\n\nSome of the world's brightest minds are gathering to fight one of the world's darkest problems. CNN's Freedom Project will look at the anti- slavery summit as an enlightening location.\n\n\nGood evening.\n\n\nQUEST: Hello. I'm Richard Quest, QUEST MEANS BUSINESS.\n\n\nAnd the breaking news that I was telling you a moment or two from India, CNN's sister network, IBN, is reporting an earthquake in New Delhi. It's a 4.2 magnitude earthquake that was felt in the Indian capital a few months ago.\n\nTremors have been felt in Kashmir Province and many further places away. We are waiting for further news of any injuries or damages to buildings.\n\nBut let's get some anecdotal reporting.\n\nSumnima Udas is our CNN producer in Delhi and joins me on the line now -- Sumnima, tell me, what -- I suppose, what happened?\n\nWhat did it feel like?\n\nHow bad was it?\n\n\nYes, it was actually quite major. I mean all my cabinets here in my apartment shook. My statues on the windows shook. Everyone sort of ran out as soon as it happened. I saw all my neighbors running down outside and we were just sort of waiting around, wondering what was going on.\n\nAnd, you know, there was a bomb blast this morning. So -- so a lot of people thought maybe it's another explosion. We weren't really quite sure about what I was. But then eventually, we all walked back in and turned on the television. And we were told it was an earthquake.\n\nOriginally, our sister network was saying that it was a 6.6 Richter scale. But now the Metropolin -- Metropolitan Department here has told IBN that it's actually on a 4.2 on the Richter scale.\n\nQUEST: Right.\n\nUDAS: And it's tremors were felt as far away as in Kashmir.\n\nBut in Delhi, it's, you know, it rocked Delhi mostly. Right now, we don't know if there's been any injuries so far.\n\nQUEST: All right. OK. Refresh my mystery, if you would, please.\n\nIs this particularly prevalent?\n\nDo you get many of these tremors frequently?\n\nUDAS: Well, Delhi is actually on a high seismic zone. But to be honest, we haven't felt anything like this in the past few years. But it has happened in Kashmir before, even at Uttarakhand, which is a neighboring state, but not in Delhi, at least not so big.\n\nQUEST: All right. Sumnima, where we have more to report, when you're getting some details of the damage or casualties, come back immediately, please, and we'll talk more about it.\n\nThe other main headlines this hour.\n\nIndian police are working to chase down leads after a briefcase bomb at the Delhi High Court. Sumnima was just referring to that a moment ago.\n\nSketches have been released of the suspects based on eyewitness descriptions. Claims of responsibility have been received from an Islamic extremist group, which are being investigated. Eleven people were killed, 76 were wounded.\n\nAt least 43 people have been killed in a plane crash at Russia's Yaroslavl Airport and many of them were hockey players. Two people survived and are in intensive care. The plane was carrying a Russian hockey team to Belarus. A Russian aviation official says the plane didn't reach altitude fast enough after taking off.\n\nAs the smoke clears in Tripoli, warehouses full of empty boxes like these are being found. They used to contain powerful Russian-made surface to air missiles. And now those missiles are unaccounted for.\n\nThe advocy -- advocacy group, Human Rights Watch, says it's worried that looted weapons could fall into the wrong hands.\n\nFormer Egyptian President Hosni Mubarak is back in court. The ailing 83 -year-old former Egyptian president was wheeled into the Cairo courtroom. He's accused of ordering the killing of protesters. Egypt's military leader and other top Egyptian figures will testify next week. It will be behind closed doors, a part of the trial.\n\nShares in Yahoo! are up more than 5 percent today, as investors breathe that little sigh of relief. The chief executive, Carol Bartz, was unceremoniously fired.\n\nThe Internet company supposedly used old school technology to break the news. In an e-mail to staff, Bartz said she was fired over the phone.\n\nMiss Bartz herself chose to inform colleagues of her departure through her iPad. She leaves after failing to turn the company around. The company's share prices failed to recover to levels it sought in a botched buyout deal with Microsoft some years ago.\n\nShareholders said the company risked the exodus of talent if Bartz stayed in place. That is the situation. Yahoo!, Google, Facebook and the inability of Carol Bartz to perhaps translate and transmit Yahoo!'s vision. Yahoo! had taken a battering from all corners since the deal. Its market cap in more than eight times smaller than Google. And, of course, its been long overtaken by sites like Facebook, which I hear it once tried to actually buy for a billion dollars back in 2006.\n\nWhere we have these sorts of stories, we need to hear from Shelly Palmer, who makes good sense on these sort of issues.\n\nAnd Shelly is in Los Angeles, where, good lord, it's -- it's a little on the early side.\n\nBut, Shelly, good to have you with us.\n\nShould Carol Bartz have been surprised that she was shown the door?\n\n\nI think you have to ask Carol if she was surprised. I don't think she should have been. The only persons who probably should have been let go in advance of this were the entre board, as well. It's just the most ineffective board I've seen in a major company.\n\nAnd Carol Bartz being shown the door, that's -- it's a little -- it's too little and too late, Richard. They've had a...\n\nQUEST: All right...\n\nPALMER: -- they've gone, I think the high of the stock was around $33 a share. It's down, what was it, $13 this morning, off about...\n\nQUEST: Well...\n\nPALMER: -- 6 percent?\n\nQUEST: But Shelly, Shelly, let me ask you, did she do anything -- I mean, did she get fired because she didn't do anything well, because she didn't do anything at all or because she's just carrying the can for a board that's bordering on incompetence, in your view?\n\nPALMER: Can I choose all the above?\n\n\nQUEST: Of course you can.\n\nPALMER: OK. I choose all the above then. I think, look, I -- I like Carol Bartz personally. I think she's a wonderful human being. I think she's been a fairly ineffective CEO. Her vision for the company, well, there is no vision for the company. By the way, second only to the board's lack of vision for the company.\n\nSo, yes, this is a company in huge trouble with a massive identity crisis, a massive identity crisis. And they have to do something to get the Street to understand that something good will happen.\n\nI've got to tell you, you -- you know the Street loved it. The Street, it took it up 5, 6 percent immediately. Everybody thinks that with some new blood in there, this is going to be a -- a better Yahoo!.\n\nQUEST: OK. But is Yahoo! -- I mean, look, I -- and I can feel the Yahoo! management about to flame me with e-mails and with -- you know, with criticisms.\n\nBut who uses Yahoo! and what do they use it for?\n\n\nQUEST: I mean, you know, not -- look, I'm not saying...\n\n\nQUEST: No, I'm not being rude here. You know, it's like...\n\n\nQUEST: -- you know what I'm saying here.\n\nPALMER: I do. By the way, Their finance...\n\nQUEST: Great. Yes.\n\nPALMER: -- content is awesome. All right, they -- there are some little pockets of Yahoo! that are truly fantastic. And what they have not been able to do is take the places where they're really strong and make them stronger and go out of the businesses that they shouldn't be in. They've had no good way of separating the wheat from the chafe...\n\nQUEST: All right.\n\nPALMER: -- and you know what, it's finally -- it's weighing them down.\n\nQUEST: Right. Well, thank you for reminding me. I -- I happen to agree, Yahoo! Finance, excellent for graphs and -- and interactive stuff. You're quite right to remind me.\n\nA quick final question. AT&T and T-Mobile and the Justice Department. A judge says that he's going to hear submissions on this. You're -- you're always on -- you're -- you're never on the fence on these things.\n\nDoes this feel collapse?\n\nPALMER: I -- sadly, I think this deal is going to be so skewered by DOJ that it's not going to be worth doing. I hope it doesn't go that way, but it looks, unfortunately, like the two -- and by the way, DOJ is not the only problem, Richard. The FCC isn't really happy about this, either. Julius Genachowski is not that interested in having a two horse race.\n\nSo I fear that this deal is -- is close to dead, if not actually dead.\n\nQUEST: Somebody is sending you an e-mail or a text or you're just getting a message.\n\nShelly Palmer, we thank you for joining us.\n\nShelly joining us from Los Angeles.\n\nHow can technology be used to fight human trafficking?\n\nIt's the question technology leaders, including Twitter founder, Jack Dorsey, will try to answer in an anti-slavery forum in Silicon Valley next month.\n\nSteven Rice from Juniper Networks, the summit host, joins me now from Sunnyvale, California.\n\nThank you for joining us.\n\nWhat will your fundamental message be for how the summit, how technology, how it can all be made to work to the benefit?\n\n\nWe believe that technology, the technology that Juniper Networks builds around bridging and connecting devices, information and content, and linking that to the work that Not For Sale is doing is absolutely at the heart of how do we start to lead and drive innovation around ending world slavery.\n\nQUEST: All right, Steven, I understand the principle. And I understand what you're saying. And it sounds very good.\n\nBut how are you going to do it?\n\nWhat does it involve?\n\nThat's just words.\n\nRICE: Well, it's -- you know, it's -- it's a movement. And we believe that if you give individuals the power to make choices at a consumer level, that you will make the right choices based on a set of criteria that Not For Sale is driving supply chains around the world, being able to create jobs for individuals in these countries where individuals can actually start to build lives and capabilities that don't exist today.\n\nAnd the form allows spot leaders from this area to come together, talk about not only what's being done today, but also, what are some of those strategies that we can use technology to drive innovation and bring people together in different ways than they've had in the past.\n\nQUEST: Isn't one of the real issues here -- and, you know, CNN's Freedom Project has been going for eight or nine months now. And we've -- and I -- I -- I have tried to tie down numerous CEOs on this issue.\n\nCEOs of manufacturing companies, of different groups, they pay lip service, but they don't want to take a stand. They don't want to come out and be brutal and say this is what we believe in and what we're not going to do.\n\nRICE: And that's why I think that Not For Sale is doing a very grassroots effort, working with companies like Juniper Networks to come in and help us actually survey and understand our supply chains in a new and different way that allows us to actually not only -- allows us to actually walk the talk. And I do think that's the way that Juniper Networks is bridging that, in the way they're approaching that problem, with many manufacturers. I do think it's a breakthrough.\n\nQUEST: Finally, Steven, what's your barometer of success for this summit and for this meeting?\n\nHow are you -- how will you judge whether or not you've actually made a difference?\n\nRICE: I believe that the 1,000 plus individuals that we're bringing to Silicon Valley, in the heart of innovation and creativity, that some of the measures for us are, one, how do we truly appreciate and understand what the global reach and challenges that the world faces today around human trafficking. That's one.\n\nQUEST: All right.\n\nRICE: How do we bring leaders like Archbishop Desmond Tutu, Jack Dorsey from Twitter, Jeremy Affleck, the San Francisco Giants, as well as Sarah Ferguson, Duchess of York...\n\nQUEST: All right...\n\nRICE: -- bringing those individuals together that can actually influence and help drive change that's required across the world.\n\nQUEST: Steven, many thanks for joining us.\n\nSteven Rice joining us from Juniper Networks.\n\nNow, after the break, they came to help, not to die. New York's former fire commissioner will never forget the colleagues he lost on September the 11th. We'll hear his memories of that day in just a moment.\n\n\nQUEST: All this week, we're building up to a day of reflection and remembrance, 10 years on from September the 11th, 2001.\n\nThree hundred and forty-three -- let me repeat the number -- 343 New York firefighters died on that day.\n\nNow, leading them was the fire department commissioner, Thomas Von Essen.\n\nHe was inside the North Tower, responding to the first attack when the second plane hit.\n\nHe joined me earlier this week and recalled the first thing he heard on a day that obviously he would never forget.\n\n\nTHOMAS VON ESSEN, FORMER NEW YORK CITY FIRE COMMISSIONER: A small plane crashed into the North Tower. That was our original report.\n\nBut as soon as you got there, you knew it had to be more. And the chiefs had some firefighters that got up to the upper floors very quickly when the elevators were still working.\n\nThey gave them more accurate information, the amount of damage up there. They realized it had to be a commercial plane.\n\nQUEST: And then, of course, the second plane.\n\nVON ESSEN: The second plane...\n\nQUEST: You were -- you were on the site by that stage?\n\nVON ESSEN: I was in the North Tower and we felt the vibration. And we all thought that there was an explosion on the upper floors. The reports came in then that a second plane had hit the South Tower. And I think that's when all the chiefs or the best fire experts you're going to find in high rise buildings, they all knew this was going to be something that was overwhelming, because they had to split all their top commanders. They had to now send in a second fifth alarm, which gives you more and more units.\n\nQUEST: As commissioner, how do you lead but don't get in the way?\n\nYou know what you're doing, but you -- is there an element of panic in all of that?\n\nVON ESSEN: No. I don't think anybody had any sense of panic. The chiefs, like I said, are really good at high rise firefighting. We've had serious incidents before. But we've never had so many all at once, so much all at once.\n\nQUEST: But was there a moment when you had to take a decision that you can now look back on and say, I had to make that decision, it was one of the most difficult decisions I've ever had to make?\n\nVON ESSEN: No, I didn't have to do that that day. And that's probably why it's been easier for me to -- to survive, you know, without a lot of some of the survivor guilt and everything that some of the top level chiefs had, because they really had to make quick decisions on how many people to send up, how many people to try to get out as quickly as possible.\n\nQUEST: There is nothing worse than hindsight and, at the same time, there is nothing greater than hindsight.\n\nWhat would you have done maybe differently or what do you wish had been done maybe differently?\n\nVON ESSEN: Well, I've always hoped that if we had that opportunity, that we would have had maybe less people in the building. But, you know, as the -- as the troops kept coming in and the reports of the damage on the upper buildings was as severe as it was, they that they needed more help.\n\nQUEST: It's fascinating, though, isn't it, because it's those ethical decisions that -- in the luxury of a cocktail party in a -- at a dining room table, you know, would you pull them out, how much is one life worth and all those sort of things that people can pontificicate -- pontificate about over dinner parties, but are real decisions.\n\nVON ESSEN: That's right. When -- that's why it's difficult to criticize...\n\n\nVON ESSEN: -- chiefs like that, you know, a fire -- a fire, police officers, soldiers in combat. When your life is on the line or when you're responsible for the lives of other young men who -- who came to work wanting to help, but not to die, it's -- it's a critical decision that you're making.\n\nQUEST: As you look back on what happened -- and you've been asked this a gazillion times, but as you look back on what happened, what do you take from it?\n\nVON ESSEN: Well, you know, I -- I've always tried to find some good came out of it. People say that, you know, good comes out of everything and there's a meeting and I don't know, I -- I've never found anything to feel good about from this.\n\nI -- I look at the growth of volunteerism. I think that's been a great thing, probably all around the world. And I hope and I think one thing, I've seen a tremendous increase in the respect and admiration, empathy and compassion for firefighters and the role of first responders all around the world because of the sacrifice my guys made that day.\n\nAnd I think if anything, that's -- their memory or the sacrifice they made has really raised the level of support for firefighters and military and other first responders all around the world.\n\nThat's one good thing.\n\n\nQUEST: The former commissioner of New York.\n\nThat is Thomas Von Essen.\n\nTen years after 9/11, first responders who breathed in the dust and the fumes at Ground Zero are suffering the effects of exposure.\n\nCNN's chief medical correspondent, Sanjay Gupta, examines the consequences of that dust and what it might mean if disaster strikes again. \"Terror in the Dust,\" a CNN documentary, Thursday morning. It's at 10:00 a.m. in Hong Kong, 10:00 p.m. Eastern, Wednesday, for viewers in the Americas.\n\nAnd here's a clip from that documentary.\n\n\nERNIE VALLEBUONA, FIRST RESPONDER TO GROUND ZERO: One of my friends, he's a captain. He had multiple myeloma. Another lieutenant who worked in vice with me, he has the same lymphoma I have.\n\nAnd he goes, wait a second, let me take a look at your case.\n\nSANJAY GUPTA, CNN CHIEF MEDICAL CORRESPONDENT: How many people, just off the top of your head right now, can you think of that fall into that pattern, that developed cancer?\n\nVALLEBUONA: There are so many, I hear of, you know, every -- every month there's just a couple more.\n\nGUPTA: Every month?\n\n\nDR. JACQUELINE MOLINE, WTC MEDICAL MONITORING PROGRAM: We do know there were carcinogens in there. Even in the dust there were carcinogens.\n\nThe question is, how long does it take for people to develop cancers after they've been exposed to these compounds? GUPTA (voice-over): It's a question that science has struggled to answer. But Ernie Vallebuona has no doubt. He believes there's a connection between his cancer and the dust.\n\nVALLEBUONA: I firmly believe that.\n\n\n\n\nQUEST: And our reflections and remembrances of 9/11 will obviously continue in the days ahead.\n\n\nBack in a moment.\n\n\nQUEST: Let's go to the markets.\n\nFor so many days, we have told you how awful things have been.\n\n\nQUEST: Well, look at that. A rollicking strong session, up 255 for the Dow Jones, 2 percent -- 2.3 percent, 11395.\n\nNow, look, is there a specific reason why, on this random Wednesday in September, the Dow is up so strongly?\n\nNot really. Anymore than if you take Europe's stock markets, which were up also sharply.\n\nThe DAX in Europe gained 4 percent. The FTSE is up 3 percent.\n\nNow, one of the things that did, of course, really boost the market was the decision by the German constitutional court that -- the German constitutional court that bailouts to Greece were legal in most scenarios.\n\nThe markets were boosted, of course, by that ruling. The ruling defended the legality of the bailouts. Angela Merkel made her call to arms speech to parliament. And it was the message, of course, that the euro must be defended at all costs.\n\n\nANGELA MERKEL, GERMAN CHANCELLOR (through translator): The euro is a guarantee of a unified Europe. Or, to put it differently, if the euro fails, Europe fails. And because a democratic and free Europe is our home, the euro must not be allowed to fail and it will not fail.\n\n\nQUEST: So that's Angela Merkel.\n\nAnd, in fact, wherever we looked pretty much today, whether it was Greece or Germany, and, indeed, this evening, as I told you at the beginning of the program, Italy, the senate in Ital -- in Italy has confirmed its passed its austerity measures.\n\nNow, when I come back, a Profitable Moment.\n\n\nGood evening.\n\n\nQUEST: Tonight's Profitable Moment.\n\nEurope has never been an easy sell for politicians. Euro skeptics are lurking everywhere. They're in the pubs of the United Kingdom, the saunas of Finland, wanting collateral for bailouts.\n\nAnd right now, they might be smiling. The European experiment is crumbling all around us. It's up to politicians like Angela Merkel to remind us why it's worth saving.\n\nNow, her defense of the Eurozone was strong -- as the euro goes, so goes Europe. Protecting the union has been an article of faith for the continent's politicians since the whole experiment began.\n\nBut the catcalls and the heckles in the parliament today go to show how much has changed. You only need look at the United States to see what happens when politicians aren't pulling in the same direction.\n\nIt's the world's most powerful economy can get a downgrade, you can bet your last euro that Europe can go the same way.\n\nThe hard sell is only going to get harder.\n\nAnd that is QUEST MEANS BUSINESS for tonight.\n\nI'm Richard Quest in London.\n\n\n\"PIERS\" is after the headlines.\n",
  "response": "### **Scene Concept: \"Euro Crisis Command Center\"**  \n\n#### **1. Overall Scene Theme and Core Concept**  \nA high-stakes **European Financial Crisis Command Center**, where policymakers, economists, and analysts collaborate in real-time to stabilize the Eurozone. The tension between political will and economic reality permeates the space, with urgency in the air.  \n\n**Why multi-agent?**  \n- **Heavy coordination required:** Teams must synthesize market data, draft policy responses, and manage communications across governments.  \n- **Physical constraints:** Some tasks (e.g., moving large equipment, cross-referencing fragmented data) demand teamwork.  \n- **Time pressure:** Simulated \"market volatility\" forces rapid, parallelized workflows.  \n\n---\n\n### **2. Spatial Layout**  \nA converted **historic bank building** in Brussels, repurposed into a war room. Three key areas:  \n\n1. **Main War Room** (*Hub of activity*):  \n   - Circular central table with live feeds of global markets.  \n   - Glass walls covered in scribbled equations and crisis timelines.  \n\n2. **Data Vault** (*Secure analysis zone*):  \n   - Soundproofed, with servers humming.  \n   - Locked cabinets for sensitive documents.  \n\n3. **Breakout Lounge** (*Improvised negotiation space*):  \n   - Coffee-stained couches, whiteboards with scribbled compromises.  \n   - A vintage ticker tape machine (non-functional, for nostalgia).  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. Anchor Furniture & Installations**  \n- **Main War Room:**  \n  - A 4-meter-long **olivewood conference table** (scratched, with embedded touchscreens).  \n  - **Eurozone map hologram projector** (flickering; requires recalibration).  \n  - **Steel document shredder** (jam light blinking).  \n\n- **Data Vault:**  \n  - **Floor-to-ceiling server racks** (labeled \"ECB_SECURE_ARCHIVE_7\").  \n  - **Biometric scanner** (fingerprint smudges visible).  \n\n#### **B. Key Interactive & Task-Relevant Objects**  \n- **War Room:**  \n  - **\"Red Phone\" hotline** to Berlin (off-hook, faint dial tone).  \n  - **Emergency austerity draft** (printed, with handwritten edits in red ink).  \n  - **Broken fax machine** (paper jammed; critical message stuck).  \n\n- **Data Vault:**  \n  - **Encrypted hard drive** (labeled \"GREEK_TAX_EVASION_2011\").  \n  - **Outdated economics textbook** (open to \"Hyperinflation\" chapter).  \n\n#### **C. Functional Ambient Objects**  \n- **War Room:**  \n  - **Overflowing trash bin** (takeout containers, crumpled drafts).  \n  - **Coffee maker** (burned smell; \"OUT OF ORDER\" sticky note).  \n\n- **Breakout Lounge:**  \n  - **Mini-fridge** (empty except for a single expired yogurt).  \n  - **Whiteboard markers** (dried out; \"WHO TOOK THE CAPS?\" note).  \n\n#### **D. Background & Decorative Objects**  \n- **Framed photo** of EU founders (dusty, slightly crooked).  \n- **Dead potted plant** (symbolism unintended).  \n- **\"Euro Survival Guide\" poster** (defaced with doodles).  \n\n---\n\n### **4. Embedded Affordances for Collaboration & Reasoning**  \n\n#### **Collaborative Transportation Affordances**  \n- **Server rack (Data Vault):** 300kg, requires 2+ agents to move for maintenance.  \n- **Austerity proposal binder:** 15kg, locked wheels (needs teamwork to haul to printer).  \n\n#### **Reasoning & Tool-Use Affordances**  \n1. **Attribute-based:**  \n   - Five nearly identical **USB drives** on a desk:  \n     - *Target:* \"Blue one with chipped corner, labeled 'FINAL_DRAFT.'\"  \n     - *Distractors:* Red (empty), green (corrupt), etc.  \n\n2. **Compound Problem-Solving:**  \n   - *Problem:* Hologram projector flickers.  \n   - *Solution:* Calibration remote is in Breakout Lounge, buried under coffee cups.  \n\n---\n\n### **Design Analysis**  \nThis scene thrives on **density** (every object tells a story) and **purposeful chaos** (clutter forces precision). The **political tension** is palpable in scribbled notes and defaced decor, while the **tools for collaboration** (heavy objects, fragmented data) make multi-agent work unavoidable.  \n\n**Why it works:**  \n- **Real-world grounding:** Echoes actual crisis rooms (e.g., ECB during 2011).  \n- **Layered tasks:** Agents must filter signal (critical docs) from noise (expired yogurt).  \n- **Emotional weight:** The dead plant and defaced poster hint at fraying unity.  \n\n---  \n**Final Note:** The scene avoids fantasy—no Bond-villain tech. Just a gritty, overworked war room where the fate of the euro is debated one coffee stain at a time."
}