{
  "id": 1115,
  "raw": "\nRetrieved from http://judaism.stackexchange.com/questions/2735/what-is-it-about-pigs-thats-so-despised-vs-other-non-kosher-animals\nText:\nTake the 2-minute tour ×\n\n\nshare|improve this question\n\n5 Answers 5\n\nup vote 9 down vote accepted\n\n\nshare|improve this answer\n\n\n\n\nshare|improve this answer\n\n\n\nshare|improve this answer\n\nSomething I wrote at Parsha Shemini last year\n\n\n\n\n\n\n\n\n\nshare|improve this answer\n\nIn order to understand why the pig has become synonymous with all that is not Kosher we must consider the history of Neolithic domestication of swine. The diseases that came from this particular animal, actually shaped the human immune system, because of all the animals humans were learning to domesticate, only the pig was able to share germs with our species, and this swapping of germs, while deadly to many of our ancestors, also helped to evolve our own immune system -as well as the pigs’.\n\nThe question must arise as to whether the pig’s ability to infect us with disease was the reason that pigs were considered unclean in the Kosher dietary laws recorded in the Tenakh or Old Testament. Because so much of the Jewish law dictating what was and was not actually Kosher, were collected in the writings of the two Talmudic books, the Mishna (written c. 200 CE) and the Gemara (written c. 500 CE), it could be suggested that so much time had passed since the pig was first domesticated that there was probably no correlation between the Kosher laws forbidding contact with swine, and the illnesses that would have ravaged ancient pastoral societies.\n\nIn Leviticus, the third book in the Old Testament which was attributed to Moses, but which was more likely written during the Babylonian exile between 538 and 332 BCE, God gives the Hebrews not only the famous Ten Commandments, but also all 613 commandments associated with Jewish life, including the commandments that dictate what is “clean” to eat and what is not.\n\n\"Now the LORD spoke to Moses and Aaron, saying to them, \"Speak to the children of Israel, saying; 'These are the animals which you may eat among all the animals that are on the earth”\n\nThe main factor in determining what herd animals are, and are not, Kosher has to do with whether they have a cloven hoof and chew their cud. Had Leviticus left it at that I might never have written these words. But the text goes on:\n\n\nSo the pig is one of the few animals that were actually ‘called out’ in the Bible as being un-Kosher. This is very significant because when the Bible specifically names a thing it implies that that thing has some power over ancient cultures. For instance, in Genesis as God is creating the world, there is a reference to the creation of “the great sea-monsters”. The actual word used for ‘sea monster’ in Hebrew is tninim, which means crocodile. Many of the religious cults of the time worshipped the symbol of the crocodile as a god, particularly in Egypt, which was a major cultural influence on the Hebrews. By actually naming this animal, the ancient writers are illustrating YAWH’s omnipotence over the whole of creation, even the gods of Egypt. Thus, because the pig is named, it is probable there was a history that needed to be specifically addressed.\n\nStill we have around ten thousand years separating the domestication of the pig and the writing of Jewish law. Many things may have come to pass and been forgotten in ten thousand years, but the Bible was not written whimsically on a sunny day in Dolores park, it was a compilation of oral traditions passed down through the generations from father to son, from mother to daughter. The writings were the sacred laws, stories, and lineage of this Semitic tribe recited by the priests who would retain the knowledge by repeating the words over and over throughout the year, ensuring that nothing was ever forgotten. Because the Jews feared their traditions would be lost following the destruction of the first temple in Jerusalem, which had been their center of learning and knowledge since the 9th century BCE, they wrote it all down and committed it to the Old Testament. Much of the Jewish texts were assembled during times of crises and exile. The Talmud was a result of the Romans destruction of the Second Temple at Jerusalem and the subsequent diaspora of the Jewish people across the world. Without a written standard, a manual, communities would have lost their traditions and assimilated into whatever culture dominated their new homes.\n\nThe written Bible was a compilation from many different writers in many different periods as they tried to save their laws and culture by documenting the elaborate oral traditions of the Hebrew people. These stories and rules, like the rejection of pork, became icons of Jewish tradition and culture, but as they emerged from the past it was probable that they would carry with them the echo Neolithic drama and wisdom, like the Garden of Eden, the Great Flood and the Tower of Babel. From the ancient clues left behind we may never actually know the whole truth, but I believe that most of the stories and commandments in the Bible probably came from an ancient, practical source, that was passed down from generation to generation.\n\nshare|improve this answer\nSD, welcome to Mi Yodeya! Please note that questions and answers here are from the point-of-view of Judaism, which holds its foundational texts and traditions to be of Divine origin. –  Isaac Moses Sep 1 '13 at 1:43\n@SDKarlin, camel, hyrax, and hare are also called out in Leviticus, yet they don't seem singled out in our culture the same way as pigs. Furthermore: \"it could be suggested that so much time had passed since the pig was first domesticated that there was probably no correlation between the Kosher laws forbidding contact with swine, and the illnesses that would have ravaged ancient pastoral societies.\" Provably false. The Talmud records (Taanit 21b) that a porcine epidemic is a major threat to humans, as our internal organs are so similar. –  Shalom Sep 1 '13 at 5:39\n\nYour Answer\n\n\n\n",
  "response": "### **Scene Concept: The Ancient Scriptorium & Kosher Certification Lab**  \n\n#### **1. Overall Theme and Core Concept**  \nThis scene merges a medieval Jewish *scriptorium* (a manuscript-copying workshop) with a modern-day kosher food certification laboratory. The environment is rich with historical artifacts, religious texts, and scientific equipment, creating a space where tradition meets rigorous inspection. The dual nature of the space inherently demands collaboration—scribes preserving ancient texts must work alongside lab technicians analyzing food samples, with both groups relying on shared tools, documents, and procedural knowledge.  \n\n**Why Multi-Agent?**  \n- **Heavy & Delicate Objects:** Some religious texts are too large or fragile for one person to move safely.  \n- **Precision Tasks:** Scribes and lab techs require tools that may be misplaced, forcing coordination.  \n- **Time-Sensitive Processes:** Certain documents must be cross-referenced before food batches can be approved, creating dependencies.  \n\n---\n\n#### **2. Spatial Layout**  \nThe space is divided into three key areas:  \n\n1. **The Scriptorium (Main Hall)** – A high-ceilinged chamber with long oak tables, inkwells, and parchment scrolls. A large *Aron Kodesh* (Torah ark) dominates one wall.  \n2. **The Laboratory Annex** – A sterile workspace with microscopes, refrigeration units, and sample trays.  \n3. **The Archive & Storage** – A cramped backroom with labeled crates, ancient manuscripts, and locked cabinets.  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. The Scriptorium (Main Hall)**  \n**a. Anchor Furniture & Installations:**  \n- A **2.5-meter-long scribe’s table** (solid walnut, worn smooth from centuries of use), bearing ink stains and a brass ruler embedded in the wood.  \n- A **Torah ark (Aron Kodesh)** with ornate silver doors, slightly ajar, revealing a velvet-lined interior holding five sacred scrolls.  \n- A **freestanding parchment drying rack** (iron frame, 2m tall) with freshly inked sheets hanging from clothespins.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- A **half-finished Torah scroll** (parchment, 60cm wide, partially unrolled) with a quill resting on an inkstand (black ink, almost depleted).  \n- A **sealed glass case** containing a 12th-century *Mishneh Torah* manuscript (locked, key missing).  \n- A **Rabbi’s checklist** (yellowed paper, handwritten in Aramaic) listing kosher certification steps.  \n\n**c. Functional Ambient Objects:**  \n- A **brass oil lamp** (lit, flickering) on a side table.  \n- A **wooden step stool** (wobbly, one leg slightly shorter than the others).  \n- A **stack of blotting papers** (some stained, some fresh).  \n\n**d. Background & Decorative Objects:**  \n- A **faded tapestry** depicting the Temple in Jerusalem.  \n- A **ceramic jug** (cracked, holding dried-out quills).  \n- A **dusty ledger** on a high shelf, labeled *\"Kashrut Inspections, 1582.\"*  \n\n---\n\n#### **B. The Laboratory Annex**  \n**a. Anchor Furniture & Installations:**  \n- A **stainless steel lab table** (2m x 1m) with embedded sinks and drainage grooves.  \n- A **refrigerated sample cabinet** (digital lock, temperature set to 4°C).  \n- A **microscope station** (high-powered, with an adjustable halogen light).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- A **meat sample under analysis** (labeled \"Pork Substitute #47-B,\" sealed in a petri dish).  \n- A **broken centrifuge** (error light blinking, requires a replacement fuse).  \n- A **kosher certification stamp** (engraved with a Star of David, missing its ink pad).  \n\n**c. Functional Ambient Objects:**  \n- A **wall-mounted whiteboard** with chemical formulas and Hebrew notes.  \n- A **box of sterile gloves** (half-empty).  \n- A **digital scale** (calibration slightly off).  \n\n**d. Background & Decorative Objects:**  \n- A **framed photo** of a rabbi shaking hands with a scientist.  \n- A **chalkboard** with erased equations (ghostly remnants visible).  \n- A **coffee mug** (stained, labeled *\"World’s Okayest Mashgiach\"*).  \n\n---\n\n#### **C. The Archive & Storage**  \n**a. Anchor Furniture & Installations:**  \n- **Floor-to-ceiling wooden shelves** (some warped with age), packed with scroll tubes and ledgers.  \n- A **heavy iron-bound chest** (locked, rusted hinges).  \n- A **rolling ladder** (one wheel squeaky).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- A **sealed jar labeled *\"Ancient Pig Bone Sample – DO NOT OPEN\"*** (glass, wax-sealed).  \n- A **stack of unprocessed food inspection forms** (paper-clipped, some out of order).  \n- A **missing quill knife** (needed for scribe work, last seen near the chest).  \n\n**c. Functional Ambient Objects:**  \n- A **box of spare microscope slides** (some chipped).  \n- A **leather-bound catalog** (indexed by century).  \n- A **kerosene lantern** (fuel low).  \n\n**d. Background & Decorative Objects:**  \n- A **cobwebbed menorah** (tarnished silver).  \n- A **pile of broken wax seals** (discarded from old documents).  \n- A **moth-eaten rabbinical robe** hanging on a hook.  \n\n---\n\n### **4. Embedded Potential for Complex Tasks**  \n\n#### **Collaborative Transportation Affordances:**  \n- **The Torah Scroll (60cm wide, 25kg when fully rolled)** – Requires two people to unroll without damaging the parchment.  \n- **The Iron-Bound Chest (150kg, 1.5m long)** – Must be moved to access a hidden compartment beneath.  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **Identifying the Correct Pig Bone Sample:** Among several jars, the one with the **blue wax seal, a cracked lid, and a handwritten \"Leviticus 11:7\" label** is the critical specimen. Distractors include jars with red seals and printed labels.  \n- **Fixing the Broken Centrifuge:** The **replacement fuse is inside the locked glass case in the Scriptorium**, requiring retrieval of the missing key (hidden in the Rabbi’s checklist).  \n\n#### **Compound Problem-Solving Example:**  \n- **Task:** Certify a new meat substitute.  \n- **Steps Required:**  \n  1. Retrieve the **Rabbi’s checklist** (Scriptorium).  \n  2. Cross-reference with the **ancient pig bone sample** (Archive).  \n  3. Repair the **centrifuge** (Lab) using the fuse from the Scriptorium.  \n  4. Stamp the final approval—but first, **find the missing ink pad** (last seen near the whiteboard).  \n\nThis scene is **dense with interactable objects, layered problems, and collaborative necessities**, making it ideal for multi-agent reasoning and task execution."
}