{
  "id": 1110,
  "raw": "\nRetrieved from http://en.wikipedia.org/wiki/Navvab_Safavi\nText:\nNavvab Safavi\n\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\nNavvab Safavi, leader of the group Fadayan-e Islam\n\nSayyid Navvab Safavi (born Mojtaba Mir-Lowhi) (1923 – 1955) was a cleric responsible for founding of the Fadayan-e Islam group and with them the assassination of several leading Iranians, primarily politicians who supported the government of the Shah.\n\nEarly life[edit]\n\nBorn in Khānīābād (southern Tehran) into a known religious family in 1923,[1] He received primary education in Tehran and left school after eighth grade when his father died.[1] Later, Safavi studied in Najaf, Iraq and worked in Abadan's petroleum installations in the province of Khuzestan for a while. He is said to have been known for his striking looks and his \"mesmerizing\" speaking ability.[2] He later changed his name to Navvab Safavi to identify with the Shiite dynasty, Safavids.[1] His new name means the deputies of the Safavids.[1]\n\n\nSafavi founded the Fadayan-e Islam organization in 1945,[1] and began recruiting like-minded individuals. Like the Ikhwan (Muslim Brotherhood), Navvab-Safavi believed that Islamic society needed to be purified. To do this he organized carefully planned assassinations to rid Islam of \"corrupting individuals,\" often prime ministers of Iran's government.\n\nAmir Taheri claims that Safavi was \"the man who introduced Ayatollah Khomeini to the Muslim Brotherhood and their ideas,\" who \"spent long hours together\" with Khomeini in discussion, and visited him in Qom on a number of occasions during 1943 and 1944.[3] However, this is contradicted by the fact that the Muslim Brotherhood is a fundamentalist Sunni organisation that is against Shi'a Islam and considers it to be a heresy.[4]\n\nHe and his organization were responsible for the assassinations, or attempted assassinations of politicians Abdolhosein Hazhir, Hossein Ala (he survived the attempt), Prime Minister Haj Ali Razmara,[5] historian Ahmad Kasravi,[5] and Teymur Bakhtiar.\n\nSafavi and his group were closely associated with Ayatollah Abol-Ghasem Kashani and supported but were not members of Mohammed Mosaddeq's National Front. Safavi worked with Kashani, helping organize bazaar strikes against Premier Ahmad Qavam, public meetings in support of Palestinian Arabs, and a violent demonstration in 1948 against Premier Abdolhossein Hazhir.[6] When the Shah appointed National Front leader Mohammed Mossadegh to the post of prime minister, Safavi expected his objectives would be furthered.[citation needed] He demanded the government drive the British out, and that it release \"with honor and respect\" the assassin of Razmara. When that didn't happen, Safavi announced \"We have broken away irrevocably from Kashani's National Front. They promised to set up an Islamic country according to the precepts of the Koran. Instead they have imprisoned our brothers.\" He later warned, \"There are others who must be pushed down the incline to hell.\"[citation needed]\n\nHowever relations between Kashani and Safavi, not to mention Mosaddeq, became \"strained.\" On 10 May 1951, Navvab Safavi declared: 'I invite Musadizz, other members of the National Front and Ayatollah Kashani, to an ethical trial,`[7]\n\nNavvab Safavi escorted by Iranian police to the court\n\nArrest and execution[edit]\n\nPrime Minister Mosaddeq, who was preocupied with the nationalization of the oil industry, found these activities \"disruptive.\" On 8 June 1951 he ordered the arrest of Safavi, who stayed there until his release in February 1953. Six months later Mosaddeq was overthrown in a coup d'état. Like Kashani, Safavi supported the coup against Mosaddeq and \"in the years immediately following the coup Navvab Safavi enjoyed a close association with the court and the government of Prime Minister General Fazlollah Zahedi.\" By 1955 it became clear the regime would not be instituting strict enforcement of Shariah law and Islamization of Iran, and was instead becoming more pro-Western. On 22 November, after an unsuccessful attempt to assassinate Hosein Ala, Navvab Safavi and some of his followers were arrested. Following a summary trial Safavi and three other members of Fadayan-e Islam were executed on 25 December. The clerical establishment did not attempt to intervene on their behalf.[7]\n\nSee also[edit]\n\n\n  1. ^ a b c d e Said Amir Arjomand (1984). From Nationalism to Revolutionary Islam. SUNY Press. p. 158. ISBN 978-0-7914-9524-7. Retrieved 13 February 2013. \n  2. ^ Taheri, The Spirit of Allah, (1985), p. 98\n  3. ^ Taheri, The Spirit of Allah (1985), p. 98, 102.\n  4. ^ Egypt’s Shiite Minority: Between the Egyptian Hammer and the Iranian Anvil from the Jerusalem Center for Public Affairs\n  6. ^ Ervand Abrahamian, Iran between Two Revolutions (Princeton University Press, 1982), pp. 258-9.\n  7. ^ a b Islamic Utopia in Pre-Revolutionary Iran: Navvab Safavi and the Fada'ian-e Eskam, Sohrab Behdad Middle Eastern Studies, January 1997\n  • Mazandi, Yousof (United Press Iranian correspondent) and Edwin Muller, Government by Assassination, Reader's Digest, September 1951.\n  • Taheri, Amir. The Spirit of Allah Khomeini and the Islamic revolution, Bethesda, Maryland : Adler & Adler, c1985\n\nExternal links[edit]\n",
  "response": "### **Scene Concept: \"The Revolutionary Hideout – Tehran, 1955\"**  \n\n**1. Overall Scene Theme and Core Concept**  \nA clandestine hideout in 1950s Tehran serves as the operational base for a secretive revolutionary group. The space is a converted underground printing press, now doubling as a meeting place, armory, and propaganda workshop. The environment is inherently collaborative, with tasks requiring coordinated efforts—distributing pamphlets, assembling explosive devices, encrypting messages, and hiding evidence before raids. The atmosphere is tense, dimly lit, and packed with objects that demand careful handling—some too heavy for one person, some requiring specialized tools, and others concealed in plain sight.  \n\n---\n\n### **2. Spatial Layout and Area Descriptions**  \nThe hideout consists of:  \n- **Front Room (Cover: Printing Shop)** – A facade of a legitimate printing business, with machinery, stacks of paper, and a cash register.  \n- **Meeting Room (Hidden Chamber)** – A concealed backroom with maps, a radio transmitter, and locked cabinets.  \n- **Armory & Workshop (Basement Access)** – A reinforced basement where weapons and explosives are assembled.  \n- **Escape Tunnel (Collapsed Passage)** – A partially blocked underground route leading to the bazaar.  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. Front Room (Printing Shop Cover)**  \n**a. Anchor Furniture & Installations:**  \n- A **heavy cast-iron printing press (300kg, 2m x 1.5m)**, bolted to the floor with visible oil stains.  \n- A **wooden counter (2m long, 1m high, chipped varnish)**, with a cash register (empty, drawer stuck).  \n- **Floor-to-ceiling shelving units** filled with paper reams (labeled \"Government Stock – Do Not Distribute\").  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **A false-bottomed drawer (stuck, requires two people to pry open)** containing coded manifests.  \n- **A locked metal toolbox (15kg, rusted hinges)** holding counterfeit stamps.  \n- **A rotary phone (off-hook, faint dial tone)**, its cord frayed near the base.  \n\n**c. Functional Ambient Objects:**  \n- **A flickering ceiling bulb**, casting uneven shadows.  \n- **A wall calendar (November 1955)**, with red X's marking dates.  \n- **A broom (broken handle, bristles worn)** leaning against the press.  \n\n**d. Background & Decorative Objects:**  \n- **Dusty propaganda posters (\"Unity Against Oppression\")** peeling at the edges.  \n- **A half-empty teacup (cold, with a lipstick stain)** left on the counter.  \n- **A faded newspaper (headline: \"Prime Minister Survives Attack\")** crumpled in the corner.  \n\n---  \n\n#### **B. Meeting Room (Hidden Chamber)**  \n**a. Anchor Furniture & Installations:**  \n- **A large oak table (3m x 1.5m, scratched surface)**, with a **hidden compartment (triggered by lifting a loose floorboard)**.  \n- **A wall-mounted chalkboard**, covered in erased markings but with faint traces of a city map.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **A shortwave radio transmitter (powered off, missing one vacuum tube)**.  \n- **A steel safe (1m tall, combination lock jammed)**, containing incriminating documents.  \n- **An oil lamp (low on fuel, wick trimmed short)**.  \n\n**c. Functional Ambient Objects:**  \n- **A stack of file folders (some labeled \"Confidential\")**, one with a **bloodstained corner**.  \n- **A wooden chair (wobbly leg, squeaks when moved)**.  \n- **A kerosene heater (cold, fuel gauge near empty)**.  \n\n**d. Background & Decorative Objects:**  \n- **A framed photo of a mosque (glass cracked)** hanging crookedly.  \n- **A discarded cigarette pack (empty, foreign brand)** under the table.  \n- **A Persian rug (frayed edges, hiding a loose floorboard)**.  \n\n---  \n\n#### **C. Armory & Workshop (Basement Access)**  \n**a. Anchor Furniture & Installations:**  \n- **A reinforced steel door (200kg, requires two people to lift)** leading to the basement.  \n- **A workbench (2m long, stained with gunpowder residue)**, with **vise grips bolted down**.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **A crate of dynamite (40kg, \"Mining Supplies\" label half-scratched off)**.  \n- **A disassembled rifle (missing firing pin, parts scattered)**.  \n- **A locked metal cabinet (requires two keys, held by different members)**.  \n\n**c. Functional Ambient Objects:**  \n- **A soldering iron (cold, tip blackened)**.  \n- **A roll of duct tape (half-used, sticky residue on the bench)**.  \n- **A bucket of oily rags (strong chemical smell)**.  \n\n**d. Background & Decorative Objects:**  \n- **A torn revolutionary pamphlet (\"Death to Traitors\")** pinned to the wall.  \n- **A broken pocket watch (hands frozen at 3:15)** discarded in a corner.  \n- **A dusty gas mask (filter expired, strap frayed)** hanging on a hook.  \n\n---  \n\n#### **D. Escape Tunnel (Collapsed Passage)**  \n**a. Anchor Furniture & Installations:**  \n- **A narrow brick tunnel (partially collapsed, requires crawling)**, partially blocked by a **fallen wooden beam (3m long, 50kg, requires two people to move)**.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **A rusted iron gate (jammed, hinges corroded)** at the far end.  \n- **A half-buried leather satchel (contains forged passports)**.  \n\n**c. Functional Ambient Objects:**  \n- **A flickering lantern (low oil, casting erratic shadows)**.  \n- **A pile of loose bricks (some sharp-edged, unstable)**.  \n\n**d. Background & Decorative Objects:**  \n- **A rat’s nest (shredded newspaper, faint squeaking)** in a corner.  \n- **Graffiti (\"The Path is Watched\")** scratched into the wall.  \n\n---\n\n### **4. Scene Affordances and Embedded Potential**  \n\n#### **Collaborative Transportation Affordances:**  \n- **The dynamite crate (40kg, bulky)** is too heavy for one person—requires coordinated lifting.  \n- **The collapsed tunnel beam (50kg, awkward shape)** needs two agents to clear the path.  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:** Among five **locked drawers**, only one has a **hidden latch (triggered by pressing a loose nail)**. The others are decoys.  \n- **Compound Problem-Solving:** The **jammed safe** requires a **key hidden inside a hollowed-out book** in the printing shop, while the **second key is in a cigarette pack** under the table.  \n\n#### **Atmospheric Distractors:**  \n- The **bloodstained file** is irrelevant—merely a red herring.  \n- The **broken pocket watch** is non-functional but adds to the tension.  \n\nThis scene is **ripe for espionage, sabotage, and escape missions**, with mechanics requiring **teamwork, precise tool use, and deductive reasoning** to navigate its challenges."
}