{
  "id": 1129,
  "raw": "\nRetrieved from http://www.animenewsnetwork.com/MyAnime/?user=Tenchi\nText:\nSeen some Rating Comment\nCardcaptor Sakura (TV) Excellent This is a “magical girl” type story from Clamp, a four woman artistic team from Osaka whom do a wide range of different types of manga; from “magical girl” stories like this (and Magic Knight RayEarth), to graphic horror tales like X, and even “mature readers only” manga like Miyuki-chan in Wonderland, which is raunchy but not really pornographic. A young girl named Sakura opens a mysterious book in her father’s library and Clow Cards (note: in the original Japanese version, “Clow” rhymes with “glow” and not “cow”) fly everywhere. Cerberus (a.k.a. Kero-chan), is a cute flying stuffed animal-like creature that informs Sakura that since she was able to open the book, she must possess magical powers. Kero entrusts the rather reluctant Sakura with the duty of finding the Clow Cards, each of which takes the form of a mischievous spirit, some benign and playful, others dangerous and destructive. Her rich friend Tomoyo (“Madison” in the TV dub) has a disturbing obsession with Sakura, and one night she videotapes Sakura flying around on her winged wand, much to the consternation of Sakura, to whom Tomoyo shows the videotape the next morning! Tomoyo assists Sakura by making ridiculously complex costumes out of scratch for each confrontation with a Clow Card, which is why Sakura rarely wears the same costume twice. Several episodes later, in episode 8 to be exact (although this was the first episode shown in English!), Sakura meets another Cardcaptor, Li Shaorin, who at first tries to beat Sakura to every new Clow Card, but eventually realizes that he must work together. And who exactly is this “Yue” person about whom Cerberus frequently talks in his sleep? As you may know, a heavily-edited version is shown on North American TV under the title of “Cardcaptors”, but you may not know that there is also an officially-licensed unedited version, in Japanese with English subtitles, available DVD from Pioneer Animation, so I refrain from giving an opinion on the dub, which was done for 5 year olds and not me. Please note that you can easily tell the subtitled DVDs apart from the videos of the dubbed TV version, as the subtitled ones are sold under the title “Cardcaptor Sakura” and not “Cardcaptors”. By the way, I'm of the opinion that Tomoyo's feelings for Sakura are idol worship, perfectly normal for girls in the latency stage of development, exaggerated because it's a cartoon... I don't think Nakayoshi would print something with 10-11 year old lesbians. Also, I think her mother, Sonomi, wasn't really a lesbian, she was just immature, stuck at the idol worship phase.\nIchigo Mashimaro (OAV) Masterpiece\nIchigo Mashimaro Encore (OAV) Masterpiece\nK-ON! (TV) Masterpiece\nMagical Project S (TV) Very good\n(The) Melancholy of Haruhi Suzumiya (TV) Masterpiece\n(The) Melancholy of Haruhi Suzumiya (TV 2009 renewal) Masterpiece TEH greatest season of any animeh EVAR! Especially the \"Endless Eight\" story arc, where every episode leaves you wishing that the summer wasn't over.\nRanma ½ (TV) Good\nRevolutionary Girl Utena (TV) Excellent\nSailor Moon Sailor Stars (TV) Good\nSailor Moon SuperS (TV) Very good\nTrip Trek (ONA) Very good\nUrusei Yatsura (TV) Masterpiece This series, which started as a manga in 1978, and which, in 1981, was made into a television series that lasted 196 episodes (plus a dozen or so made-for-video episodes, 5 theatrical movies, and a 10th anniversary special in 1991), made Rumiko Takahashi the richest woman in Japan. Rumiko Takahashi, who also created Ranma ½, Maison Ikokku and Inu-Yasha, was (and still is) a pioneer for women cartoonists in Japan; prior to Urusei Yatsura, the Japanese manga industry was pretty much a men’s only club. Today, there are many rich and famous female “mangaka” such as Naoko Takeuchi (Sailor Moon), Yuu Watase (Fushigi Yuugi) and the four-woman artistic team known as Clamp (Cardcaptor Sakura, X). (While I have no doubt that there were some female “mangaka” prior to Takahashi, Urusei Yatsura was the first comic written and drawn by a woman to become a mainstream Japanese pop culture phenomenon.) Urusei Yatsura may be the Japanese anime series most comparable to the Simpsons in that, besides the main characters, there is a whole town full of well-developed supporting characters, alien and human alike. The basic premise of Urusei Yatsura is this: aliens from the planet Oni (an oni is a kind of a devil) invade the Earth, but they decide to give Earth one chance. The Oni randomly select a human by computer to participate in a game of tag, and they choose Ataru Moroboshi, Japan’s unluckiest yet most lecherous boy. He has seven days to grab their princess, Lum, by the horns, which sounds easy, but Ataru doesn’t know that Lum can fly and shoot lightning bolts. Ataru wins at the very last minute, using a barefaced tactic that I won’t reveal here, but, in the process of winning, Ataru accidentally “proposes” to Lum, and she accepts. (He was actually talking to his poor, tormented girlfriend Shinobu.) Lum proclaims herself to be Ataru’s “wife”, whether he likes it or not. Ataru actually does love Lum (along with every other girl he knows), but Lum is insanely jealous of his girl-hunting, and isn’t niggardly about zapping him with electricity to keep him in line. Incidentally, Lum is the green-haired, yellow-tiger-striped-bikini clad anime babe featured in Matthew Sweet’s 1991 music video “I’ve Been Waiting”, which used clips of Lum from the movies and made-for-video episodes. Most of Urusei Yatsura is goofy comedy rooted in traditional Japanese legends, science fiction, and late 70’s/early 80’s pop-culture (from both sides of the Pacific), but animation director Mamoru Oshii (Ghost in the Shell, Patlabor) wanted to take the show in more serious directions. This path culminated with his 1984 masterpiece Beautiful Dreamer, the second Urusei Yatsura film. Ataru, Lum and the students and faculty of Tomobiki high school slowly become aware that they’ve been living the same “day before the school festival” over and over. Soon after they start investigating the nature of their new reality, people start disappearing, until the only people left in the town (and the world) are Ataru, his parents, Lum, Jariten (Lum’s cousin), Sakura (a school nurse and a Shinto sorceress), and a handful of Ataru’s classmates. After several days, or perhaps decades, most of Tomobiki town falls into ruin, except for Ataru’s house, which still receives gas, electricity and even the newspaper, and the local convinience store, which remains fully stocked with fresh food. Most of the characters find this new world to be an idyllic Shangri-La, wherein they swim every day around the ruins of the school, watch Godzilla in what remains of the town cinema, and never grow old; only Sakura and Mendou (the scion of Japan’s richest family) are determined to find out who put them in this world and how to return to the real world. This film is a beautiful examination of the existientialist questions of what is reality, and whether the worlds of our dreams are any less real than the “real” real world. It’s being slowly released in North America on DVD, with two more boxsets soon to appear (comprising volumes 16-20 and 21-25) for direct order, and earlier volumes being sold individually at stores, subtitled only, though AnimEigo is doing a new dub for the first movie, Urusei Yatsura: Only You, and, should that sell well, they may dub the 4 other movies (not including Beautiful Dreamer, which was sold by Central Park Media/U.S. Manga Corps and which has always had a dub) and the OVA episodes.\nYou're Under Arrest (TV) Very good\n\nSeen all Rating Comment\n(The) Adventures of Mini-Goddess (TV) Masterpiece\nAh! My Goddess: The Movie Decent The manga, by Kosuke Fujishima, is about my favourite manga. (I used to say it's my absolute favourite manga, but I think Fujishima's You're Under Arrest is underrated, and I've read a lot more of Hitoshi Ashinano's Yokohama Kaidashi Kikou/Yokohama Shopping Log so I think all 3 are about equal.) The anime that have been made from this series are wonderfully drawn, but the characterizations are very shallow compared to the manga. I didn't hate the movie, but I wasn't as thrilled by it as I had thought I would be, probably just because so little of Oh My Goddess! has been animated that I wanted just a normal story of Belldandy and Keiichi, not one where Belldandy isn't herself for most of the movie. I hope they do a Mara movie sometime. The movie was a little bit of a disappointment for me in that it had been the first new installment of the true OMG! anime in over half a decade, not counting Adventures of Mini-Goddess (which is a blast if you like silly, absurd humour), but they wasted much of the screen time on two characters not from the manga, Belldandy wasn't really \"herself\", in a certain way, for most of the film, and the characters I did want to see that hadn't appeared in the OVA series (either because they hadn't yet been introduced in the manga at the time, or just because the series got cut short at 5 episodes) either got too little screen time (Peorth) or didn't appear at all (Mara, again). Not that I hate the movie or anything (of course not), it's just, had the exact same movie followed a 26 episode (non-SuperDeformed) OMG! TV series, or even just another 5 or 6 epiosde OVA series, I'd probably think much, much higher of this film than I did. On the other hand, I far prefer the manga continuity to the OVA continuity (which has gorgeous animation but characters that are pretty much the Cliff's Notes versions of the manga characters), and, as far as I could tell, there's nothing in the movie that would be out of place in the manga continuity (okay, Belldandy was wearing a different costume in a certain scene than she wore in the first volume of the manga, but it's also not quite the costume she wore at the beginning of the first OVA either).\nAll Purpose Cultural Cat Girl Nuku Nuku (OAV) Excellent\nAzumanga Daioh (TV) Masterpiece\nBeyond (OAV) Very good\nCardcaptor Sakura: The Movie Very good\nCowboy Bebop (TV) Very good The Japanese toy company Bandai commissioned director Shinichiro Watanabe to do a TV series. He was free to do pretty much whatever he wanted, under the condition that the series feature spaceships prominently (as they have model kits to sell). He came up with the best anime series of the past several years. The setting is space, in the year 2071 AD. A mining accident had blown a huge chunk out of the moon, placing thousands of large rocks into Earth’s orbit, which lead to frequent rock showers scarring the Earth’s surface, rendering it largely uninhabitable. Most of humanity has moved out on to planets and space colonies where they’ve recreated portions of Earth, and carry on with their lives. Many of these new habitats are even themed to recreate specific portions of Earth- there’s a Tijuana planet, a Hong Kong like colony, and one planet that appears to recreate Nevada in around the mid-50s; for readers of sci-fi novels, the varieties of worlds is not unlike those of Dan Simmon’s Hyperion novels. (The jump gates in Cowboy Bebop seem like deliberate rip-offs of those in Babylon 5.) The rule of law varies from planet to planet, so the pursuit of wanted interplanetary crime lords is frequently left up to bounty hunters, who are also known as “Cowboys”. Spike Siegel is one such Cowboy. Spike used to be a member of the Red Dragons mafia, where he learned Jeet Kune Do, an advanced form of martial arts, but he had left the group to live a free life as a bounty hunter. On his ship, the Bebop, the fastest ship of its class, together with his part-cybernetic partner Jet Black, the alluring but scrupuless bounty huntress Faye Valentine (who has amassed a large gambling debt and isn’t afraid to double-cross Spike and Jet depending on the situation), Ed, a precocious girl computer hacker, and Ein, a “data-dog”, he faces off against the worst of the worst of the galaxy, from dealers of the dangerous drug “Red-Eye” (which makes its users extremely powerful for a short time), to ecological terrorists (who want to “Save the Water Rats”), to… um… John Shaft?! This show is great because, like Patlabor, the episodes vary wildly in tone, from high octane action, to serious drama (especially when the characters have to confront their own pasts), to wacky parody. Some episodes also deal with social themes relevant to Japanese audiences; in one a cult brainwashes members into killing themselves; shades of the Aum Shinrikyou subway gassing. Some episodes, though personally I don’t know which ones, were actually banished from the airwaves in Japan, even though this show aired past midnight. There are mild drug references (including an episode when everyone on the Bebop, except for Ed, ingests mysterious mushrooms that Ed received from a man selling them on the streets of the Nevada planet), but there’s not really too much sex, except for one scene when two men are found in bed together, though no genitalia was shown. Cowboy Bebop is also innovative as no actual cels for Cowboy Bebop were painted; the pencil-drawings were scanned into the computer and then digitally-painted, which allows for seamless insertion of 3D computer graphics. This is about the only TV anime with near movie-quality detail and fluidity. The opening sequence, with Warholesque images of guns, and a jazzy theme from famous young composer Yoko Kanno (Macross Plus, Escaflowne), is one of the best in all of anime. There is also a Taratinoian amount of pop-culture references. All 26 episodes are available on 13 VHS tapes or 6 DVDs (which cost just a few dollars more than the 2-episode tapes for 4-or-5 episodes per disk).\nCowboy Bebop: The Movie Good\nGhost in the Shell (movie) Weak This is one film where I admit I never undrstood what the fuss was about... it's a fairly standard, cyberpunk story, with too much in the way of talking heads. And I like Mamoru Oshii's \"talking heads\" in the Patlabor films (though I like the series more, because of the comic relief) and, of course, my favourite anime film Urusei Yatsura: Beautiful Dreamer. I'm sure the manga's fine, and I'll have a look at the TV series if I can rent it, but this one... just, \"meh\".\nGrave of the Fireflies (movie) Decent As a look at the effects of the firebombings of Tokyo during World War II, it's okay, I suppose, but the sob factor is grossly overrated. Maybe because it's historical and I could put it in context, I didn't find it too sad. Am I one of the few people in the world that found Grave of the Fireflies forgettable? I mean that literally. I saw it once within a year or two of having joined my anime club (in 1994) and then only had vague memories of having seen it, all the time thinking that it was one of the few Ghibli films I had never seen and thinking what I saw was Rail of the Stars until I read a plot point-by-plot point (being someone who reads spoilers) description of GotF and realized that I had indeed seen it but just wasn't nearly as emotionally moved as... pretty much everyone else that had seen it, I guess.\nJin-Roh - The Wolf Brigade (movie) Weak Saw it and didn't care for it much and I resent suggestions that the reason I didn't appreciate it was that I didn't \"understand\" it. Umm... no, the reason I didn't care for it much was that I didn't care about the story nor the characters nor what happens to the characters all that much. I really didn't have much of a problem understanding it... and, for that matter, there are certain anime I adore that leave me befuddled on certain levels, chief among them, my favourite anime film, Urusei Yatsura: Beautiful Dreamer. Not enough action for me to like it as an action flick. I like counterfactual history, but we didn't see enough Nazi influences in the alternate modern Japan for it to hold my interest. I also didn't find the \"Red Riding Hood\" subtext of Jin-Roh to be too profound. Just another animated \"talking heads\" movie, and I didn't find what the heads were talking about to be terribly interesting. And the rotoscoped animated characters just gave me a Bakshi's Lord of the Rings headache.\nKamichu! (TV) Masterpiece\nKiki's Delivery Service (movie) Masterpiece\nKimagure Orange Road (TV) Masterpiece A manga by Izumi Matsumoto that was made into a TV series, several made-for-video specials and two movies. Kyosuke Kasuga is a fifteen-year old boy who had just moved to a new city with his father and two sisters. He soon encounters Madoka Ayukawa, a girl who is sometimes warm and friendly to Kyosuke, but, at other times, cool and indifferent. Although she is very beautiful, she is also a very tough, independent girl who makes Kyosuke work for her affection. Complicating things a bit is that Hikaru Hiyama, the sweet if somewhat childish and naïve girl that Madoka had protected since Kindergarten, becomes infatuated with the notoriously indecisive Kyosuke. What makes this series especially quirky is that Kyosuke, his sisters, and their deceased mother are all descendants of a clan that in the past had hid from society because they have unusual powers. Kyosuke’s main abilities are teleportation and psychokinesis, and he also has limited telepathic powers, and when he falls on his head, he sometimes travels through time to his own past. Kyosuke prefers not to use his powers unless they’re actually needed, but his younger sisters, Kurumi and Manami, aren’t quite so discreet. The Kasuga family had moved several times because Kurumi had a nasty tendency to use her powers in phys ed class, giving her the speed of a motorcycle in sprints! Kyosuke is also highly succeptable to Kurumi’s hypnosis power, which she uses on Kyosuke quite often with quite disasterous effects for Kiyone. Kyosuke has to find a way to become closer with Madoka, while, at the same time, trying not to hurt Hikaru’s feelings, which would incur the full wrath of Ayukawa, and not reveal his psychic powers. This is essentially a magical romantic love-triangle comedy, except, instead of the usual “magical girlfriend” we have a “magical boyfriend”. Madoka is frequently listed towards the top of the list of surveys of anime fans favourite anime “babes”; very sexy and very strong. The animation is very limited, as most 80s anime series were, but I think the character designs, again by Akemi Takada (Urusei Yatsura & Patlabor), are appealing, and some of the very 80s synth-pop theme songs are among my favourite anime songs, especially “Kanashii Heart wa Moeteiru wa!” (“My Sad Heart is Burning”).\nKimagure Orange Road: Summer's Beginning (movie) Very good\nMagical Girl Pretty Sammy (OAV) Very good\nMai Mai Miracle (movie) Masterpiece\nMetropolis (movie) Not really good It was a pretty movie to look at, and I had no problem with the retro-character designs. The problem I had with the film was the story was really the \"same old, same old\" theme of \"man puts his faith in his creation, but his creation turns against him\" that has been around since Mary Shelley wrote Frankenstein, as a science fiction teacher told me once (after I had asked him to show the first Patlabor film, another variation of the same theme, to the class but he refused for that reason; the Terminator films are yet another variant on the same theme). Also, there were scenes of protests that didn't really have much of an effect on the plot, nor were the motives of many of the characters, especially Duke Red, terribly well explained. I trust the original Osamu Tezuka manga from the Fifties explains everything a lot more fully, but if I need to read the manga to understand the context of what I see in the film, director Rintaro was not too successful. Plus, it's kind of a Sci-Fi cliché that if you have a really big tower that people compare to the Tower of Babel, chances are pretty fricking high it won't be standing by the end of the film. (I wonder if people 3000+ years from now will use the World Trade Center as an analogy the way we use the Tower of Babel?)\nMinami-ke (TV) Masterpiece\nMobile Suit Gundam 0080: War in the Pocket (OAV) Masterpiece A 6 episode made-for-video side story series, set in the original Gundam continuity during the last days of the One Year War, and absolutely nothing like Gundam Wing. Alfred is a kid living on a space station that is seemingly far removed from the conflict between the Earth Federation and the Zeon Archduchy. Since the war is so distant, the boys on the station see the war as almost like a game. Meanwhile, a Zeon attack on a space shuttle base at the North Pole fails to down a shuttle, which is believed to be carrying the Gundam, a powerful type of “mobile suit” (and the only one that exists at this time in this continuity). With several members of a Zeon strike force killed in the attack, the Zeon enlist Bernie, a young, inexperienced Zaku mecha pilot, into Operation Rubicon, to infiltrate the colony in which the Gundam is believed to be stored. The Zeon come to the colony, in the guise of construction workers, build their mecha in an abandoned warehouse, and launch a preliminary attack on the Federation, which is Al’s first time seeing a battle first hand. A Zaku mecha gets shot down, and Al immediately runs off to find it, encountering Bernie, who takes Al’s camera away in exchange for some of his pins. Al is so enthralled by his encounter, and dreams of being a pilot just like Bernie, traveling to the crashed Zaku at night, pretending to be in a battle. He falls asleep, and wakes up the next morning. Realizing that his mother would be furious that he wasn’t at home, he rushes back, but on the way, spots Bernie in a convoy of trucks. He runs after the trucks, grabs on to the end of one of them, and is able to find out where the Zeon strike force is located. The Zeon aren’t thrilled that a civilian knows who they are and what they are up to, and some of them even propose killing the boy, but that would create too much of an uproar and blow their cover. Bernie makes the boy a “special” member of the task force, and Al is eager to help them out. While Al sees it all as a game, his actions will have a profound effect on what happens next on the colony, and eventually Al has to bear the full burden of the emotional weight of the consequences without being able to tell anyone about what happened. A subplot of this series (that should have been better developed IMHO) is Bernie’s friendly relationship with Christina MacKenzie, Al’s lovely young neighbour who also happens to be a test pilot for the Federation. This Anime has the most effective horrors of war message of any anime I’ve seen, and is definitely my favourite science-fiction anime, because it deals with the effects of war on a personal basis. (I like it much better than Grave of the Fireflies in that regards, sorry.) It uses a boy as a protagioinist, but this isn’t an anime for kids; while there is much less on-screen action than other Gundam series, it isn’t afraid to show scenes of carnage, including dead kids, to drive its point home. Also of interest to Macross fans is that the character designs for this one are done by Haruhiko Mikimoto, the character designer for the original Macross TV series.\nMobile Suit Gundam 0083: Stardust Memory (OAV) Excellent A 13 episode series, also set in the original Gundam continuity, generally recognized by Gundam fans as the best Gundam of all, at least in terms of Gundam battles. 3 years after the defeat of the Zeon Archduchy, a splinter group commanded by Anavel Gato, a hero of the One Year War known as the “Nightmare of Solomon”, steal a revolutionary new type of Gundam, equipped with nuclear warheads, from a base in Australia, in their campaign to revive Zeon. Kou Uraki, a young Federation pilot, was unable to defeat Gato in the other Gundam unit, but was able to hold his own against Gato, which impresses the lovely Gundam technician Nina Purpleton, and makes him the lead pilot in the attempt to defeat Gato. I don’t have time to go much further in the plot, but the mecha designs are outstanding, the animation is fluid, the orchestral music complements the action very well, and the theme songs kick ass. It’s what Gundam Wing would look like if it didn’t have a limited TV budget.\nMy Neighbor Totoro (movie) Excellent\nNadia - The Secret of Blue Water (TV) Excellent\nNeon Genesis Evangelion (TV) Good\nNeon Genesis Evangelion: The End of Evangelion (movie) So-so The first half actually had some decent action sequences... but the second half, with all the pretentious artsy imagery flashed at epilepsy-inducing speeds and the stupid ending... BLEH! I felt like Mr. Garrison after sitting through Contact just to find out he alien was Jodie Foster's father...\nOh My Goddess! (OAV) Good the OMG! OVA series is a pleasant enough trifle, with great music and gorgeous character designs and enjoyable enough on its own merits, but, once you read the far superior manga, you tend to realize how shallowly the characters were developed. And, of course, there is the notorious opening sequence which featured Marller/Mara/Marla (not that I want to be too much of a fanboy, but there are two different official spellings of the character's name in North America alone) as well as displaying many other minor characters from the manga which indicated that they originally hoped to continue it well past 5 episodes.\nPatlabor 2: The Movie Excellent\nPatlabor the Mobile Police (TV) Excellent A series from the creative team known as Headgear, which includes director Mamoru Oshii (Ghost in the Shell). In the near future, human-piloted robots called “Labors” are developed, mainly to be used for construction purposes (particularly to build the giant dykes needed to protect Tokyo from the rising waters of the Pacific Ocean). Unfortunately, Labors also prove to be of great use to criminals and terrorists, so the Tokyo Metropolitan Police sets up a unit of police Labors, officially called Ingrams but better known as Patlabors (PATrol LABOR), complete with giant-sized revolvers, to keep crime at bay. Although this series at first seems to revolve around the rather simplistic one-dimensional characters (spunky and cute Noa Izumi; short-tempered and trigger-happy Isao Ohta, etc…) who are the pilots and support crews of the Second Special Vehicles Unit (SV2), after a few episodes you’ll realize that the true protageonists are the section chiefs: SV2 Chief Kenichi Goto, whom often acts slow-witted but is in fact is known as the “Razor” for his sharp sense of insight, and SV1 Chief Shinobu Nagumo, a highly professional woman with a strong moral compass who isn’t afraid to stand up against the actions of her own superiors in the police and the government. This is one of my personal favorites because the series includes a vast spectrum of different kinds of episodes, from serious action-drama, to high level government conspiracies and cover-ups, to (Japanese) political and cultural satire, to all-out slapstick comedy. One classic episode basically consists of one long argument between two female officers, one of whom believes that it is better to memorize facts, while the other thinks that what is important is the ability to be able to retrieve information quickly. Another episode is a parody of the rubber-suit series Ultraman.\nPatlabor The Mobile Police (OAV 1/1988) Very good\nPatlabor The Mobile Police: The New Files (OAV 2/1990) Masterpiece\nPatlabor: The Movie Excellent\nPrincess Mononoke (movie) So-so Some scenes are great, but much of the movie are vistas that stay on the screen for way too long, and I get the idea that an entire half-hour could be cut from the movie (when they were making it... I'm not talking about hacking-and-slashing the final cut the way Nausicaa was butchered into Warriors of the Wind in the mid 80s) without taking away from the story. When I saw it the first couple of times, during some scenes I was indeed looking at my watch, and I'm glad I can skip ahead on the DVD. Also, while I recognize that it is a good movie, personally, the smaller, more intimate Ghibli films are more my bag than the sweeping epics. And, for anime with an environmental subtext that doesn't beat you over the head, I far prefer Yokohama Shopping Log, where something happened to the planet, and to Japan specifically, decades before (the oceans rose, but that's not the only thing) yet it's never spoken of, just hinted at.\nProgram (OAV) Not really good\nProject A-Ko (movie) Masterpiece\nProject A-Ko 2: Plot of the Daitokuji Financial Group (OAV) Good\nRevolutionary Girl Utena: The Movie Excellent\nRoyal Space Force - The Wings of Honnêamise (movie) So-so As an alternate reality space race story with a fair deal of comic relief, I liked most of it up until the ending... which, well, I won't describe in any detail, but there's a fine line between \"poetic\" and \"pretentious\", and, while a lot of anime fans find themselves on the \"it's poetic\" side of the line (which is fine; it's their subjective opinion, neither right nor wrong), I'm on the other side of the line. It just soured the experience for me. Also, the religious aspect in the film should have been more fully explored, and the attempted rape scene was just extraneous.\nSailor Moon (TV) Masterpiece\nSailor Moon R (TV) Very good\nSailor Moon S (TV) Excellent\nSakura Wars: The Movie So-so\nSecond Renaissance (OAV) So-so\nSpirited Away (movie) Decent I liked it as a pleasant-enough kids' movie, but it's overlong and bits of it do drag and its winning the Oscar just cemented my position that it is quite overrated. I didn't connect with it on any level except as an Asian variant on Alice in Wonderland. I certainly wasn't enchanted or captivated or taken back to my own childhood, or anything else the critics told me I should feel when I see it. I was rooting for Lilo & Stitch in the Oscar race, and I think Kiki's Delivery Service is grossly underrated in terms of Miyazaki-directed Ghibli films.\nStrawberry Marshmallow (TV) Masterpiece\nSuper GALS (TV) Masterpiece\nTenchi in Tokyo (TV) Good\nTenchi Muyo Movie 1: Tenchi in Love Masterpiece\nTenchi Muyo Movie 2: Daughter of Darkness Very good\nTenchi Muyo Movie 3: Tenchi Forever Excellent\nTenchi Muyo! (OAV 1/1992) Excellent\nTenchi Muyo! Mihoshi Special Excellent\nTenchi Universe (TV) Masterpiece One of the better know anime series on this list, relatively speaking, because of its airing on the Cartoon Network and even before then (though I can’t watch Cartoon Network in Canada, so my own liking of it is quite independent of that), so I don’t feel like going too much into depth as to what it’s about. You know: alien love triangle, Tenchi, a boy with an unusual heritage and a sword, Ryoko, the cute female space pirate, Ayeka, the cute alien princess with a nasty streak, etc… Add a cute ditzy blonde Galaxy Police officer who usually gets her man in spite of herself (and ahem, her competent partner, one of the most perfect women ever animated in some of the continuities), a cute mad scientist, and a cute younger princess for the “lolicom” viewers and shake. Also, depending on the continuity, there’s a whole lot of crazy crap about goddesses. Sort of a (mostly) straight-faced parody of “space operas” and magical girlfriend anime, and, aside from the movies, inconsequential fluff with absolutely no artistic merit, but I really enjoy it. I am in the minority of Tenchi fans that puts the first Tenchi Muyo TV series (called Tenchi Universe in English) over the original Tenchi Muyo! Ryo-Ohki! OVA series, since I’m a Kiyone fan and she doesn’t appear in the soon-to-be continued OVA continuity, as well as because some of the more screwed up, ambiguous stuff from the OVA continuity (like the stuff about the goddesses, as well as the link between Sasami and Tsunami) doesn’t appear in the TV series. Shin Tenchi Muyo (Tenchi in Tokyo), is sort of the black sheep relative that few Tenchi fans like to talk about… I don’t think it’s a bad series, it’s enjoyable enough on its own merits, but part of me wishes they had just come up with completely different characters so I needn’t compare it to the two. I’m looking forward to seeing Tenchi Muyo GXP, even if Kiyone doesn’t appear, since the Galaxy Police is my favourite element in the series, though, since this one does have an entirely different cast, it may warrant its own entry when I update this list.\nUrusei Yatsura: Always My Darling (movie) Very good\nUrusei Yatsura: Beautiful Dreamer (movie) Masterpiece\nUrusei Yatsura: Only You (movie) Excellent\nUrusei Yatsura: Remember My Love (movie) Good\nWhisper of the Heart (movie) Masterpiece\nYokohama Kaidashi Kikou (OAV) Masterpiece Hmm... I actually like the manga a tiny bit more than the anime, but the manga's not listed. The first anime series follows the manga stories pretty much panel by panel, but they only show some of the manga stories from the first 3 volumes. The character designs are better than the second OVA series.\nYokohama Kaidashi Kikou: Quiet Country Cafe (OAV) Masterpiece The character designs are better in the first OVA series, but the animation in the newer series looks a bit slicker. Also, the backgrounds are more lush. But it takes a few more liberties with the manga stories... and they cut out the sequence from the Nai story wherein Alpha goes on an airplane flight, probably because it would have been too expensive to animate.\nYou're Under Arrest (OAV) Masterpiece Oh My Goddess creator Kosuke Fujishima’s original manga series about two young female police officers, Natsumi Tsujimoto and Miyuki Kobayakawa, who patrol around the streets of Bokuto, a fictional neighbourhood of Tokyo that seems to be somewhere within the Minato-ku ward, in their customized Honda Today (also known as the Honda Beat) mini patrol car. Natsumi is strong but a little too brash, whilst Miyuki is an excellent driver and a genius with mechanics. Miyuki also happens to love the hunky, if a little slow-witted, motorcycle cop Ken, who loves her back but neither one has the courage t o disclose their true feelings to each other, a situation that must be solved by Yuriko, an even younger female police officer (does the Tokyo Metropolitan Police usually recruit officers straight out of juniour high?) who decides to act as an Emma-like matchmaker for the two, although, like Emma, she’s a little “clueless”. There’s also Aoi, a male police officer who once dressed as a woman for an undercover assignment and liked it so much that he never wore a men’s uniform again. Aside from the usual traffic violators and petty criminals (whose capers frequently seem to involve the theft of women’s lingerie or swimsuits), the duo also has to keep an eye open for Strikeman, a baseball-themed vigilante “superhero” who likes to knock out lawbreakers with his bat and balls (the baseball kind I mean). One especially nice touch about You’re Under Arrest is that it shows that Japanese police officers (at least the type that you find on the street, or in neighbouhood corner “police boxes”) are very interested and involved in their communities. Not only do Natsumi and Miyuki know the name of every child at the Bokuto kindergarten, the kids aren’t the slightest bit intimidated by the officers, who frequently drop by the schoolyard to chat. The animated version of You’re Under Arrest started with 4 made-for-video episodes (1994-95) continued with a TV series (1996-97), 18 animated shorts (1998-2000?), a theatrical movie (1999) and a second TV series (2001). In my opinion, Tokyo Typhoon Rally, the second episode of the original TV series, contains the finest car chase ever animated, with several complex first-person “point-of-view” shots. Both the manga and the animated series have gorgeous character designs, and both also feature extensively detailed vehicles that don’t distort as the camera changes perspectives. (The character designs for the anime were done by Atsuko Nakajima who also did the anime character designs for Ranma ½ so Ranma fans will be forgiven if they think that Natsumi looks an awful lot like Nabiki Tendou.) However, for those of you that have seen the first four episodes, the TV series and the animated shirts were done on a much more limited budget, so the animation is nowhere near as lavish as it was in the OVAs.\n",
  "response": "### **1. Overall Scene Theme and Core Concept**  \n**Magical Research Library & Workshop**  \nInspired by the magical girl aesthetic of *Cardcaptor Sakura* and the chaotic interdimensional elements of *Urusei Yatsura*, this scene is a **hidden magical research library and workshop** where enchanted artifacts, rogue spellbooks, and unstable dimensional rifts require constant monitoring and containment. The space is inherently collaborative—some objects are too dangerous or heavy for one person to handle, tasks require specialized knowledge (arcane, mechanical, or alchemical), and multiple agents must coordinate to prevent magical disasters.  \n\n### **2. Spatial Layout and Area Descriptions**  \nThe scene comprises **four interconnected areas** within a sprawling, slightly dilapidated Victorian-era mansion repurposed for magical study:  \n\n1. **Central Atrium (Grand Library)**  \n   - A towering two-story chamber with wrought-iron staircases, flickering gas lamps, and bookshelves sagging under ancient tomes.  \n   - **Atmosphere:** Dust motes float in amber light; the air hums with latent magic. A massive **dimensional rift** hovers near the ceiling, slowly expanding.  \n\n2. **Alchemy Lab (East Wing)**  \n   - Cluttered with alembics, glowing vials, and a stained granite worktable.  \n   - **Atmosphere:** Ozone and sulfur scents; a broken **automated potion stirrer** leaks blue fluid into floor grates.  \n\n3. **Artifact Vault (West Wing)**  \n   - Reinforced steel door (stuck halfway open); walls lined with lead-lined cabinets.  \n   - **Atmosphere:** Cold, with a faint echo of whispering voices. A **misplaced Clow Card** (resembling a fluttering butterfly) darts between shelves.  \n\n4. **Mechanical Workshop (Basement)**  \n   - Exposed pipes, a dormant **steam-powered guardian golem**, and scattered tools.  \n   - **Atmosphere:** Grease and burnt copper; a **broken teleportation pad** sparks intermittently.  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **Central Atrium (Grand Library)**  \n**a. Anchor Furniture & Installations:**  \n- A **10ft-tall brass \"knowledge engine\"** (resembling a pipe organ with typewriter keys) used to decode encrypted grimoires. One pedal is missing.  \n- **Rotating ladder system** (jammed at a 45-degree angle; requires 2+ agents to unstick).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"The Fractured Atlas\"**: A book bound in dragonhide, floating midair and emitting violet sparks (contains unstable spatial magic; must be resealed with a silver clasp *located in the vault*).  \n- **Kero-chan’s Perch**: A velvet cushion with a tiny bell (when rung, summons the guardian spirit—if he’s not napping).  \n\n**c. Functional Ambient Objects:**  \n- **Self-inking quills** (hovering over parchment, transcribing random phrases).  \n- **Levitating lanterns** (one flickers erratically due to a trapped fire sprite).  \n\n**d. Background & Decorative Objects:**  \n- **Portrait of a frowning wizard** (eyes follow movement; whispers critiques in Latin).  \n- **Pile of \"cursed\" teacups** (stacked precariously; one has a chip shaped like a crescent moon).  \n\n---  \n\n#### **Alchemy Lab (East Wing)**  \n**a. Anchor Furniture & Installations:**  \n- **Iron cauldron** (3ft diameter, bolted to the floor; contains a bubbling **time-slowed potion**—ingredients separate if agitated).  \n- **Crystal condenser** (cracked; drips luminescent gel into a clogged drain).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **The \"Corrosive Vial\"**: Blue-capped bottle labeled *\"aqua regia\"* (handwritten note: *\"DO NOT MIX WITH GOLD\"*). Nearby, a **gold-plated stirring rod** rests in a beaker.  \n- **Pheonix-feather duster** (needed to clean the rift stabilizer in the atrium).  \n\n**c. Functional Ambient Objects:**  \n- **Self-heating kettle** (whistling softly; steam forms tiny cloud shapes).  \n- **Clockwork rat** (scurries under cabinets; drops cogs as it moves).  \n\n**d. Background & Decorative Objects:**  \n- **Failed homunculus** (a blob in a jar; presses hands against glass).  \n- **Chalkboard** (half-erased equations; someone has drawn a frowny face).  \n\n---  \n\n*(Continued for Vault & Workshop...)*  \n\n### **4. Scene Affordances and Embedded Potential**  \n- **Collaborative Transport**: The **knowledge engine’s missing pedal** (weight: 80kg; requires two agents to lift) is buried under collapsed shelves in the vault.  \n- **Reasoning Challenge**: Among five nearly identical **\"Clow Card\" replicas** in the vault, the real one has:  \n  - A **scorch mark** on the lower edge.  \n  - Slightly **warmer to the touch**.  \n  - **Faint hum** (masked by the ambient whispers).  \n- **Tool-Use Puzzle**: The **stuck vault door** can be pried open with the **guardian golem’s wrench** (basement), but the golem must be reactivated first using a **missing cog** (dropped by the clockwork rat).  \n\n---  \n**Final Touch**: The **dimensional rift** periodically spits out objects (a rubber duck, a monocle, a live crab)—harmless but distracting. Agents must prioritize tasks before the rift destabilizes further.  \n\n---  \nThis scene thrives on **density** (every object has purpose), **collaborative friction** (heavy/distant tools), and **layered puzzles** (attribute matching, tool chains). The mundane clutter (e.g., teacups, doodles) adds realism while complicating perception tasks."
}