{
  "id": 1134,
  "raw": "\nRetrieved from http://www.bu.edu/academics/cas/programs/modern-languages-comparative-literature/minor-arabic/\nText:\nMinor in Arabic\n\nThe minor in Arabic is for students who seek to become proficient in the Arabic language and acquire a good grasp of Arab cultural trends. Our curriculum of CAS LY courses emphasizes Modern Standard Arabic (the variety of the language understood by educated native speakers and used in media and official communications across the Arab world) while providing some exposure to Levantine Colloquial and other dialects. We use the most widely taught textbook series, Al-Kitaab, supplemented with authentic materials (videos, songs, advertisements, magazines and newspapers, menus, etc.). After completing the prerequisite four semesters of language work, Arabic minors take three to four semesters of additional language courses and one to two courses in Arabic literature or Arab culture. They may also take one non-LY course in a relevant second language or some aspect of Arab politics or culture. Students are encouraged to study abroad in Rabat (Morocco) or elsewhere. Graduating Arabic minors have gone on to jobs in government, in nonprofits such as the Arab-American Chamber of Commerce, and to graduate programs in Arabic and Near Eastern Studies.\n\n\nSix courses with a grade of C or higher. With advisor’s approval, students may include up to three transfer courses from other colleges, universities, or non-BU study abroad programs. At least three courses must be taken on the Charles River Campus. Internships taken through Boston University or other study abroad programs may not be credited toward the minor offered in Arabic.\n\nUnless otherwise noted, all required courses are 4 credit hours.\n\n  1. CAS LY 303 and LY 304 (unless equivalent proficiency is shown, in which case the advisor will determine substitute courses).\n  2. one or two additional Arabic language courses numbered CAS LY 214 or above (may include LY 572; may include LY 350 if not also counted for literature).\n  3. One or two of the following literature and culture courses: CAS XL 223, LY 284, LY 341, LY 350, LY 441, LY 470, LY 471, XL 540.\n  4. at most, one related non-LY CAS course to be approved by the minor advisor. This non-LY course should focus substantially on a relevant second language (e.g., Hebrew, Persian, Turkish, French, or an African language), on linguistics (with an LX number), or on the art, religion, history, politics, etc. of the Arab world.\n",
  "response": "### **Scene Concept: \"The Al-Kitaab Language & Cultural Research Center\"**  \n\n#### **1. Overall Scene Theme and Core Concept**  \nA bustling university research center dedicated to Arabic language, literature, and cultural studies. The space serves as both an academic hub and a resource library, where students, professors, and visiting scholars collaborate on translations, archival research, and multimedia projects.  \n\n**Why Multi-Agent?**  \n- **Heavy/Multiple Objects:** Manuscripts, archival boxes, and multimedia equipment require coordinated transport.  \n- **Specialized Tasks:** Some workstations are language-specific (e.g., Levantine vs. Modern Standard Arabic), requiring agents to fetch correct materials.  \n- **Time-Sensitive Coordination:** Certain tasks (e.g., digitizing fragile documents, preparing for a guest lecture) require parallel workflows.  \n\n---  \n\n#### **2. Spatial Layout and Area Descriptions**  \nThe center is housed in a repurposed 1930s academic building, with high ceilings, wooden bookshelves, and a mix of modern and antique furnishings. The main areas:  \n\n1. **Main Research Hall** – Open workspace with long tables, computers, and reference materials.  \n2. **Archival Storage Room** – Climate-controlled, containing rare books, manuscripts, and media recordings.  \n3. **Media Lab** – For digitizing old texts, editing audio recordings, and preparing cultural exhibits.  \n4. **Professor’s Office** – A cluttered but organized workspace with personal research materials.  \n5. **Seminar Nook** – A small, carpeted corner with floor cushions for informal discussions.  \n6. **Supply Closet** – Packed with stationery, translation aids, and recording equipment.  \n\n---  \n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **Main Research Hall**  \n**a. Anchor Furniture & Installations:**  \n- A **12-person oak table**, scratched from years of use, with built-in power outlets.  \n- **Floor-to-ceiling bookshelves** (3m tall) holding reference books, organized by dialect (MSA, Levantine, Egyptian).  \n- **A rolling ladder** (slightly wobbly) for accessing high shelves.  \n- **A large corkboard** with pinned student theses, flyers for study abroad programs, and a faded Arabic calligraphy poster.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Al-Kitaab\" textbook set** (Vols. 1-3) on a designated shelf, one missing (needed for a class).  \n- **A locked glass display case** containing a **19th-century Moroccan manuscript**, requiring a key from the professor.  \n- **A partially translated document** (Levantine dialect) on a student’s desk, with handwritten notes in red ink.  \n- **A projector** (needs HDMI cable adjustment) for an upcoming lecture.  \n\n**c. Functional Ambient Objects:**  \n- **Desk lamps** (one flickering intermittently).  \n- **A label printer** (low on tape) for cataloging.  \n- **A coffee station** (drip machine half-full, sugar jar nearly empty).  \n- **Three desktop computers** (one displaying an error message in Arabic script).  \n\n**d. Background & Decorative Objects:**  \n- **Framed photos** of past study abroad groups in Rabat.  \n- **A decorative brass astrolabe** (non-functional) on a side table.  \n- **A dusty potted fern** (needs watering).  \n- **A stack of old exam papers** in a recycling bin.  \n\n---  \n\n#### **Archival Storage Room**  \n**a. Anchor Furniture & Installations:**  \n- **Metal rolling shelves** (2.5m tall, 300kg when fully loaded).  \n- **A humidity control panel** (displaying 45% RH, slightly off target).  \n- **A large flatbed scanner** for delicate documents.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **A sealed archival box** (labeled \"1960s Egyptian Radio Broadcasts\") requiring two people to lift (25kg, awkward dimensions).  \n- **A locked drawer** containing master keys, accessible via a combination (written on a sticky note in the professor’s office).  \n- **A damaged 17th-century Quran page** (needs careful handling before digitization).  \n\n**c. Functional Ambient Objects:**  \n- **White cotton gloves** (some pairs torn).  \n- **A magnifying glass** (scratched lens).  \n- **A step stool** (one loose screw).  \n\n**d. Background & Decorative Objects:**  \n- **An outdated microfilm reader** (unplugged, covered in dust).  \n- **A corkboard with yellowed newspaper clippings** about Arab poets.  \n- **A forgotten lunchbox** (left by a student months ago).  \n\n---  \n\n#### **Media Lab**  \n**a. Anchor Furniture & Installations:**  \n- **A soundproof recording booth** (door squeaks).  \n- **A dual-monitor editing station** (left monitor has a dead pixel).  \n- **A large format printer** (paper jam history light blinking).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **An unlabeled USB drive** (contains interview recordings in Moroccan Arabic).  \n- **A mis-shelved DVD** (Levantine folk songs, needed for a project).  \n- **A mixer board** (left channel cutting out intermittently).  \n\n**c. Functional Ambient Objects:**  \n- **Noise-canceling headphones** (one pair missing an ear pad).  \n- **A pile of blank CDs** (some scratched).  \n- **A backup external hard drive** (nearly full).  \n\n**d. Background & Decorative Objects:**  \n- **A poster of Fairuz**, the Lebanese singer.  \n- **A half-empty bottle of lens cleaner**.  \n- **A sticky note reading \"Don’t erase!!\"** (on the whiteboard).  \n\n---  \n\n### **4. Scene Affordances and Embedded Potential**  \n\n#### **Collaborative Transportation Affordances:**  \n- **The archival box (25kg, bulky)** in the storage room requires two agents—one to stabilize the shelf while the other lifts.  \n- **The oak table** can be reconfigured for events, but its weight (120kg) means multiple agents must coordinate moving it.  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:**  \n  - Among five similar **USB drives** (all black), the correct one has a small green sticker and is 64GB (others are 32GB).  \n  - A student’s **backpack** holds the missing Al-Kitaab textbook, identifiable by its torn cover corner and a coffee stain.  \n- **Compound (Tool-Use) Reasoning:**  \n  - **Problem:** The manuscript display case is locked.  \n  - **Solution:** The key is inside the professor’s desk drawer, which itself requires finding a paperclip (in the supply closet) to jimmy the stuck lock.  \n\n---  \n\n### **Final Notes on Atmosphere & Potential Tasks**  \n- The **hum of the scanner**, **murmured conversations in Arabic**, and **the smell of old paper** create a lived-in academic space.  \n- Potential tasks:  \n  - **Collaborative:** Rearrange furniture for a guest lecture while ensuring no fragile items are disturbed.  \n  - **Diagnostic:** Fix the flickering lamp (requires checking the bulb and outlet).  \n  - **Search & Retrieval:** Find a specific folk song recording among unlabeled CDs.  \n  - **Precision Handling:** Carefully digitize the damaged Quran page without tearing it further.  \n\nThis environment is **dense with intentional clutter**, making tasks require **observation, collaboration, and multi-step reasoning**. Agents must navigate physical constraints, ambiguous labels, and interdependent tools—just like a real research center."
}