{
  "id": 1153,
  "raw": "\nRetrieved from http://www.hemmings.com/mus/stories/2004/10/01/hmn_feature22.html\nText:\nSpeedobilia: 10/04\n\nThe Birth of Ford Factory Racing--Photo CD\nPin It\n\nFeature Article from Hemmings Muscle Machines\n\nOctober, 2004 - Daniel Strohl\n\nThe Birth of Ford Factory Racing - photo CD\nDick Brannan * 770-519-0081 * www.dickbrannan.com * $19.95\n\nHistory can often be a controversial subject. The axiom that tells us only the winners write it, all too often proves true in motorsports-who reads about the guy that placed last in the Indianapolis 500? At the same time, history is only continued when it is recorded, so we often get a skewed account of the past solely through omission. So it pays to record as much history as possible, from as many viewpoints as possible.\n\nThe history of Ford's Factory Drag Racing program, which stewed up the legendary Thunderbolts, the SOHC Mustangs and the Boss Mavericks from the early Sixties through the next decade or so, has been recorded in many ways over the years from several viewpoints, and these accounts from Dick Brannan only serve to complete those viewpoints. His photo CD includes a discussion of Dick's involvement with the program as well as dozens of photos from Dick's collection, including many rare photos and drawings of the SOHC Super Mustang drag car driven by Tom McEwen.\n\nWe can appreciate the historical aspects of the CD, but the single-source bias in the stories presented makes us wonder what's been left out-where are the losers' stories? The merchandising present throughout the effort (prints of the photos are available through the website, but only with Brannan's autograph) also leaves us wondering about the actual motives behind this CD, subtitled \"For the Preservation of History.\" But for Ford completists who run a Windows operating system (the CD doesn't run on Macs), it may prove a good resource.\n\n- By Daniel Strohl\n\nDiggers, Funnies, Gassers and Altereds: Drag Racing's Golden Age\nBob McClurg * CarTech Books * 800-551-4754 * www.cartechbooks.com * $39.95\n\nDrag racing has always been a sport of the senses. You smell the burnt rubber and the VHT, you feel more than hear the pulsating thunder of the engines, and your eyes take in so much as the cars pound the quarter mile. Until we develop the smell-o-graph, though, the best we can do to preserve the action is through photography, and one of the most prolific drag photographers has been Bob McClurg.\n\nMcClurg became best known for his photograph of \"Wild Willie\" Borsch headed sideways down the track in the famous Winged Express at the 1970 NHRA Winternationals, but has made an entire career out of shooting drag races for newspapers and magazines since the early Sixties. The hardbound, 203-page book charts much of the evolution of drag racers, from the most primitive examples of the Thirties through the Funny Cars and Pro Stockers of the Seventies, using mostly photos McClurg shot, but borrowing from other photographers here and there to illustrate certain periods or events.\n\nWhile the book isn't a comprehensive history-it can't be when it covers so many different eras of drag racing-it does a coffee-table job of highlighting the differences between, the reasons for and the influences on the various drag genres via the many color and black-and-white photographs of the different eras. McClurg also does a decent job of pointing out so many different examples from each period and giving brief histories to each of the hundreds of cars and drivers he has included here, many of whom were local heroes who rarely received any notoriety or exposure outside of their respective neighborhoods.\n\n- By Daniel Strohl\n\nHow To Build Max-Performance Pontiac V-8s\nJim Hand * CarTech Auto Books * 800-551-4754 * www.cartechbooks.com * $18.95\n\nIt's amazing that it has taken more than 30 years for someone to come to their senses and publish a book on building Pontiac V-8s, because what this hobby clearly does not need is another \"How To Build a Chevy Small-block\" book.\n\nThe author, Jim Hand, has written several Pontiac tech articles during the last 15 years, has been racing and building Pontiacs since the Sixties and even bought a new Pontiac back in 1955. So his credentials are valid beyond reproach.\n\nLike Jim's tech articles that have appeared in numerous car magazines, the information that he provides is well written, concise, and easy to understand. And when referencing a part or a modification, Jim uses pointers to visibly show the reader what he is talking about.\n\nEverything you need to know about which parts to use and how to make modifications-and why-is discussed. The chapters on cam selection and intake manifold comparisons are highly informative, and the chapter on porting D-port heads I found especially appealing. Yet discussion of the most important aftermarket part ever produced for Pontiacs, Edelbrock's aluminum cylinder heads, is conspicuously absent; we hope this major oversight will be corrected in subsequent reprints.\n\nThis 128-page softbound book features 300 black and white photos, yet costs only $18.95. Best of all, the content is 100% pure Pontiac specific, not generic engine building tech. Well done, CarTech. Now let's see similar books for AMC, Buick and Olds.\n\n- By Richard Lentinello\n\n\nOrder Backissues of Hemmings Muscle Machines       |       Subscribe to Hemmings Muscle Machines\n\nReader Comments\n\nHemmings Muscle Machines\n\nOrder Backissues of Hemmings Muscle Machines\n",
  "response": "### **Scene Concept: \"Thunderbolt Garage – A Collaborative Drag Racing Workshop\"**  \n\n**1. Overall Scene Theme and Core Concept:**  \nA bustling, grease-stained garage from the golden age of drag racing (1960s-70s), where a team of mechanics, fabricators, and drivers collaborate to prepare, modify, and maintain high-performance dragsters. The environment is inherently multi-agent due to the heavy machinery, precision tools, and time-sensitive tasks requiring coordination—whether lifting an engine block, tuning a nitrous system, or troubleshooting a misfiring Thunderbolt V8.  \n\n---  \n\n### **2. Spatial Layout & Area Descriptions**  \nThe garage is divided into **four key zones**, each with distinct purposes:  \n\n1. **Main Work Bay** – The central hub, housing two raised drag cars (a Ford Thunderbolt and a SOHC Mustang) on hydraulic lifts. Oil-stained concrete, tool chests, and overhead fluorescent lights flicker slightly.  \n2. **Fabrication Corner** – Welding station with a metal lathe, sheet metal bender, and racks of raw steel tubing. Sparks occasionally fly from an active grinder.  \n3. **Parts & Inventory Storage** – Steel shelving crammed with labeled bins (pistons, gaskets, carburetors) and a wall of vintage racing tires. A chalkboard tracks part orders.  \n4. **Driver’s Prep Area** – A cluttered desk with rolled blueprints, a stack of NHRA rulebooks, and a coffee-stained logbook. A small fridge hums in the corner.  \n\n---  \n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. Main Work Bay**  \n**Anchor Furniture & Installations:**  \n- Twin hydraulic lifts (3-ton capacity), one holding the Thunderbolt (weight: 3,200 lbs, exposed engine bay), the other a disassembled SOHC Mustang.  \n- A rolling engine crane (max lift: 500 lbs) parked near a rebuilt 427 V8 on a reinforced stand.  \n- Floor-to-ceiling pegboard wall with outlined tool silhouettes (missing a ½” torque wrench).  \n\n**Key Interactive & Task-Relevant Objects:**  \n- **Nitrous Oxide Bottle** (marked \"DANGER – 900 PSI\"), secured in a steel bracket but with a leaking gauge.  \n- **Bent Pushrod** (on the workbench, next to a micrometer for measuring warp).  \n- **Ignition Timing Light** (hanging from a hook, battery dead).  \n\n**Functional Ambient Objects:**  \n- Air compressor (hissing slightly, pressure at 80 PSI).  \n- Rolling tool cart with a sticky drawer (jammed by a stray Allen wrench).  \n- Radio playing static-laced AM coverage of a 1971 NHRA event.  \n\n**Background & Decorative Objects:**  \n- Framed photo of \"Wild Willie\" Borsch’s Winged Express mid-wheelstand.  \n- Faded \"Safety First\" poster with a torn corner.  \n- Coffee mug (\"World’s Best Wrench\") holding loose bolts.  \n\n---  \n\n#### **B. Fabrication Corner**  \n**Anchor Furniture & Installations:**  \n- Industrial welding table (scorched surface, clamp vise attached).  \n- Bridgeport milling machine (dusty, but powered on).  \n\n**Key Interactive & Task-Relevant Objects:**  \n- **Custom Headers** (half-welded, one flange misaligned).  \n- **Bent Roll Cage Tube** (marked \"REJECT – ¼” deviation\").  \n\n**Functional Ambient Objects:**  \n- Angle grinder (cord tangled around its stand).  \n- Calipers resting on a shop manual open to \"Tube Notching Techniques.\"  \n\n**Background & Decorative Objects:**  \n- Stack of Hot Rod magazines (1970 issues).  \n- Chalk sketch of a chassis modification on the wall.  \n\n---  \n\n#### **C. Parts & Inventory Storage**  \n**Anchor Furniture & Installations:**  \n- Steel shelving unit (6’ tall, slightly rusted), bins labeled with grease-pencil.  \n- Tire rack (four Goodyear Blue Streaks, one bald).  \n\n**Key Interactive & Task-Relevant Objects:**  \n- **Mystery Carburetor** (no tag, but serial number \"C-456\" etched on flange).  \n- **Last Bottle of Leaded Race Fuel** (yellowed label: \"104 Octane – 1972 Batch\").  \n\n**Functional Ambient Objects:**  \n- Parts washer (fluid low, sludge visible).  \n- Scale for balancing injectors (needs calibration).  \n\n**Background & Decorative Objects:**  \n- Cobwebbed trophy (\"1969 Divisional Champions\").  \n- Outdated \"Pontiac V8 Manual\" buried under a rag.  \n\n---  \n\n#### **D. Driver’s Prep Area**  \n**Anchor Furniture & Installations:**  \n- Steel desk (one leg propped on a shop manual).  \n- Wall-mounted NHRA event calendar (October 1971 circled).  \n\n**Key Interactive & Task-Relevant Objects:**  \n- **Logbook** (open to notes: \"Lifter noise @ 6,500 RPM – check pushrods\").  \n- **Track Blueprint** (with handwritten notes on ideal shift points).  \n\n**Functional Ambient Objects:**  \n- Rotary phone (off-hook, faint dial tone).  \n- Under-desk mini-fridge (door slightly ajar, condensation dripping).  \n\n**Background & Decorative Objects:**  \n- Ashtray full of cigarette butts.  \n- Framed newspaper clipping: \"Local Hero McEwen Sets New ET Record.\"  \n\n---  \n\n### **4. Scene Affordances & Embedded Potential**  \n\n**Collaborative Transportation Affordances:**  \n- **The 427 V8 Engine Block** (500 lbs, requires two agents to maneuver onto the crane).  \n- **Spare Drag Radial Tire** (180 lbs, awkward 30” diameter – needs a dolly or team lift).  \n\n**Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:**  \n  - Among five oil cans on the shelf, only one has a **red stripe** and **\"Racing Only\"** label (the rest are conventional). Buried behind an old rag, making visual ID harder.  \n- **Compound Tool-Use:**  \n  - **Problem:** The nitrous bottle leaks due to a **faulty pressure gauge**.  \n  - **Solution:** The **replacement gauge** is in the parts bin, but it’s behind the bald tire (forcing navigation/search).  \n\n---  \n\n**Final Notes:**  \nThis garage is a **dense, purposeful playground** for multi-agent collaboration—heavy objects demand teamwork, while intricate tasks (diagnosing engine issues, fabricating parts) require role specialization. The ambient clutter (magazines, irrelevant manuals) adds realism, forcing agents to filter signal from noise. The scene is **ripe for tasks** like:  \n- Coordinating an engine swap.  \n- Troubleshooting the nitrous system leak.  \n- Fabricating a replacement roll cage tube.  \n\nThe **golden-age drag racing aesthetic** (nostalgic, tactile, slightly chaotic) ensures every object feels **lived-in and mission-critical**."
}