{
  "id": 1151,
  "raw": "\nRetrieved from http://www.greatschools.org/print-view/special-education/LD-ADHD/996-idea-2004-close-up-disciplining-students-with-disabilities.gs?fromPage=1\nText:\nIDEA 2004 Close Up: Disciplining Students With Disabilities\n\n\nBy Candace Cortiella, The Advocacy Institute\n\n\nLike all students, those with disabilities can be suspended or expelled for violating the school's code of conduct. However, IDEA provides some additional procedures that schools must follow when disciplining students with disabilities. These procedures were put into IDEA to prevent schools from suspending or expelling students without considering the effects of the child's disability. These procedures are different depending on:\n\nKnow Your Child's Code of Student Conduct\n\nSchools have a responsibility to make sure that all students, including those receiving special education, are familiar with the school's code of student conduct. Parents also have a responsibility to understand their child's school code of conduct and help their child understand the expectations and consequences involved with violating the code. Your child's Individualized Education Program (IEP) team should determine any specialized help and instruction the child may need to understand the code and consistently demonstrate the appropriate classroom and school behaviors, including a functional behavioral assessment and a behavior intervention plan.\n\nSchools Can Make Case-by-Case Determinations\n\nIDEA 2004 provides school personnel with the authority to consider any unique circumstances on a case-by-case basis when making a determination to discipline a student with a disability. This provision provides flexibility for school personnel who are often operating within a district's \"zero-tolerance\" policy. A zero-tolerance policy usually requires school personnel to follow a suspension or expulsion policy for any student who violates the code of conduct, regardless of the circumstances. Now, school personnel may choose not to suspend a student with a disability if the unique circumstances lead school personnel to decide that suspension is not appropriate. Factors such as a student's disciplinary history, ability to understand consequences, expression of remorse and supports provided to the student prior to the violation of a school code of conduct could be unique circumstances considered by school personnel. In all cases, the disciplinary action considered for students with disabilities must be the same as for students without disabilities. In other words, school personnel may not increase a student's suspension because of the student's disability.\n\n\n\nIDEA 2004 Discipline Rules\n\nFor disciplinary actions lasting 10 school days or less:\n\n\nThe team must also determine if the conduct was the direct result of the school's failure to implement the student's IEP, including a behavior intervention plan. If the group decides that the student's behavior was a direct result of the school's failure to implement the IEP, the school must take immediate steps to remedy the deficiencies and return the student to his/her original placement.\n\nA Series of Short Removals Can Constitute a \"Pattern\" and a \"Change of Placement\"\n\nWhen frequent disciplinary actions add up to more than 10 school days in a school year, such removals may constitute a \"pattern.\" A pattern is indicated when the student's behavior and the length of removal is the same or similar to previous incidents , and the incidents are in close proximity to one another. A pattern of removals of 10 days or less, once they total more than 10 school days, carries the same requirements as a removal of more than 10 days and is considered a change of placement for the student. While the school has the responsibility for making a determination about whether a pattern constitutes a change of placement on a case-by-case basis, parents should be alert to a possible pattern developing when their child's misconduct is resulting in a series of disciplinary actions.\n\n\"Manifestation Determination\" - How Is Behavior Related to Disability?\n\nIDEA 2004 has made some significant changes to the manner in which a determination is made about the relationship between the student's behavior that leads to the disciplinary action, and the student's disability. These changes will make it more difficult than was previously the case to establish a connection between disability and behavior, and to reach a conclusion that the behavior resulted from the disability. The decision reached in the manifestation determination is important because it will influence what can happen to the student's continued services and placement.\n\nIn making the manifestation determination, the team (comprised of school personnel, the student's parents, and other relevant members of the student's IEP team) will review:\n\n\n  1. Considering the behavior subject to discipline, review the student's behavior to determine if it was caused by, or had a direct and substantial relationship to, the student's disability. For example, a student's low self-esteem, while possibly a by-product of a learning disability, is not alone sufficient to be considered a basis for finding a direct relationship between the student's disability and behavior.\n\nFinding of Manifestation\n\n\nIf the team finds that the student's behavior was related to the disability or an improperly implemented IEP, the student is returned to the original education setting unless the parents agree to a new placement as part of the behavior intervention plan.\n\nFinding of No Manifestation\n\n\n\nBe on the Alert for the \"Special Circumstances\"\n\nCertain offenses can lead to a student being moved to an interim alternative educational setting for up to 45 school days even if the conduct is determined to be related to the student's disability. Removing a student for these offenses does not require parent permission or agreement, nor does it require any involvement by a hearing officer or other impartial third party. These offenses are:\n\nIf a student carries or possesses a weapon:\n\n\nIf a student has inflicted serious bodily injury upon another person:\n\n\nParent Right to Appeal\n\nParents have the right to challenge any decisions made regarding the interim alternative educational setting or the determination regarding the \"manifestation determination\" by asking for a due process hearing. Schools can also request a hearing if school personnel feel that returning a student to the original educational setting is highly likely to result in injury to the student or to others.\n\nIn either case, the hearing must be \"expedited\" by:\n\nIDEA 2004 made an important change to the placement of students during this appeal process. Before, a student was to remain in his or her current educational placement during the appeal process - often referred to as \"stay put.\" Now, under IDEA 2004, the student remains in the interim alternative educational setting, unless the parent and the state agree otherwiseor the time period for the infraction (e.g., 45 school days for special circumstances or duration applied to non-disabled students) has expired.\n\nStudents Not Yet Eligible for IDEA\n\n\nCertain exceptions apply to the above circumstances. They include:\n\n\nSpecial Note:\n\nProvisions in IDEA 2004 allow schools to provide early intervening services to students who are considered \"at risk.\" At-risk students are those who show a need for additional academic or behavioral support to succeed in general education, but who are not identified as needing special education. In addition, IDEA 2004 allows schools to use a \"response-to-intervention\" (RTI) process as part of its procedures for identifying students as having specific learning disabilities and needing special education. A child in either the \"at risk\" or \"RTI\" circumstances may not be considered to possibly need special education services unless at least one of the first three bulleted conditions in the section above has been met.\n\nIDEA's provisions regarding the discipline of students with disabilities are complex and often confusing. If your child becomes the focus of a disciplinary action, you should seek information and guidance from expert resources such as your state's Parent Training and Information Center (PTIC).\n\n",
  "response": "### **Overall Scene Theme and Core Concept**  \n**Scene Type:** *Special Education Resource Room in a Public School*  \n\nThis is a bustling, multi-functional space designed to support students with disabilities—ranging from learning differences to behavioral challenges—while adhering to IDEA 2004 regulations. The room serves as a hub for IEP meetings, behavioral intervention sessions, academic support, and crisis de-escalation. It is inherently collaborative, requiring coordination between teachers, paraprofessionals, therapists, and administrators to ensure compliance with legal procedures while addressing students' needs.  \n\n**Why Multi-Agent?**  \n- **Complex IEP Compliance:** Requires multiple staff to access records, adjust lesson plans, and document incidents.  \n- **Behavioral Interventions:** Physical redirection, sensory tools, and crisis protocols necessitate teamwork.  \n- **Logistical Coordination:** Heavy equipment (e.g., sensory pods, weighted furniture) requires joint transport.  \n\n---\n\n### **Spatial Layout and Area Descriptions**  \n1. **IEP Meeting Zone**  \n   - Central table with adjustable seating (wheelchair-accessible). Whiteboard with a *\"Manifestation Determination Flowchart\"* and sticky notes listing recent behavioral incidents.  \n   - **Atmosphere:** Tense but organized; legal binders and coffee mugs suggest frequent meetings.  \n\n2. **Sensory Regulation Corner**  \n   - Dim lighting, noise-canceling panels. Contains a weighted blanket (8kg, navy blue), a tactile wall with Velcro shapes, and a vibrating \"calm chair\" (requires two people to move).  \n   - **Atmosphere:** Quiet refuge; faint lavender scent from a diffuser.  \n\n3. **Academic Support Stations**  \n   - Three divided carrels with adjustable monitors (one flickering). Each has a labeled *\"RTI Progress Tracker\"* folder and fidget tools (e.g., a stress ball with gel beads leaking slightly).  \n   - **Atmosphere:** Focused but cluttered; pencil shavings and crumpled rubric sheets litter the floor.  \n\n4. **Behavioral Crisis Nook**  \n   - Padded walls, a locked cabinet (keycode 4452*) holding emergency meds, and a *\"De-escalation Protocol\"* poster with torn corners. A *\"Time-Out\"* stool (one leg uneven) faces a dented locker.  \n   - **Atmosphere:** Sterile but worn; handprints smudge the plexiglass window.  \n\n5. **Staff Logistics Hub**  \n   - Printer (paper jam light on), a stack of *\"45-Day Interim Placement\"* forms, and a locked drawer with *\"Confidential FBA Reports.\"* A lanyard with a snapped clip dangles from a hook.  \n   - **Atmosphere:** Overworked; sticky notes with *\"URGENT: Manifestation Mtg @ 3 PM\"* plaster the monitor.  \n\n6. **Student Belonging Area**  \n   - Backpacks (one with a torn strap), a *\"Lost & Found\"* bin (overflowing with mismatched mittens), and a *\"Reward Token Board\"* with missing velcro stars.  \n   - **Atmosphere:** Chaotic but personal; a half-eaten granola bar rests on a *\"I ♥ My IEP Team\"* mug.  \n\n---\n\n### **Detailed Area-by-Area Inventory**  \n\n#### **1. IEP Meeting Zone**  \n**a. Anchor Furniture & Installations**  \n- **Conference Table:** Oval, scratched laminate surface (250kg; requires 3+ to lift). Extendable leaves with *\"IDEA 2004 Compliance Guide\"* binder trapped underneath one.  \n- **Media Cart:** Wheeled, squeaky left caster. Supports a projector displaying a frozen slide: *\"Disciplinary History: 10+ Days = Pattern?\"*  \n\n**b. Key Interactive & Task-Relevant Objects**  \n- **Behavior Incident Logbook:** Open to a page with *\"10/12: Kyle (ADHD) threw chair → 3-day suspension?\"* in red pen.  \n- **Locked File Cabinet:** Keycode *\"2024IDEA\"* holds IEPs. A sticky note on top reads *\"Manifestation docs MISSING – check SpEd office.\"*  \n\n**c. Functional Ambient Objects**  \n- **Whiteboard:** 30% erased, with *\"FBA Steps: 1. Observe → 2. Hypothesize → 3. Intervene\"* still visible.  \n- **Coffee Maker:** Cold, half-full carafe; *\"OUT OF ORDER\"* sticky on the power button.  \n\n**d. Background & Decorative Objects**  \n- **Wall Art:** A child’s crayon drawing labeled *\"My Safe Place\"* pinned askew.  \n- **Floor:** Scuff marks near the table legs from frequent chair shuffling.  \n\n---\n\n#### **2. Sensory Regulation Corner**  \n**a. Anchor Furniture & Installations**  \n- **Weighted Sensory Pod:** 120kg, egg-shaped, with a broken zipper (internal beads spilling). Requires 4+ people to relocate.  \n- **Tactile Wall:** 12 removable texture panels (one missing, exposing duct tape).  \n\n**b. Key Interactive & Task-Relevant Objects**  \n- **Noise-Canceling Headphones:** Left ear cushion torn, right side functional.  \n- **Timer:** Sand-filled, 5-minute duration, jammed at 3 minutes.  \n\n**c. Functional Ambient Objects**  \n- **LED Mood Light:** Flickers intermittently on \"calm blue\" setting.  \n- **Aromatherapy Diffuser:** Empty reservoir, lavender oil bottle tipped over.  \n\n**d. Background & Decorative Objects**  \n- **Floor Cushions:** One deflated, leaking foam pellets.  \n- **Shelf:** Dusty *\"How to Self-Regulate\"* pamphlet from 2018.  \n\n---\n\n### **Scene Affordances and Embedded Potential**  \n\n#### **Collaborative Transportation Affordances**  \n- **Sensory Pod (120kg, 2m diameter)**  \n  - Requires 4 agents to lift safely (handholds on sides).  \n  - **Problem:** Must navigate around the uneven *Time-Out Stool* en route to the loading dock.  \n\n#### **Reasoning and Tool-Use Affordances**  \n- **Attribute-Based Reasoning:**  \n  - Among five *\"Emergency Meds\"* in the locked cabinet:  \n    - *\"Blue-cap benzo bottle (expired 10/23)\"*  \n    - *\"Red-cap inhaler (student: Jamal, Asthma)\"*  \n    - *\"Unlabeled syringe (requires FBA approval)\"*  \n  - **Distractor:** A decorative *\"First Aid Kit\"* with similar blue caps but no meds.  \n\n- **Compound Tool-Use:**  \n  - **Problem:** Printer jammed (flashing red light).  \n  - **Solution:**  \n    1. Fetch the *\"JAM RESET TOOL\"* (stored under the media cart).  \n    2. Use the *\"Staff Hub Key\"* (on the lanyard) to open the toner compartment.  \n\n---\n\nThis environment is **designed for chaos**—overlapping policies, fragile tools, and urgent decisions demand precise coordination. Every object’s state (broken, expired, misplaced) creates *solvable problems*, while ambient clutter (expired forms, dusty shelves) forces agents to filter signal from noise."
}