{
  "id": 1167,
  "raw": "\nRetrieved from http://www.patheos.com/blogs/lovejoyfeminism/2011/08/attention-evangelicals-you-have-a-problem.html\nText:\nAttention Evangelicals: You Have A Problem\n\nTo everyone who claims the label “evangelical,” I have something to tell you. You have a major public relations problem. I’m not sure what you’re doing wrong, but it really does look like you’re doing something wrong. Let me explain.\nWhen I grew up as an evangelical, I was taught that being an evangelical was about trusting Christ’s sacrifice for salvation, about helping others have conversion experiences and pray the sinners prayer, about reading the Bible, about having a relationship with Jesus, and about love and service to others. We were to win others to Christ by showing them Christ’s love for them. Yes, my parents followed a legalistic sort of evangelicalism that emphasized the patriarchal family order over freedom in Christ, but we nevertheless saw the things mentioned above as the foundation of our faith and our religion.\nOnce I left evangelicalism I realized that those outside of it frequently didn’t view it very positively, or even understand it. However, until today I had thought that people generally understood that evangelicals emphasized things like Jesus, the Bible, and the centrality of the cross. Today came as a bit of a surprise. I attended the first meeting of a college class on evangelicalism. Twenty-five students, nearly all of them undergraduates, were asked to share how they would define evangelicalism, or simply what came to mind when they heard the term “evangelicalism.” As the students listed off various answers, the professor wrote them on the blackboard. Here you go:\nWhat is evangelicalism?\nA culture\nSomeone who pushes their beliefs on others\nPolitical activism\nConservative politics\nI was the last person in the room to answer the question, because I was sitting in a corner. As I looked at the board, I was totally flabbergasted. I mean, I expected someone to say “extreme” and someone to mention the politics or anti-intellectualism, but what I was not prepared for is what was missing.\nJesus. The Bible. The cross.\n“I tend to follow Bebbington’s definition of evangelicalism,” I started, “and somehow none of the things he mentions are even on the board.” I’m afraid that this is where I started to sound indignant. “All evangelicals, no matter where they are on the spectrum, hold four beliefs: the centrality of Christ’s sacrifice on the cross, the necessity of individual conversion, the importance of the Bible, and the call to activism, be that social justice or the conversion of souls. I’m sorry, I just can’t believe that “Bible” is not on the list, or the cross – or for that matter, why is ‘Jesus’ not on the board?!”\nThe professor added everything I mentioned, smiling and nodding, and told me that she would be discussing Bebbington’s definition of evangelicalism on Wednesday. “Oh dear, I’ll probably find out you don’t like it or something!” I said, but she shook her head and replied that “actually, I find it’s the best definition out there.”\nI have to say, today has me completely floored. How was the Bible not on that list? How was Jesus not on that list? How was conversion and salvation not on that list? Somehow, twenty-five college students asked to define “evangelicalism” could not come up with any of those things. This might make sense if these were students from a “liberal bastion” like New York City, but they weren’t. These were students from the heart of the Midwest.\nThis bothers me because even though I disagree with evangelicals, I do understand where they’re coming from, and I know what beliefs are most important to them. But somehow, even with all of evangelicals’ emphasis on converting others, other Americans have absolutely no idea what beliefs evangelicals see as central.\nIn conclusion, if you describe yourself as an “evangelical,” whether conservative or liberal, you have a serious problem. Somehow, you aren’t getting your message across. Somehow, people have no idea that you see Jesus or the Bible or Christ’s sacrifice as central and most important. Instead, they see you as crazy and pushy. I’m really not sure exactly where you went wrong, but I would posit that some serious rethinking of tactics might be in your best interests.\n\nAbout Libby Anne\n\n\n\n    Great post! Personally, I stopped using the term \"evangelical\" to describe myself to people outside of church settings, because it has so much baggage and negative connotations, just as you found out. People may have a much better idea of the word \"Christian\" and what it means. When we use \"evangelical\" as a qualifier–as if it is a different kind and sort of Christian (and usually implied as an altogether better sort), then it only takes one zany \"evangelical Christian\" on the national stage to paint a bad picture for the lot. Hmmm… I do seem to know quite a few of those…. *cough* Pat Robertson and Co. *cough*…\"We have met the enemy and he is us.\"\n\n  • Petticoat Philosopher\n\n    Honestly, if I had been in your class it wouldn't have crossed my mind to mention Jesus or the Bible or Christ's sacrifice either. Not because I don't know that these are of fundamental importance to evangelicals, but because I take for granted that they are of fundamental importance in all forms of Christianity. I don't know of any Christian movement that doesn't consider Jesus to be central. I've never been in any Christian church where there weren't bibles and crosses. If somebody asks me what I think of when I think of evangelicalism, I would assume they were asking me what I think makes evangelicalism distinct from other forms of Christianity. And unfortunately, a lot of the things on that board would come to mind. (Not because I think that all evangelicals are like that. I know from experience that they aren't. But, unfortunately, the loudest ones tend to be.)\n\n  • http://www.blogger.com/profile/10562805251128821984 Libby Anne\n\n    PP – While I agree with you in theory, I would point out that evangelicals stress these things – Jesus, the Bible, and the cross – much more than most other denominations. Evangelicals will say that they don't have a religion but rather \"a relationship with Jesus,\" and talk like they're carrying Jesus around in the their pockets or something. Evangelicals see the Bible as completely central to their faith, when many other Christians do not. Evangelicals make Christ's sacrifice the only thing that matters, and put a huge importance on a conversion moment as the thing that makes the difference between heaven and hell, while many other Christians see this very differently. Believe it or not, when scholars study evangelicals it is these things (The Bible, the Cross, Conversion) that they argue set evangelicals apart from other Christians.\n\n  • Anothermous\n\n    \"Peace out\"?Effin' hippy.\n\n  • https://openid.aol.com/opaque/5b20d3b0-9d71-11e0-a6d0-000bcdcb8a73 Fina\n\n    I agree with PP, the most likely reason why no one mentioned Jesus, the Bible etc. was that those seemed incredibly obvious. If you are looking for a smart answer to a question, you tend to overlook the obvious and look for something extraordinary instead.Also, keep in mind that you are probably the best informed person about evangelism in that room (well, apart from your professor i suppose). And you are quite right – in the public view, what sets Evangelists apart from other Christians are the things on that list.However, the \"importance of the Bible\" and the \"call to activism\" are actually on that list. The former is expressed in \"literalism\", \"Apocalypticism\" and \"Fundamentalist\", while the latter is expressed in \"Someone who pushes their beliefs on others\", \"Political activism\" and \"Conservative politics\".Part of finding a good definition is finding words that describe multiple aspects like that, the other people in that room simply had not done that yet, which was probably the point of that exercise.\n\n  • http://mapofherworld.monochromerainbow.com/ Cartographer\n\n    But evangelicals are \"crazy and pushy\". I certainly don't want them to do public relations better, the less people they suck in the better, the less people they damage.\n\n  • Anonymous\n\n    Very interesting post. I have to say, when I think of evangelicals, what they are actually preaching hardly enters the thought process. How they say things, and the judgement they seem to pass on the people they are attempting to convert – it doesn't matter what they're saying, no one's going to listen when you put it like that! I went to a baptist bible camp when I was in high school with some friends – I was raised Lutheran and was rather involved in my own church – and I was literally taken away from the group by the pastor's wife, sat down, handed a bible, and told to defend, verse by verse, my beliefs. I was 15. I'm pretty sure it was punishment because I happened to mention in devotions another night that I didn't think we could read Revelations as literal truth in the context of the time it was written. It was ridiculous, and the only message I got was pretend to believe or be embarrassed, ostracized, and hurt. The \"Good News\" indeed.I'm sorry that this class was so distressing for you, but unfortunately, I'd say that was a pretty good cross section of what the rest of the country sees evangelicals as. The message doesn't matter when your methods suck so bad.\n\n  • http://www.blogger.com/profile/10562805251128821984 Libby Anne\n\n    \"I'm sorry that this class was so distressing for you, but unfortunately, I'd say that was a pretty good cross section of what the rest of the country sees evangelicals as.\"The class wasn't distressing so much as surprising. I'm no longer an evangelical (obviously), but what really struck me is that evangelicals see themselves SO VERY DIFFERENTLY from how everyone else sees them. Evangelicals think that they're all about Jesus and saving souls and Christ's love, but other people simply see them as judgmental and pushy. It's not that I WANT evangelicals to get more converts, it's just that maybe if evangelicals concentrated on the things they're supposed to believe in – such as Jesus and spreading his love – maybe they'd actually be less obnoxious. Maybe then how others see them would line up more with how they see themselves. Fina – You're right that the Bible is up there, sort of. But it's not up there in any way evangelicals would want it up there, or even as a rule book for life. What frustrates me is that ordinary people understand how evangelicals think so little, but at the same time it's not like evangelicals understand how ordinary people think either – not in the least! It's this lack of mutual understanding that makes actual discourse so difficult and can stymie the political process completely. It's like speaking two completely different languages, and as someone who is bilingual, I get frustrated at how much miscommunication and even lack of communication there is. Hey, does that make me a potential translator? Lol.\n\n\n    I'm starting to stay away from labels, but in this case I don't know if I would be considered \"evangelical\" or not. However, I think that as a Christian I should not be offended or surprised when people don't associate \"Christ, Bible, cross\" etc with me when I say I'm a Christian because most Christians these days seem to be missing the point that Christianity is indeed about Christ. The fact that people don't recognize that is our (the Christian's) fault, not their fault. Once Christians start following Christ once again, then people will be able to recognize it. People won't see what we are supposed to be about, they will see what we are about, and right now it's not about Christ, it seems to be more about being political and changing the culture.\n\n  • http://www.blogger.com/profile/04510986008238276269 Amanda\n\n    I was raised in an evangelical church and family, and I agree with the students who left out Jesus and Love and the Bible. Evangelicalism appeals to people who are lost and seeking a way to belong. They just aren't capable of maintaining their beliefs without letting the \"showing other people\" part get in the way.\n\n  • http://www.blogger.com/profile/10562805251128821984 Libby Anne\n\n    Katy-Anne – See, as an evangelical, I was taught that it's all about Christ, and that that's what evangelicalism is – being all about Christ. And it was. For us, it was about a relationship with Jesus. Period. I actually don't agree that \"most Christians\" are \"missing the point that Christianity is indeed about Christ.\" At least, none of the evangelicals I have ever met were missing that point. And I've met a lot. I was involved with Campus Crusade for Christ for a while in high school, and we're talking about hundreds of college students on fire for Christ. That's all they talked about that was the purpose of their lives, and the energy in the auditorium during praise and worship was electric. So I don't actually think that evangelicals are missing Christ. In fact, we always accused the liberal Christians of missing Christ (although I now think that that is incorrect, it's just that liberal Christians understand Christ differently from how evangelicals understand Christ).\n\n  • Lola\n\n    Yeah, Katy-Anne, I'm agreeing with Libby Anne that \"most Christians\" are missing that Christianity is about Christ, and extending it to beyond evangelicals. I'm from a liberal, yet tradition driven church, and will be the first to say the Jesus is the prime focus there. The same goes with all of my (very) Catholic friends. Our Sunday School classes were geared toward explaining how to have a relationship with Christ, as well as learning how the rituals in the service were there to help and a sense of history too. Further classes, like Communion and Confirmation, asked us to truly sit and analyze bits of the Bible and the rituals, like going line by line through the Nicene Creed. The emphasis is not just about Christ as a redeemer, but also as a model for good deeds, but these things appear to get buried to the outside if they don't understand the rituals. I also want to mention that evangelicalism isn't limited to the Protestant realm of Christianity. There are a number of evangelical Catholics, where the emphasis of the Bible, Jesus, and the Cross and Conversion are huge (with a nice emphasis on conversion). I was always brought up with the understanding, at least within my church, that to be evangelical was a good thing in the sense that you were going out and sharing Jesus with the world, but somehow it seemed to be less pushy, there was a conversion goal, but it was hardly a prime thing.\n\n  • Lola\n\n    Opps, there should be a NOT in that Most Christians are missing the point of Christianity bit. sorry for the vague…\n\n  • http://foreverinhell.com Personal Failure\n\n    This bothers me because even though I disagree with evangelicals, I do understand where they're coming from, and I know what beliefs are most important to them.Here's the problem, that might be what they say is most important to them, but it's not what they act like. (I'm speaking in general. I do know evangelicals who both find those things most important and act like it.)The fact of the matter is, the most vocal and visible evangelicals might say that the Bible, Jesus, etc. are most important to them, but their actions prove that what is most important to them is exactly what those students put on the board. To put it another way, if you tell me your health is the most important thing in the world to you, but every time I see you, you're smoking, chugging vodka and eating oreos, I'm going to have to assume you're lying, or you don't know what \"health\" means.I don't think this is a PR problem. I think it's a . . . belief problem, maybe? I'm not sure how to say it. Your actions prove what it is you care most about, and a lot of evangelicals clearly don't care about the Bible, or what it says, at all.\n\n  • Petticoat Philosopher\n\n    With regard to evangelicals being devoted to Jesus vs. devoted to pushing their political agenda etc., I don't think it's either/or. In my understanding, evangelicals (at least the type we're talking about) do what they do BECAUSE they are so devoted to Jesus. For most of the \"pushy\" evangelicals I've met, Jesus looms pretty large. They talk to me about Jesus, they hand me tracts about Jesus, they lace their speech with references to Jesus. For them, what they do is all about Jesus. I find the liberal Christian interpretation of what Jesus wants to be quite a bit more morally appealing, but that doesn't change the fact that conservative evangelicals are thoroughly convinced that they are acting on behalf of Jesus.And,actually, I do think most non-evangelicals get that. (The derogatory name \"Jesus freaks\" doesn't exist for nothing.) They possibly just don't care so much because it's the political agenda that conservative evangelicals translate their devotion into that affects them directly and dovetails with their own concerns. If people are trying to keep you from getting married because you're gay, or trying to teach your kid about \"purity' in school, or trying to take away your birth control, their personal reasons for doing so doesn't interest you as much as the outcome.\n\n  • http://www.blogger.com/profile/15469173565648873918 Jadehawk\n\n    late to the conversation, since I only just got around to looking around your blog some more, but I thought I'd mention two things here:1)Unless there's some other book evangelicals insist on interpreting literally, I'd say the bible is implied in \"literalism\"2)I would expect midwestern undergraduates to be more likely to answer this way than places that would have a much larger percentage of non-Christians (and atheists/agnostics that didn't come from a Christian background), since the mindset might have been to consider Christianity the default and not mention the things that the undergrads consider universal to all forms of Christianity (even if the emphasis may be greater, the difference there is subtler than the difference in political behaviors and the other things that did get listed)\n\n  • http://www.calacirian.org Sonja\n\n    Even later to the conversation … Read here about the illusion of assymetric insight, because a) it's fascinating and b) will give you a better idea of why evangelicals cannot see outside of their own box so damningly – http://youarenotsosmart.com/2011/08/21/the-illusion-of-asymmetric-insight/I still consider myself an evangelical. But even my kids laugh at me when I say that and say things like, \"Well, Mom … you're really unorthodox.\" That's as may be. I'm a relaxed evangelical. More importantly, I'm not concrete. I think one of the problems that evangelicalism has right now is how very literal and concrete it is. No one can seem to think in terms of the abstract or be able to see in shades of grey. I can see Jesus in all kinds of people not just the places where He is prescribed. I hear Scripture and redemption in all sorts of places, not just the places I'm told to look. It gives me great joy and who's to say that God is restrained to the tiny little box that the gellies like to put Her in? I certainly do not think that is the case.\n",
  "response": "### **Scene Concept: \"The Miscommunication Archives\"**  \n\n#### **1. Overall Theme and Core Concept**  \nA sprawling, labyrinthine university archive dedicated to the study of religious movements, cultural misunderstandings, and public perception. The space is a collision of academia, religious fervor, and bureaucratic inefficiency—where scholars, archivists, and student researchers attempt (and often fail) to organize, interpret, and reconcile conflicting narratives.  \n\n**Why Multi-Agent?**  \n- **Physical Collaboration Required:** Heavy archival boxes, fragile manuscripts, and locked cabinets necessitate coordinated movement.  \n- **Cognitive Collaboration Needed:** Deciphering handwritten notes, cross-referencing sources, and resolving conflicting interpretations require reasoning and debate.  \n- **Dynamic Problems:** Misplaced books, malfunctioning digitization equipment, and time-sensitive retrieval requests introduce urgency.  \n\n---\n\n### **2. Spatial Layout & Area Descriptions**  \nThe archive is divided into four key zones:  \n\n1. **Main Catalog Hall** – A central hub with a massive card catalog, reference terminals, and a Help Desk manned by an overwhelmed graduate assistant.  \n2. **Theological Wing** – Shelves of bibles, exegetical commentaries, and evangelical pamphlets, interspersed with student annotations.  \n3. **Perception Studies Lab** – A cluttered workspace with survey data, whiteboards covered in scribbled hypotheses, and audio recordings of interviews.  \n4. **Restricted Vault** – A locked chamber containing controversial texts, labeled \"UNCORRECTED MISCONCEPTIONS,\" accessible only with faculty clearance.  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. Main Catalog Hall**  \n**a. Anchor Furniture & Installations:**  \n- A **20-foot oak card catalog** (circa 1980s), drawers labeled in fading ink.  \n- A **Help Desk** with a chipped laminate surface, a sticky keyboard, and a half-dead potted fern.  \n- A **bulky microfilm reader** (1980s model, prone to overheating).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- A **misplaced archival box** (labeled *\"Evangelical PR Crisis 2011\"*), wedged behind the card catalog (weight: 15kg, dimensions: 40x30x25cm).  \n- A **broken scanner** (error code: \"FEED JAM - DOCUMENT TOO THICK\").  \n- A **sticky-note-covered clipboard** (tasks: \"Reshelve Bebbington texts,\" \"Find missing cross-references\").  \n\n**c. Functional Ambient Objects:**  \n- A **working but slow laser printer** (toner at 12%, paper tray askew).  \n- A **wheeled step stool** (one squeaky wheel).  \n- A **coffee-stained faculty directory** (open to \"Religious Studies Dept.\").  \n\n**d. Background & Decorative Objects:**  \n- A **peeling \"QUIET PLEASE\" poster** (corners curled).  \n- A **disorganized lost-and-found bin** (containing: one left sneaker, a USB drive labeled \"THESIS BACKUP??\").  \n- A **dusty trophy** (\"Best Interfaith Dialogue 2003\").  \n\n---\n\n#### **B. Theological Wing**  \n**a. Anchor Furniture & Installations:**  \n- **Floor-to-ceiling bookshelves** (some leaning precariously).  \n- A **lectern with a well-worn King James Bible** (pages dog-eared at Corinthians).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- A **locked glass case** (inside: a first-edition *Bebbington’s Quadrilateral*).  \n- A **highlighted and annotated survey sheet** (question: *\"What defines evangelicalism?\"* with answers circled in red).  \n- A **stuck rolling ladder** (one wheel jammed by a fallen book).  \n\n**c. Functional Ambient Objects:**  \n- A **book cart** (half-filled with returns, one wheel wobbly).  \n- A **magnifying glass** (left on a desk, slightly smudged).  \n- A **sticky tape dispenser** (nearly empty).  \n\n**d. Background & Decorative Objects:**  \n- A **yellowed newspaper clipping** (*\"Evangelicals in the Media: Love or Judgment?\"*).  \n- A **student’s doodle-covered notebook** (open to a sketch of a megaphone shouting \"REPENT!\").  \n- A **dead bonsai tree** (in a \"World’s Best Professor\" mug).  \n\n---\n\n#### **C. Perception Studies Lab**  \n**a. Anchor Furniture & Installations:**  \n- A **large whiteboard** (covered in colored markers: *\"Perception vs. Reality – Why the Disconnect?\"*).  \n- A **recording booth** (soundproofing peeling at the edges).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- A **stack of unprocessed audio cassettes** (labeled *\"Student Interviews – Evangelicalism Study\"*).  \n- A **mis-calibrated transcription pedal** (skips every 10 seconds).  \n- A **password-locked laptop** (sticker: *\"Thesis Data – DO NOT TOUCH\"*).  \n\n**c. Functional Ambient Objects:**  \n- A **working but flickering desk lamp**.  \n- A **half-empty coffee pot** (burner still on).  \n- A **stained lab coat** (hung on a hook, pocket full of pens).  \n\n**d. Background & Decorative Objects:**  \n- A **bulletin board** (pinned with faded conference badges).  \n- A **leaning tower of outdated psychology journals**.  \n- A **cracked \"THINK OUTSIDE THE BOX\" plaque**.  \n\n---\n\n#### **D. Restricted Vault**  \n**a. Anchor Furniture & Installations:**  \n- A **heavy steel door** (keycard reader, red LED status light).  \n- A **security monitor** (static-filled, camera angle partially blocked).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- A **misfiled folder** (*\"Unpublished Critiques of Evangelical PR\"*).  \n- A **jammed drawer** (requires two people to pry open).  \n- A **missing keycard** (last seen in the faculty lounge).  \n\n**c. Functional Ambient Objects:**  \n- A **dehumidifier** (humming loudly, water tank full).  \n- A **fire suppression system control panel** (warning light: \"TEST REQUIRED\").  \n\n**d. Background & Decorative Objects:**  \n- A **graffiti-style sticky note** (*\"Who moved the Bebbington originals?!\"*).  \n- A **cobweb in the corner** (with a trapped moth).  \n- A **dusty \"CONFIDENTIAL\" stamp**.  \n\n---\n\n### **4. Scene Affordances & Embedded Potential**  \n\n#### **Collaborative Transportation Affordances:**  \n- The **misplaced archival box** (15kg, awkwardly wedged) requires two agents to lift safely.  \n- The **jammed vault drawer** needs simultaneous pulling from opposite sides.  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:**  \n  - Among **five nearly identical cassette tapes**, only one has a **small tear in the label** and **\"FINAL INTERVIEWS\"** handwritten in red.  \n  - A background **decorative blue glass paperweight** distracts from the real evidence.  \n- **Compound (Tool-Use) Reasoning:**  \n  - **Problem:** The **locked vault** requires a keycard.  \n  - **Solution:** The keycard is in the **faculty lounge**, inside a **coffee-stained planner**.  \n\n---\n\n### **Final Notes**  \nThis environment is **dense with intentional ambiguity**—objects are misplaced, labels are misleading, and critical tools are never where they should be. Agents must **navigate physical obstacles, interpret conflicting information, and collaborate to uncover the \"truth\" behind evangelicalism’s PR crisis**. The clutter isn’t random; each misplaced item is a potential clue—or a red herring.  \n\nWould you like any refinements or additional layers of complexity?"
}