{
  "id": 1179,
  "raw": "\nRetrieved from http://www.wowwiki.com/Snare?oldid=2179085\nText:\n102,281pages on\nthis wiki\nRevision as of 04:52, January 28, 2010 by Sabertoona (Talk | contribs)\n\nSnare effects are a form of crowd control that reduce a victim's movement speed, preventing him from effectively maneuvering in combat. There are 2 types of snares: area-based snares, such as Frost Trap or Earthbind Totem, and debuff-based snares (also called Slows), such as Crippling Poison or Piercing Howl. It is most useful to ranged classes when fighting opponents who only possess melee attacks, allowing them to kite the opponent. Snares are also useful to prevent enemies from fleeing to safety or running for help (in instances especially).\n\nSpells and abilities with a snare effect usually have a percentage listed (i.e. Daze is a \"50% snare\"). The creature's full movement speed is reduced by this percentage.\n\nExamples of abilities that cause a snare effect:\n\nClass Abilities\nDeath Knight Chains of Ice\nFrost Fever (with Chillblains)\nDruid Feral Charge (Cat form)\nHunter Wing Clip\nFrost Trap\nConcussive Shot\nMage Frostbolt\nCone of Cold\nBlast Wave\nPaladin Judgement of Justice (Rank 2) (though not technically classified as a snare in game mechanics)\nPriest Mind Flay\nRogue Crippling Poison\nDeadly Throw\nShaman Frost Shock\nEarthbind Totem\nWarlock Curse of Exhaustion\nWarrior Hamstring\nPiercing Howl\n\n\nSnare debuffs do not stack. Instead, the debuff that gives the most movement speed reduction takes precedence. If any lesser snare is applied while a greater snare is active, it will not be applied, even if the greater snare will expire sooner.\n\n\nAround Wikia's network\n\nRandom Wiki\n",
  "response": "### **Scene Concept: \"The Frostforged Workshop\"**  \n\n#### **1. Overall Scene Theme and Core Concept**  \nA high-security industrial workshop specializing in cryogenic engineering and weapon prototyping. The facility is a nexus of research and manufacturing, where volatile materials and experimental machinery demand constant oversight. The environment is inherently collaborative due to:  \n- **Heavy Machinery:** Many devices require coordinated operation or transport.  \n- **Safety Protocols:** Complex lockouts, pressure valves, and emergency shut-offs necessitate multi-agent verification.  \n- **Precision Tasks:** Fine-tuning cryo-emitters or handling unstable compounds requires one agent to stabilize while another adjusts.  \n\n#### **2. Spatial Layout and Area Descriptions**  \nThe facility consists of:  \n1. **Main Engineering Bay** – Dominated by a massive cryo-forge, humming with coolant pumps. Overhead cranes and tool racks line the walls.  \n2. **Secure Storage Vault** – Reinforced doors with biometric locks, storing prototype weapons and volatile reagents.  \n3. **Monitoring Station** – A raised platform with holographic diagnostics, security feeds, and emergency controls.  \n4. **Testing Chamber** – A circular arena with frost-coated walls, littered with spent target drones.  \n5. **Break Room** – A small, cluttered space with a coffee maker, lockers, and outdated safety manuals.  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. Main Engineering Bay**  \n\n**a. Anchor Furniture & Installations:**  \n- **Cryo-Forge Assembly (3m x 4m, 800kg, -10°C surface temp)** – A massive worktable with built-in cooling coils, currently holding a disassembled **\"Frostbite Cannon\" prototype**.  \n- **Overhead Gantry Crane (5-ton capacity, remote control panel missing a fuse)** – Used for lifting heavy components.  \n- **Tool Wall Rack (aluminum pegboard, labeled slots for 27 tools, 4 empty)**  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Prototype Cryo-Core (encased in a 30kg steel cylinder, frost forming on its surface, pressure gauge at 85%)** – Requires immediate venting before overheating.  \n- **\"Frostbite Cannon\" Blueprint (pinned under a wrench, partially obscured by coffee stains)** – Missing critical calibration notes.  \n- **Biometric Lock Terminal (flashing red: \"AUTHORIZATION REQUIRED\")** – Needs two simultaneous palm scans to open the vault.  \n\n**c. Functional Ambient Objects:**  \n- **Hydraulic Workbench (height-adjustable, currently stuck at 1.2m)**  \n- **Coolant Dispenser (tank 30% full, leaking a small puddle)**  \n- **Welding Torch (fuel canister at 15%, igniter sparking weakly)**  \n\n**d. Background & Decorative Objects:**  \n- **Faded \"CAUTION: EXTREME COLD\" poster (partially torn, corners curling)**  \n- **Dented coffee mug (\"World's Best Cryo-Engineer\") holding loose screws**  \n- **Stack of outdated maintenance logs (dusty, some pages stuck together)**  \n\n---\n\n#### **B. Secure Storage Vault**  \n\n**a. Anchor Furniture & Installations:**  \n- **Reinforced Cryo-Locker (1.5m tall, biometric palm scanner, -20°C internal temp)** – Contains unstable **\"Glacial Shard\" samples**.  \n- **Heavy-Duty Shelving Unit (bolted to floor, slight leftward tilt)** – Holds labeled containment canisters.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Glacial Shard\" Canister (frosted glass, vibrating slightly, label: \"DO NOT AGITATE\")** – Requires careful transport to prevent detonation.  \n- **Emergency Pressure Release Valve (rusted, requires two agents to turn simultaneously)**  \n\n**c. Functional Ambient Objects:**  \n- **Spare Cryo-Suits (hung on pegs, one missing a glove)**  \n- **Handheld Scanner (battery dead, charging dock nearby)**  \n\n**d. Background & Decorative Objects:**  \n- **Obsolete \"HAZMAT PROCEDURES\" flowchart (from 5 years ago)**  \n- **Framed photo of the original research team (one face scratched out)**  \n\n---\n\n### **4. Scene Affordances and Embedded Potential**  \n\n#### **Collaborative Transportation Affordances**  \n- **Cryo-Forge Assembly (800kg, 3m x 4m)** – Requires coordinated crane operation (one agent at controls, another guiding placement).  \n- **\"Glacial Shard\" Canister (40kg, fragile, unstable if jostled)** – Must be carried by two agents to prevent accidental discharge.  \n\n#### **Reasoning & Tool-Use Affordances**  \n- **Attribute-Based Reasoning:** Among five coolant tanks, only **one** has a **blue valve (not red), a \"NITRO-X\" label (others say \"HYDRO\"), and a pressure gauge at critical (90%)**. A **decorative blue glass paperweight** on the desk adds perceptual noise.  \n- **Compound Reasoning:** The **rusted pressure valve** in the vault requires **a lubricant spray (stored in the break room, behind expired coffee filters)** and **two agents turning simultaneously** to activate.  \n\n---\n\nThis **Frostforged Workshop** is a **collaborative playground**—every object has weight, every state matters, and every task requires **coordination, reasoning, and precision**. Agents must **navigate hazards, decipher clues, and work together** to prevent disaster."
}