{
  "id": 1198,
  "raw": "\nRetrieved from http://eol.org/pages/207219/hierarchy_entries/46529548/overview\nText:\nYou are viewing this Species as classified by:\n\n\nRead full entry\n\nNeon tetra\n\nThe neon tetra (Paracheirodon innesi) is a freshwater fish of the characin family (family Characidae) of order Characiformes. The type species of its genus, it is native to blackwater or clearwater streams in southeastern Colombia, eastern Peru, and western Brazil, including the tributaries of the Solimões where the water is between 20 and 26°C (68 and 79°F).[2] It is not found in the whitewater rivers of Andean origin. Its bright colouring makes the fish visible to conspecifics in the dark blackwater streams,[3] and is also the main reason for its popularity among tropical fish hobbyists.\n\n\nThe neon tetra has a light-blue back over a silver-white abdomen. The fish is characterized by an iridescent blue horizontal stripe along each side of the fish from its nose to the base of the adipose fin, and an iridescent red stripe that begins at the middle of the body and extends posteriorly to the base of the caudal fin. Most, if not all, will develop an olive-green sheen lining their backs. The fish is completely transparent (including fins) except for these markings. During the night, the blue and red become silver as the fish rests—it reactivates once it becomes active in the morning. It grows to approximately 3 cm (1.2 in) in overall length. Sexual dimorphism is slight, with the female having a slightly larger belly, and a bent iridescent stripe rather than the male's straight stripe. They have recently become available in a long-fin variety.\n\n\nThe neon tetra was first imported from South America and was described by renowned ichthyologist Dr. George S. Myers in 1936, and named after Dr. William T. Innes. P. innesi is one of the most popular aquarium fish, having been bred in tremendous numbers for the trade. Most neon tetras available in the United States are imported from Hong Kong, Singapore, and Thailand, where they are farm-raised, or to a lesser extent (<5%) from Colombia, Peru, and Brazil, where they are collected from the wild. During a single month, an average of 1.8 million neon tetras with an estimated value of $175,000 are imported into the United States for the aquarium trade.[4] With the exception of home aquarists and a few commercial farms that breed neon tetras experimentally, captive breeding on a commercial scale is nonexistent in the United States.\n\nIn the aquarium[edit]\n\nA community of neon tetras in a home aquarium\n\nWhile commercially bred neon tetras have adapted well to a wide range of water conditions, in the wild they inhabit very soft, acidic waters that are usually cooler than the 25°C (77°F) at which most tropical aquaria are maintained.[2] They can have a lifespan of up to ten years, or normally about five in an aquarium.\n\nNeon tetras are considered easy to keep in a community aquarium at least 60 cm (24 inches) long,[citation needed] with a pH of 6.0 to 7.8 and a KH of 1.0 to 2.0. However, they will die if traumatized by dramatic changes to their environments. They tend to be timid and, because of their small size, should not be kept with large or aggressive fish which may bully or simply eat them. Fish that mix well in an aquarium are guppies, other types of tetras, such as the rummy-nose tetra, cardinal tetra, and glowlight tetra, and other community fish that live well in an ideal tetra water condition. Mid-level feeders, they are best kept in schools of six or more, for the shoaling effect when they move around the tank. They shoal naturally in the wild and are thus more brightly colored and more active when kept as a shoal as opposed to singly. The color and the iridescent stripe of this fish may become dim at night, and can be virtually invisible after a period of darkness. The color may also fade during a period of stress, such as human intervention into the tank. Neons are best kept in a densely planted tank with subdued light and an ideal temperature of 21–27°C (70–81°F) to resemble their native Amazon environments.\n\n\nNeon tetras are omnivores and will accept most flake foods, if sufficiently small, but should also have some small foods such as brine shrimp, daphnia, freeze-dried bloodworms, tubifex, which can be stuck to the side of the aquarium, and micropellet food to supplement their diets. A tropical sinking pellet is ideal, as most brands of these include natural color enhancers that bring out the color in neon tetras. Some frozen foods, including frozen blood worms, add variety to their diets.\n\n\nNeon tetra\n\nThe male is slender, and the blue line is straighter. The female is rounder, producing a bent blue line. Some aquarists say the females look plumper when viewed from above. However, the straightness of the line and the plumpness of the female might occasionally be due to the eggs she is carrying. A neon tetra can appear slightly plump in the belly due to having overeaten.[5]\n\nTo breed neon tetras, hobbyists place a pair of the species in a breeding tank without any light, and gradually increase the lighting until spawning occurs. Other inducers include mosquito larvae and a hardness of less than 4 dGH. Some also recommend letting the level of nitrates rise, then doing at least a 50% water change to simulate the fresh rain the tetras get in their natural habitat in the Amazon. Everything placed in the aquarium is sterilized, as is the aquarium top. Because the adults, and other fishes if a breeding tank is not used, will often eat newly hatched fry, it is common to remove the eggs as soon as they have been laid. The eggs are especially sensitive to light, and hatch within 24 hours of the laying. Fry can be fed infusoria, especially rotifers and egg yolk for one to four weeks, followed by nauplii of brine shrimp, shaved cattle liver, and formulated diets. Fry achieve their adult coloration at about one month of age. Adults can spawn every two weeks.\n\n\nNeon tetras are occasionally afflicted by the so-called \"neon tetra disease\" (NTD) or pleistophora disease, a sporozoan disease caused by Pleistophora hyphessobryconis. Despite being a well-known condition, it is currently incurable and often fatal to the fish. The disease cycle begins when microsporidian parasite spores enter the fish after it consumes infected material, such as the bodies of a dead fish, or live food such as tubifex, which may serve as intermediate hosts. The disease is most likely passed by newly acquired fish, which have not been quarantined.\n\nSymptoms include restlessness, loss of coloration, lumps on the body as cysts develop, difficulty swimming, curved spines as the disease progresses, and secondary infections, such as fin rot and bloating.\n\nA so-called \"false neon disease\", which is bacterial, shows very similar symptoms. It is impossible for the home aquarist to determine for certain the difference between NTD and false NTD on the basis of visible symptoms alone, without laboratory backup. This disease has also been confused with columnaris (mouth rot, mouth fungus, 'flex').\n\nTo date, no cure is known; the only 'treatment' is the immediate removal of diseased fish to preserve the remaining fish. The use of a diatom filter, which can reduce the number of free parasites in the water, may help.\n\nRelated species and other \"neon tetras\"[edit]\n\nThe green neon tetra (P. simulans) and black neon tetra (Hyphessobrycon herbertaxelrodi) are distinct species—the latter belongs to an altogether different genus—and not color varieties. The cardinal tetra (P. axelrodi)—also sometimes called the red neon—is a very similar species, and is often confused with the true neon tetra. In a domestic aquarium, the two species will school together, especially if numbers of one of the species are insufficient to form a school. The neon tetra will also school with P. simulans if there are only a few of each. The cardinal tetra's larger size and greater extent of red coloring distinguishes it from the neon tetra. The term Hyphessobrycon innesi is an obsolete synonym for P. innesi, the neon tetra itself.\n\nSee also[edit]\n\n\n  1. ^ \"Paracheirodon innesi\". Integrated Taxonomic Information System. \n  2. ^ a b Froese, Rainer and Pauly, Daniel, eds. (2008). \"Paracheirodon innesi\" in FishBase. July 2008 version.\n  3. ^ Ikeda, Takehide; Kohshima Shiro (2009). Why is the neon tetra so bright? Coloration for mirror-image projection to confuse predators? \"Mirror-image decoy\" hypothesis. Environmental Biology of Fishes, Volume 86, Number 3, 427-441, doi:10.1007/s10641-009-9543-y\n  4. ^ Chapman, F. A.; et al. (1997). \"United States of America trade in ornamental fish\". Journal of the World Aquaculture Society 28: 1‒10. doi:10.1111/j.1749-7345.1997.tb00955.x. \n  5. ^ Feeding and diseases:\n\nFurther reading[edit]\n\n\n\nSource: Wikipedia\n\nBelongs to 0 communities\n\nThis taxon hasn't been featured in any communities yet.\n\nLearn more about Communities\n\n\n\n",
  "response": "### **Overall Scene Theme and Core Concept**  \n**Scene Type:** *Tropical Fish Breeding & Research Facility*  \n**Core Concept:** A bustling, medium-sized aquaculture facility specializing in neon tetra breeding for commercial export. The space blends scientific precision with the organic chaos of live animal care, requiring constant multi-agent coordination to maintain delicate ecosystems, monitor fish health, and prepare shipments.  \n\n**Why Collaboration is Essential:**  \n- **Heavy/Object-Limited Tasks:** Large water tanks, bulky supply crates, and delicate equipment require coordinated transport.  \n- **Specialized Roles:** Technicians, breeders, and logistics staff must work in parallel (e.g., one monitors water pH while another packages fish for shipping).  \n- **Time Pressure:** Live fish shipments have strict deadlines; delays risk mortality.  \n\n---  \n\n### **Spatial Layout and Area Descriptions**  \n1. **Main Breeding Room**: Heart of the facility. Dozens of tinted glass breeding tanks under soft blue LED grow lights. Humid, warm (26°C), with the faint hum of water filters.  \n2. **Quarantine/Diagnostic Lab**: Adjoining sterile space with microscopes, labeled specimen jars, and isolation tanks for sick fish. Harsh fluorescent lighting.  \n3. **Packaging & Shipping Bay**: Concrete-floored area with stacked insulated shipping boxes, packing materials, and a digital scale. A clipboard lists today’s orders.  \n4. **Supply Closet**: Crowded with fish food buckets, net replacements, and cleaning tools. A leaking pipe drips into a bucket labeled \"TEMPORARY FIX.\"  \n5. **Break Room/Office**: Overflowing paperwork, a coffee maker with stale brew, and a whiteboard tracking breeding cycles. A faded \"NEON TETRA: 10-YEAR ANNIVERSARY\" poster peels off the wall.  \n\n---  \n\n### **Detailed Area-by-Area Inventory**  \n\n#### **1. Main Breeding Room**  \n**a. Anchor Furniture & Installations:**  \n- **Central Breeding Tanks (x12)**: 1m³ blackwater simulation tanks with adjustable dimmers. Each has a digital thermometer (showing 24–26°C) and a pH monitor.  \n- **Overhead Rack System**: Holds drip lines for automated feeding; one valve leaks slowly onto the floor.  \n- **Industrial Sump Pump**: Weighs 80kg; requires two people to move.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Priority Batch\" Tank**: Marked with red tape; contains fry needing infusoria feedings every 2 hours.  \n- **Broken Air Stone**: Clogs intermittently, causing oxygen drops. A replacement sits on a shelf across the room.  \n- **Master Control Panel**: Touchscreen for lighting/filter schedules. Currently flashing \"ERROR: TANK 7 TEMP SENSOR OFFLINE.\"  \n\n**c. Functional Ambient Objects:**  \n- **Rolling Feed Cart**: Holds brine shrimp dispensers and a jar of \"ColorEnhance™\" pellets.  \n- **Metal Step Stool**: One wobbly leg; used to reach high tanks.  \n- **Clipboard**: Logs breeding pairs; last entry reads \"Batch #44 – LOW HATCH RATE.\"  \n\n**d. Background & Decorative Objects:**  \n- **Mismatched Nets**: Hung haphazardly; one has a repaired handle wrapped in duct tape.  \n- **Dusty Trophy**: \"Breeder of the Year 2018\" on a high shelf.  \n- **Faded Safety Poster**: \"REMEMBER: 20% WATER CHANGE DAILY\" with a cartoon fish frowning at a dirty tank.  \n\n---  \n\n#### **2. Quarantine/Diagnostic Lab**  \n**a. Anchor Furniture & Installations:**  \n- **Microscope Station**: Nikon E200 with a cracked slide tray.  \n- **Isolation Tanks (x4)**: Small 30L tanks under yellow \"CAUTION\" lights. One has a dead fish floating.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Pleistophora Test Kit**: Unopened box labeled \"EXPIRES NEXT MONTH.\"  \n- **Infected Sample Jar**: Sealed with biohazard tape; contains a tetra with visible cysts.  \n- **Emergency Meds Fridge**: Padlocked; key taped under the desk.  \n\n**c. Functional Ambient Objects:**  \n- **Centrifuge**: Spins unevenly; makes a grinding noise.  \n- **Sink**: Clogged with decomposing brine shrimp.  \n- **Whiteboard**: Scribbled notes: \"NTD SUSPECTED IN BATCH #37 → DISCARD?\"  \n\n**d. Background & Decorative Objects:**  \n- **Coffee-Stained Manual**: \"Neon Tetra Diseases: Identification Guide\" open to a dog-eared page.  \n- **Dead Plant**: In a cracked pot labeled \"DO NOT WATER.\"  \n- **Outdated Calendar**: Still on July, showing a cartoon fish with X’s for eyes.  \n\n---  \n\n### **Scene Affordances and Embedded Potential**  \n\n#### **Collaborative Transportation Affordances**  \n- **Water Pump (80kg)**: Requires two agents to lift safely; blocks the path if left in the wrong position.  \n- **Insulated Shipping Crates (50kg each)**: Stacked precariously; one agent must stabilize while another loads fish bags.  \n\n#### **Reasoning & Tool-Use Affordances**  \n- **Attribute-Based Reasoning**: Among five nearly identical tanks, only *Tank #7* has a broken temp sensor (identified by flickering LED). The repair kit is in the supply closet behind a bucket of \"Emergency Salt Mix.\"  \n- **Compound Tool Use**: To fix the air stone:  \n  1. Fetch the *replacement stone* (stored in Break Room drawer).  \n  2. Use the *tweezers* (left near the microscope) to remove the clogged one.  \n  3. Check the *pressure gauge* (hidden behind tubing) to confirm airflow.  \n\n---  \n\n**Final Note:** The scene’s density (e.g., similar-looking tanks, distracting clutter) forces precise communication. Time-sensitive tasks (e.g., feeding fry, shipping deadlines) create natural role division. Every object has a purpose—or a broken state begging to be fixed.  \n\nWould you like to expand any section further? For example:  \n- Add **sound cues** (e.g., the hum of failing filters)?  \n- Deepen **time pressures** (e.g., a countdown clock for a FedEx pickup)?"
}