{
  "id": 1190,
  "raw": "\nRetrieved from http://chowhound.chow.com/topics/581245\nText:\nHOME > Chowhound > Food Media & News >\n\n\nMercury Toxicity in Fish\n\n\nNews about Jeremy Piven's recent diagnosis of mercury toxicity (probably in part due to eating large amounts of fish) might encourage CH to finally allow me to keep a post here about fish. Lately the moderators have been a little \"delete-happy.\" ;-) If for no other reason, people might want to take a look at the kind of fish they are eating and how it might impact themselves as well as the environment. I'll try to keep it vauge, but I encourage folks to look into the issue. Granted, we all don't have the money to eat as much sushi as Mr. Piven reportedly does, but it should be noted that pollution in combination with the decline in certain species of fish is a real threat and a real issue.\n\n  1. Click to Upload a photo (10 MB limit)\n  1. I agree with you Haagen Dazs. As our waters become more polluted do we think our fish will not be effected? I live in a beautiful town where the crab and some fish have been cautioned for eating because of dioxin from a closed down paper plant. People still eat it, but I just cannot go there. In the Keys of Florida runoff from sugar agrabiz is killing the reef - cutting off a vital link in the food chain.\n\n    With all the causes out there and predictions of dire consequence from inaction, I am appalled that nobody seems to be giving a rip about tossing trash in the ocean, over fishing, raping the sea bottom. Many shellfish beds that have been harvested forever have been shutdown due to E-Coli and ASP. Gross and terrifying.\n\n    if you are gonna have passion it should be for the things necessary for life.\n\n    OK off the soapbox. I will also make no snide comments about Jeremy Piven.\n\n    - - I just read the Huffpo. It could also be the herbs he was taking. Who takes those anymore?? Did you see his doc on his spiritual trip to India? Maybe he needs to lay off the herbs. Oh.. I said I would not go off on Piven. It is so hard to resist.\n\n    3 Replies\n    1. re: Sal Vanilla\n\n      I think too many people are quick to assume that Chinese medicine is pure quackery. When I lived in Japan, doctors would prescribe traditional and Chinese medicine equally and you could get both in a traditional pharmacy. Yes, some Chinese herbs may be adulterated with mercury, but certainly we've seen in recent times that traditional medicines have been adulterated with other items as well.\n\n      1. re: queencru\n\n        I don't /didn't call them all quackery. BUT I do know that they are not regulated, we often do not know what is in them or what the components effects on our bodies are or their interactions with medications. There have been plenty of cautions out there for say... herbal weigh loss tea, wu wei zi (used widely to ward off illness), Jin Bu Huan - prescribed for minor complains - has been killing people. It has to do with lack of knowledge by practicioners and consumer and an odd belief that if it is ancient chinese anything it has to be good, Sometimes not true. Best to be cautious.\n\n        1. re: Sal Vanilla\n\n          Sal Vanilla, you are absolutely right. It constantly amazes me how people are willing to swallow anything if they are told it will help them lose weght/increase their energy/grow a bigger penis/etc. without having any concern or knowledge about what it is exactly that they are ingesting.\n\n    2. I was wondering if his mercury poisoning was due to fish of some kind. Is it, indeed, because of sushi? If so, it will be very interesting to see if his illness sheds more light on the plight of our fish.\n\n      1. The original comment has been removed\n        1. Jeremy is a great guy..both of us are drummers and I only wish the best for him and a speedy recovery...the snide comments from the cast are in extremely bad taste.\n          Maybe it was from the sushi but I think it is from the Chinese Herb pills he had been taking.\n\n          14 Replies\n          1. re: Beach Chick\n\n            Seems some suspect it is not mercury poisoning Piven is suffering from. But if so maybe mercury poisoning symptoms include bad acting. In that case Keanu Reeves, Kevin Costner and Nicholas Cage should studiously avoid fish.\n\n            OK seriously, did you notice who his doctor was. Carlon Colker, a nutritional supplement hawker.\n\n            1. re: Beach Chick\n\n\n              and you think this because.... ?\n\n              1. re: cimui\n\n                There have been noted concentrations of mercuric compounds in some Chinese herbal remedies:\n\n\n                This article is from 1995, but there are current examples of such articles available from a variety of journals online.\n\n                1. re: ferret\n\n                  that may be true, but there are similar articles about mercury content in fish. i'm just wondering why beach chick would think that \"sushi\" (sashimi) is safe while herbal medicine is not?\n\n                  1. re: cimui\n\n                    i'm with cimui...assuming the issue really *is* mercury toxicity (of which Mamet & the Hollywood gossip machines apparently aren't convinced), i'd be willing to bet it's from his frequent sushi consumption, not the herbs.\n\n                    if it was melamine toxicity i might think otherwise ;)\n\n                    there were reports earlier this year about heavy metals in herbal remedies, but the contaminated products were from India, not China.\n\n                    i think it's good that the issue of the physiological and environmental impacts of seafood consumption has been resurrected...it's just unfortunate that it always seems to require some sort of health crisis or tragedy to do it.\n\n                    1. re: goodhealthgourmet\n\n                      and i'd be willing to bet he eats a lot more sushi than chinese herbs: the former tastes a *heckuva* lot better than the latter!\n\n                    2. re: cimui\n\n                      Wow...didn't know that I was going to get so flamed for a comment that was in print from his Dr.\n\n                      They tested the herb pills and found them to be of moderate levels of mercury.\n\n\n                      1. re: Beach Chick\n\n                        hey beach chick, i didn't mean to flame. i was (and am) sincerely curious why you'd assume one was safe, but the other wasn't, when there are published reports out there about mercury in both sources, and the OP's article mentions both sources, too.\n\n                        (i'll refrain from commenting about fox as a news source! :)\n\n                        1. re: cimui\n\n                          LOL..I was going to put a caveat about Fox News Source.. ; )\n\n                          I eat a lot of sushi and wasn't trying to say that sushi doesn't have its mercury sources...he had six times the level of mercury.\n                          It just seemed to me that when reading that article and other sources that it was the herb pills..\n                          I could be SO frigging wrong and will own up to it..\n\n                          1. re: Beach Chick\n\n\n                            i'm sure the two in combination aren't terribly great for you -- but based on the trials and travails of one struggling b'way hopeful i know, b'way by itself can give you its own kinds of poisoning without any external aid whatsoever.\n\n                            really appreciate the OP's post, though. unfortunately for me, the lower-mercury stuff like salmon is exactly the kind of fish i don't like all that well in raw form and i *love* tuna in all its mercury-loaded variations. i realize tuna fish are rather large, but i wonder if anyone's ever thought about farming them in mercury free environs. too big for someone's backyard pool?\n\n                              1. re: paulj\n\n                                holy tuna casserole. i can't imagine what the tuna might cost given real estate prices in japan, in general. i guess we'll get an update on whether the tuna were able to reach full growth sometime this year. can't wait. :)\n\n                                (but a bit perturbing, that quote about how sending tuna off to slaughter is a bit like sending the daughters away to be married!)\n\n                              2. re: cimui\n\n                                Just bought a pound of Big Eye today and going to make my cherished Poke with seaweed ...I have it marinating as I type.\n                                I'll cheer to you!\n\n                          2. re: Beach Chick\n\n                            As somebody who deals with Chinese herbs, it's probably a combo of both. Chinese herbs vary widely in quality. It's important to get it from a reliable supplier like Mayway who regularly does testing of heavy metals on their herbs. And I had a patient who ate fish every single day for years and took no herbs. He had astonishingly high levels of mercury in his blood.\n\n                  2. ok, i'll have to stay out of any substantive discussion on this subject given that i only know how to regurgitate what i read in mainstream newspapers, but this is the funniest thing i've read all week:\n\n                    \"I talked to Jeremy on the phone, and he told me that he discovered that he had a very high level of mercury,\" Mamet said. \"So my understanding is that he is leaving show business to pursue a career as a thermometer.\"\n\n                    3 Replies\n                    1. re: cimui\n\n                      I read that this morning. I laughed so hard cereal leaked from my mouth.\n\n                      1. re: cimui\n\n                        That should win quote of the year.\n\n                        Does he seriously use that guy as a doctor? He doesn't even seem capable of playing one on television.\n\n                        1. re: dolores\n\n                          ...but he did stay in a holiday inn select last night.\n\n                          i thought this was interesting: \"But let’s assume Piven's claims are well-intended. According to his doctor, he ate sushi twice a day. But he would have to eat about 108 pieces of tuna sushi rolls every week for his entire lifetime in order to introduce any new health risks from mercury.\" http://www.consumerfreedom.com/news_d...\n\n                          also a wealth of info links: http://www.MercuryFacts.org/\n",
  "response": "# **Scene Concept: \"Aquatic Toxicology Research Station\"**  \n\n## **1. Overall Scene Theme and Core Concept**  \nA mid-sized **Aquatic Toxicology Research Station** perched on the edge of a polluted estuary, where scientists study mercury contamination in marine life. The facility is a blend of **wet lab, dry lab, and field sampling prep areas**, with an urgent atmosphere—recent findings suggest dangerously high mercury levels in local fish populations, and a government inspection is imminent.  \n\n**Why Multi-Agent?**  \n- Heavy objects (sample coolers, tanks) require coordinated lifting.  \n- Complex procedures (chemical handling, equipment calibration) demand role specialization.  \n- Time-sensitive tasks (sample processing before degradation) necessitate parallel workflows.  \n\n---  \n\n## **2. Spatial Layout and Area Descriptions**  \n\n### **A. Main Laboratory (Wet Lab)**  \nA sterile but cluttered space with stainless steel tables, fume hoods, and rows of specimen jars. The hum of refrigeration units and the sharp scent of preservatives hang in the air.  \n\n### **B. Instrumentation Room (Dry Lab)**  \nCramped and dominated by analytical machines—gas chromatographs, atomic absorption spectrometers—and a wall of flickering monitors displaying real-time data.  \n\n### **C. Field Gear Storage & Prep Zone**  \nMuddy boots, waterproof cases, and a large industrial sink for rinsing sampling equipment. A whiteboard lists recent collection sites with alarming notes (\"Site 4: 2.1ppm Hg—DO NOT CONSUME\").  \n\n### **D. Cold Sample Archive**  \nA walk-in refrigerator with racks of meticulously labeled fish tissue samples in vacuum-sealed bags. Frost creeps along the edges of the door seals.  \n\n### **E. Break Room / Office Nook**  \nA small, coffee-stained space with a microwave, a bulletin board cluttered with safety memos, and a dented filing cabinet sagging under years of reports.  \n\n---  \n\n## **3. Detailed Area-by-Area Inventory**  \n\n### **A. Main Laboratory (Wet Lab)**  \n**a. Anchor Furniture & Installations:**  \n- **Central dissection table (2m x 1m, stainless steel, adjustable height)** with built-in drainage and a slightly cracked glass cutting board.  \n- **Fume hood (1.5m wide, humming softly)** containing a bubbling digestion apparatus for tissue samples.  \n- **Floor-standing centrifuge (120kg, bolted down)** with a faded \"CAUTION: BIOHAZARD\" sticker.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Mercury-contaminated fish samples** in glass jars (labeled \"High-Risk—Gloves Required\"). One jar has a hairline crack leaking preservative fluid.  \n- **Digital analytical balance (0.001g precision)**, currently displaying \"CALIBRATE\" in red LEDs.  \n- **Locked chemical cabinet** containing **methylmercury standards (5mL vials, requires keycard)**.  \n\n**c. Functional Ambient Objects:**  \n- **Autoclave (door slightly ajar, beeping intermittently)** with a stack of unsterilized petri dishes beside it.  \n- **Wall-mounted emergency shower** with a peeling inspection tag (last tested 11 months ago).  \n- **Rolling lab cart (wobbly left wheel)** holding a tray of pipettes and a half-empty bottle of pH buffer.  \n\n**d. Background & Decorative Objects:**  \n- **\"Days Since Last Incident: 3\"** whiteboard tally near the door.  \n- **Coffee mug (\"World's Best Toxicologist\")** repurposed as a holder for dissection pins.  \n- **Framed NOAA fisheries permit** hanging crookedly beside a faded poster of **mercury cycle diagrams**.  \n\n---  \n\n### **B. Instrumentation Room (Dry Lab)**  \n*(Follow same structure—examples below for brevity)*  \n- **Anchor:** Atomic absorption spectrometer (needs argon tank replacement).  \n- **Key Interactive:** Faulty chromatograph printer (jammed, out of thermal paper).  \n- **Functional Ambient:** Backup hard drives (one blinking \"SYNC ERROR\").  \n- **Background:** Stack of outdated calibration manuals, sticky-note reading \"DON’T TOUCH—GREG’S PROJECT.\"  \n\n---  \n\n## **4. Scene Affordances and Embedded Potential**  \n\n### **Collaborative Transportation Affordances**  \n- **Mercury waste drum (200L, 85kg when full)**—requires two agents to lift safely into the hazardous materials cart.  \n- **Fish specimen freezer (2m tall, 300kg, wheel lock engaged)**—needs coordination to move without tipping archived samples.  \n\n### **Reasoning & Tool-Use Affordances**  \n- **Attribute-Based Reasoning:**  \n  - Among **five solvent bottles**, only **ethyl acetate (blue cap, \"FLAMMABLE\" in bold)** can fix the chromatograph—but it’s stored beside near-identical **hexane (also blue cap, smudged label)**.  \n- **Compound Tool-Use:**  \n  - **Problem:** Centrifuge imbalance error (requires counterweight).  \n  - **Solution:** A **missing calibration weight** is later found in the break room, buried under old mail.  \n\n### **Environmental Storytelling Hooks**  \n- A **water-damaged logbook** reveals past data tampering.  \n- **Draft emails on a monitor** hint at pressure to downplay mercury levels.  \n\n---  \n\n**Why This Works for AI Simulations:**  \n- **Physical collaboration** is mandatory (heavy/awkward objects).  \n- **Procedural complexity** (calibration, contamination risks).  \n- **Embedded \"noise\"** (similar-looking bottles, distractions) forces precise reasoning.  \n- **Time pressure** (spoiling samples, impending inspection) adds urgency.  \n\nThe station isn’t just a lab—it’s a **high-stakes puzzle box** where every object tells part of a hidden story."
}