{
  "id": 1196,
  "raw": "\nRetrieved from http://en.wikipedia.org/wiki/Praemunire\nText:\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\n\nIn English history, praemunire or praemunire facias was a law which prohibited the assertion or maintenance of papal jurisdiction, imperial or foreign, or some other alien jurisdiction or claim of supremacy in England, against the supremacy of the monarch. This law was enforced by the Writ of Praemunire facias, a writ of summons from which the law takes its name.\n\nThe name praemunire may denote the statute, the writ, or the offence.\n\nPraemunire in classical Latin means to fortify. In medieval Latin, praemunire was confused with and used for praemonere, to forewarn, as the writ commanded that the sheriff do (facias) warn (praemunire) the summoned person to appear before the Court.[1]\n\n\nThe Statute of Praemunire (16 Ric. 2, c. 5) was passed by the Parliament of England during the reign of Richard II, who purchased various loans from foreign creditors and rulers as well as bulls from Rome in 1392. It was only one of numerous stringent measures passed for the purpose of restraining the Holy See and all forms of papal authority in England and of eliminating in general the influence of foreign powers especially creditors and the Holy Roman Emperor. Because the Papacy had long claimed a form of temporal supremacy over England and Ireland, from the beginning of the 14th century, papal intervention had been particularly active, more especially in two forms. The one, the disposal of ecclesiastical benefices, before the same became vacant, to men of the pope’s own choosing; the other, the encouragement of resort to himself and his curia, rather than to the courts of the country, for legal justice.\n\nThe Statute of Provisors (1306), passed in the reign of Edward I, was, according to Sir Edward Coke, the foundation of all subsequent statutes of praemunire. This statute enacted \"that no tax imposed by any religious persons should be sent out of the country whether under the name of a rent, tallage, tribute or any kind of imposition.\" A much greater check on the freedom of action of the popes was imposed by the Statute of Provisors (1351) and the Statute of Praemunire passed in the reign of Edward III.\n\nThe former of these, after premising \"that the Pope of Rome, accroaching to him the seignories of possession and benefices of the holy Church of the realm of England doth give and grant the same benefices to aliens which did never dwell in England, and to cardinals, which might not dwell here, and to others as well aliens as denizens, as if he had been patron or advowee of the said dignities and benefices, as he was not of right by the laws of England ...\" ordained the free election of all dignities and benefices elective in the manner as they were granted by the king’s progenitors.\n\nLater developments[edit]\n\nThe Statute of Praemunire (the first statute so called) (1353), though especially leveled at the pretensions of the Roman Curia, was also leveled against the pretensions of any foreign power and therefore was created to maintain the independence of the crown against all pretensions against it. By it, the king \"at the grievous and clamorous complaints of the great men and commons of the realm of England\" enacts \"that all the people of the king’s ligeance of what condition that they be, which shall draw any out of the realm in plea\" or any matter of which the cognizance properly belongs to the king’s court shall be allowed two months in which to answer for their contempt of the king’s rights in transferring their pleas abroad. The penalties which were attached to the offence under this statute involved the loss of all civil rights, forfeiture of lands, goods and chattels, and imprisonment during the royal pleasure.\n\nMany other statutes followed that of 1353, but that which was passed in the sixteenth year of Richard II's reign is, as mentioned before, usually referred to as the Statute of Praemunire. This statute, after first stating \"that the right of recovering the presentments to churches, prebends, and other benefices … belongeth only to the king’s court of the old right of his crown, used and approved in the time of all his progenitors kings of England,\" proceeds to condemn the practice of papal translation, and after rehearsing the promise of the three estates of the realm to stand with the king in all cases touching his crown and his regality, enacts \"that if any purchase or pursue, or cause to be purchased or pursued in the court of Rome, or elsewhere, any such translations, processes, and sentences of excommunications, bulls, instruments or any other things whatsoever ... he and his notaries, abettors and counsellors\" shall be put out of the king's protection, and their lands escheat.\n\nPraemunire declined in importance, but experienced a resurgence under Henry VIII as the Protestant Reformation unfolded. First individuals were indicted for praemunire, then groups of clergy, and lastly the entire English clergy was accused of being agents of a foreign power (the Pope). In time, Henry asserted himself as \"of the Church of England in Earth under Jesus Christ Supreme Head\", and the clergy of the Church of England no longer answered to a foreign power.\n\nDuring the 19th century the Camerlengo of the time would on occasion communicate the death of a Pope to the British Monarch (along with other rulers), and made occasional other communications. There was some discussion as to whether the Statute of Praemunire meant that no response could be made: the compromises reached included conveying messages on a 'private' rather than 'official' level, or going via the Hanoverian minister at London (responding as King of Hanover). Eventually it was decided that there was no legal obstacle to establishing formal diplomatic relations.[2]\n\n\n\n  1. ^ Oxford English Dictionary, s.v. praemunire. Second edition, 1989.\n  2. ^ FO 95/736, The National Archives\n",
  "response": "# **Scene Concept: The Ecclesiastical Archive & Scriptorium**  \n**Inspired by** *Praemunire* – the historical tension between royal and papal authority, legal documents, and the control of information.  \n\n## **1. Overall Scene Theme & Core Concept**  \nA sprawling **medieval ecclesiastical scriptorium and archive**, where scribes, scholars, and clerks labor under the watchful eyes of both royal and religious authorities. The space is a nexus of **political tension**—documents of immense legal and theological consequence are being copied, sealed, or hidden, while agents of the Crown and Church maneuver for control.  \n\n**Why Multi-Agent?**  \n- **Heavy objects** (locked chests, massive tomes) require multiple people to move.  \n- **Complex workflows** (document authentication, wax sealing, cipher decoding) demand role specialization.  \n- **Secrecy & deception**—some agents may be spies, altering records or smuggling forbidden texts.  \n\n---  \n\n## **2. Spatial Layout & Area Descriptions**  \n### **A. The Grand Scriptorium (Main Hall)**  \n- A high-ceilinged chamber lined with **writing desks**, each with inkwells, quills, and parchment weights.  \n- **Dominant feature:** A **raised dais** where the **Master Scribe** oversees work.  \n- **Atmosphere:** The scent of ink and beeswax, the scratching of quills, the occasional whispered argument.  \n\n### **B. The Sealed Archives (Restricted Section)**  \n- A **barred iron door** leads to this chamber, where **forbidden texts** and **royal decrees** are stored.  \n- **Dominant feature:** A **massive locked chest** (300kg, reinforced iron bands) containing the **original Praemunire statutes**.  \n- **Atmosphere:** Cold, dimly lit by a single flickering oil lamp. Dust motes swirl in the air.  \n\n### **C. The Clerk’s Preparation Room**  \n- A **cluttered workspace** where documents are prepared before entering the scriptorium.  \n- **Dominant feature:** A **large vat of molten wax** for sealing documents, kept over a **low brazier**.  \n- **Atmosphere:** Warm, sticky, the scent of melting wax and woodsmoke.  \n\n### **D. The Hidden Vestibule (Secret Passage)**  \n- Concealed behind a **false bookshelf**, this cramped passage is used to **smuggle documents** out.  \n- **Dominant feature:** A **small iron-banded door** (locked from the inside, key hidden in the Clerk’s Room).  \n- **Atmosphere:** Dank, with the faint scent of mildew.  \n\n---  \n\n## **3. Detailed Area-by-Area Inventory**  \n\n### **A. The Grand Scriptorium**  \n**a. Anchor Furniture & Installations:**  \n- **12 writing desks** (oak, ink-stained, each with a **brass candle holder**).  \n- **Master Scribe’s lectern** (elevated, with a **gold-embossed ledger**).  \n- **Large iron chandelier** (holding 20 candles, some burnt low).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Royal Decree (faded parchment)** – requires **verification** against the chest in the Sealed Archives.  \n- **Counterfeit Seal Press** (hidden in a **false drawer** of Desk #7).  \n- **Inkwell (nearly empty, needs refilling from the Clerk’s Room).**  \n\n**c. Functional Ambient Objects:**  \n- **Quill sharpening knife** (left on Desk #3, slightly rusted).  \n- **Stack of blank vellum** (on a side table, one sheet slightly torn).  \n- **Small bell** (used to summon clerks).  \n\n**d. Background & Decorative Objects:**  \n- **Torn papal bull** (discarded in a corner).  \n- **Framed portrait of King Richard II** (slightly crooked).  \n- **Dried flowers** (left by a sentimental scribe).  \n\n---  \n\n### **B. The Sealed Archives**  \n**a. Anchor Furniture & Installations:**  \n- **Iron-banded chest (300kg, requires two people to lift).**  \n- **Heavy oak shelves** (filled with **bound codices**).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Original Praemunire Statute** (inside the chest, **sealed with royal wax**).  \n- **Broken lockpick** (discarded near the chest, hinting at past tampering).  \n\n**c. Functional Ambient Objects:**  \n- **Lantern (oil half-full, wick needs trimming).**  \n- **Dusty ledger** (records of document access).  \n\n**d. Background & Decorative Objects:**  \n- **Cobwebs in the corners.**  \n- **A single withered rose** (left by a former archivist).  \n\n---  \n\n### **C. The Clerk’s Preparation Room**  \n**a. Anchor Furniture & Installations:**  \n- **Wax-melting brazier (hot, emits faint smoke).**  \n- **Parchment-stretching frame.**  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Royal Seal Stamp (hidden under a loose floorboard).**  \n- **Key to the Hidden Vestibule (inside an empty ink bottle).**  \n\n**c. Functional Ambient Objects:**  \n- **Stack of blank wax discs.**  \n- **Drying rack for freshly inked documents.**  \n\n**d. Background & Decorative Objects:**  \n- **Half-drunk cup of wine (forgotten on a stool).**  \n- **Scribbled love note (tucked in a drawer).**  \n\n---  \n\n## **4. Scene Affordances & Embedded Potential**  \n\n### **Collaborative Transportation Affordances:**  \n- **The 300kg chest** in the Sealed Archives **cannot be moved alone**—agents must work together to shift it.  \n- **The molten wax vat** is dangerous to carry—requires coordination to avoid spills.  \n\n### **Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:**  \n  - Among **five wax seals**, only **one** has the **correct royal insignia** (a lion rampant). The others are forgeries.  \n  - **Distractor:** A decorative **lion-shaped paperweight** nearby could mislead.  \n- **Compound (Tool-Use) Reasoning:**  \n  - To **open the hidden passage**, agents must:  \n    1. **Find the key** (hidden inside an ink bottle).  \n    2. **Unlock the door** (while avoiding detection).  \n\n---  \n\n**Final Note:** This scene is **ripe for intrigue**—documents can be **altered, stolen, or forged**, and the **clash of loyalties** (Crown vs. Church) ensures dynamic conflict. The **density of interactive objects** ensures no two playthroughs are the same."
}