{
  "id": 1225,
  "raw": "\nRetrieved from http://meta.stackexchange.com/questions/141674/auto-embed-jsfiddle-into-questions\nText:\nWhat is meta? ×\n\nAmong the /// tags, it's common to use jsFiddle to give a self-contained example.\n\nUnfortunately, it leads to really, really crappy questions, in that you end up with a question that consists mostly of an outside link. This usually leaves the question as borderline NARQ.\n\nBalsamiq mockups can be embedded in a question on UX and YouTube videos can be embedded on certain Stack Exchange sites. This is enabled through an external API provided by these services.\n\njsFiddle allows embedding of a fiddle in a page given you have the URL of the fiddle.\n\nThat said, if a raw link to a fiddle is encountered on a line of it's own, embed it appropriately as well as embed the original link in the question (possibly through an HTML comment or through a <noscript> tag)\n\nThis will give more context to questions and answers that rely heavily on jsFiddle (and let's face it, given the tag soup above, it's the norm).\n\nTo be clear, I'm not looking for Stack Exchange to host their own fiddle-like service, the feature request is to embed the content from the already existing service.\n\nshare|improve this question\n+1 for the \"tag soup\" pun alone. –  BoltClock's a Unicorn Jul 30 '12 at 16:29\ncan we embed and keep a copy in a <!-- --> comment or hidden but attached in some way so it goes into the datadumps too? (And works if jsfiddle dies) –  Flexo Jul 30 '12 at 16:33\n@Flexo or wrap it in a <noscript> –  Ben Brocka Jul 30 '12 at 16:35\nDon't we want to discourage fiddle only posts? Having the system \"embed that for you\" is kind of enabling people to post link only answers/questions... –  Lix Jul 30 '12 at 16:36\n@lix jsFiddle links (or ideone) is great so long as it's not the only thing and not just a link. That would seem to fix the problem nicely. –  Flexo Jul 30 '12 at 16:37\n@Lix Yes, I'd like to, but it's a battle we seem to be losing here. I don't think this will solve all the problems, but it would help greatly in making the content on the page much more valuable. We rely on smaller (Balsamiq) and larger (YouTube) sites to provide context for questions on other sites, we might as well start doing it on Stack Overflow (where it makes sense and there's an obvious gain). –  casperOne Jul 30 '12 at 16:39\nIf we add jsFiddle then I want SQLFiddle too! –  juergen d Jul 30 '12 at 17:44\nEven for non link-only questions embedding the fiddles would be great. +1 and enjoy your badge :) –  Adam Rackis Jul 30 '12 at 17:54\nA JS Bin hosted on SE would solve the issue better than a third party site. –  toscho Aug 1 '12 at 21:18\nBy embed do you mean like an iframe, or pull the code via the API and have it dumped into the actual post? Like auto-fill. –  random Jun 15 at 13:07\n\n2 Answers 2\n\nI disagree with embedding this from a technical standpoint, there's one hugely important aspect to anything we embed: it has to be stable, and jsFiddle simply isn't (yet). They are having outages as they go through some growing pains...and an answer being offline because of its useful content is on a downed third-party service isn't a position we want to be in.\n\nWhen we \"bless\" a way for answer content to appear, we're saying that it's ok that the embed is the answer (or most of it, at least)...and not a supplement to the answer that stands on its own. That's fine, if we can depend on the content being there, and at this point, we can't.\n\nThis doesn't address the \"it doesn't cover any language other than JavaScript\" (of which we have many) side of things either, that's a whole other discussion if this were a good option for embed itself.\n\nKeep in mind I don't say this as just a developer, but as someone who uses jsFiddle in their answers quite a bit.\n\nshare|improve this answer\nSo given the preponderance of jsFiddle links in Stack Overflow questions and answers where that's the only content, isn't it in Stack Exchange's best interests to help them make it stable? Right now, if jsFiddle went down permanently, that's it, a ton of questions on Stack Overflow go out the window. I don't disagree that it should be stable, but if so many posts rely on it already as the sole source of content, then it could be something worth looking into (and then this would be a nice side effect of helping make them stable). I mean, we're all about making the Internet better, no? –  casperOne Jul 30 '12 at 16:45\nIf we embed and clone there's a fallback. Something (e.g. an easy way to link and quote in a code block) should be done given the volume of users who think just a jsFiddle is sufficient. Automatically fixing that in some way seems the nicest solution. –  Flexo Jul 30 '12 at 16:46\n@casperOne - you're pitching a scenario in which link-only content is okay...it's not, and never has been. Basing the argument on something else we don't support isn't the right place to start. Also, how do you propose we help make them stable? –  Nick Craver Jul 30 '12 at 16:47\n@Flexo - no, not really...because you're free to update the fiddle at any time without our knowledge, this isn't possible with youtube or balsamiq due to how they work. For example, balsalmiq is not a simple drop in, we worked with their developer so that the source is stored on our side with special editor changes they made to accommodate it being incorporated into our sites. –  Nick Craver Jul 30 '12 at 16:48\n@NickCraver Can you run an in house instance of jsFiddle then? The functionality is really useful, which is why people like it so much. Seems like the sort of thing the people behind jsFiddle would like. –  Flexo Jul 30 '12 at 16:49\n@Flexo - what about all the other languages? That's not a small ask, not even close...and it only tackles one language. jsFiddle already exists as an excellent supplement, supporting an embed to replace link only answers would just serve to upgrade them from link-only to code-only, which is rarely ever okay either. Hosting it in-house doesn't solve the content issues, just the stability one after a very, very significant dev investment to do so. –  Nick Craver Jul 30 '12 at 16:54\n@NickCraver I don't think link-only content is ok, but frankly, we're losing this battle. Better to make the content on the page better where we can to try and gain some ground back. As for how to help them, that's where you guys come in. I wouldn't be the one asking them what the root of their stability issues are. I'm sure Balsamiq had to be vetted beforehand, the process here would be similar. –  casperOne Jul 30 '12 at 17:03\n@casper: I think what Nick's saying is, you're asking for a non-trivial amount of dev work to make some of the worst answers slightly less-bad. It's also possible it would make some good answers slightly better - but that's even more of a crap-shoot. –  Shogging through the snow Jul 30 '12 at 17:54\n@Shog9 It's not just answers, it's questions as well. Also, not discounting the amount of effort. However, the effort here is less than the social engineering effort you'd have to perform in order to definitively solve the issue in the first place. I'm all for addressing the root problem (perhaps just ban jsFiddle altogether). –  casperOne Jul 30 '12 at 18:04\nSolving the problem in this case amounts to finding a way to turn lead into gold. We can find some useful things to do with all this lead, and we can encourage the production of more gold, but there's no philosopher's stone. jsFiddle is a useful tool that is frequently abused. –  Shogging through the snow Jul 30 '12 at 18:57\nFrom my perspective I'd largely given up flagging or commenting on jsFiddle only posts - it seems accepted, even expected in the relevant tags (example, another, a question, again, here). People reply to \"can you show it here too please?\" comments with answers that amount to \"why would I duplicate this content?\" because jsFiddle is useful. –  Flexo Jul 30 '12 at 19:01\n@Flexo We seem to be at a paradox then. We all know that jsFiddle-only answers are in poor form. However, we accept that as an exception of link-only answers (or rather, it's begrudgingly accepted). If we aren't going to make the social engineering effort, then we should make some sort of technical effort to improve quality in these situations. Whether that results in an embed or a ban makes no difference, the point is, something should be done. –  casperOne Jul 31 '12 at 12:03\n@Shog9 Hey, x-ray shielding. No disagreement that it is abused. Also, see my comment to Flexo above. –  casperOne Jul 31 '12 at 12:03\n\nI think this requires another look given that the co creator of JSFiddle Oskar Krawczk offered to help make this happen.\n\nIf JS Fiddle is willing to work specifically with SE to embed somehow, I bet they'd be willing to let SO host the code itself in the fiddles, that's easy enough. It's text, duplicate it and stick it in a table somewhere or host the code off of SE's servers or whatever. Blocking JS fiddle without code has caused some friction and really indicates a greater problem; we're not making use of an awesome tool here when a co-creator has stepped up and offered to help make it happen, and copying code is...so very, very easy.\n\nshare|improve this answer\n\nYou must log in to answer this question.\n\nNot the answer you're looking for? Browse other questions tagged .\n",
  "response": "### **Scene Concept: The Digital Archival Vault & Code Preservation Lab**  \n\n#### **Overall Scene Theme and Core Concept**  \nInspired by the challenges of preserving digital content (like jsFiddle snippets) against instability and link rot, this scene is a *high-security archival facility* where teams of agents collaborate to safeguard, verify, and restore critical digital artifacts.  \n\nThe facility is divided into **three zones**:  \n1. **The Receiving & Authentication Bay** (where incoming code snippets are logged)  \n2. **The Primary Archival Vault** (secure storage for verified backups)  \n3. **The Restoration Lab** (where corrupted or outdated snippets are repaired)  \n\nThe environment is inherently **collaboration-heavy**:  \n- Heavy servers require **multiple agents to move**.  \n- Time-sensitive archival tasks demand **parallel workflows**.  \n- Security protocols enforce **role-based access**.  \n\n---\n\n### **Spatial Layout & Area Descriptions**  \n\n#### **1. Receiving & Authentication Bay**  \n- **Purpose:** New digital artifacts arrive here for inspection before archival.  \n- **Atmosphere:** A mix of sterile efficiency and controlled chaos. Monitors flicker with validation scripts. A stack of unprocessed hard drives sits on a trolley.  \n- **Key Features:**  \n  - A **large scanning terminal** with biometric locks.  \n  - A **weigh station** for verifying physical media integrity.  \n  - A **quarantine shelf** for suspicious files.  \n\n#### **2. Primary Archival Vault**  \n- **Purpose:** Secure, climate-controlled storage for verified backups.  \n- **Atmosphere:** Dim blue server lights, low hum of cooling fans, the faint smell of ozone.  \n- **Key Features:**  \n  - **Rack-mounted servers** (each labeled with UUIDs).  \n  - A **manual override terminal** behind a glass panel (requires two keycards).  \n  - **Emergency power switches** (marked in red).  \n\n#### **3. Restoration Lab**  \n- **Purpose:** Digital forensics and snippet recovery.  \n- **Atmosphere:** Bright LED task lighting, white noise from air filters.  \n- **Key Features:**  \n  - A **central analysis console** with triple monitors.  \n  - **Degraded tape reels** in a labeled recovery tray.  \n  - A **reference library** of legacy programming manuals.  \n\n---\n\n### **Detailed Area-by-Area Inventory**  \n\n#### **1. Receiving & Authentication Bay**  \n**a. Anchor Furniture & Installations:**  \n- **Inbound Processing Desk** (2m x 1m steel surface, embedded RFID scanner).  \n- **Heavy-Duty Server Cart** (rated for 300kg, currently holding 4 HDD arrays).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Unverified External HDD** (label: \"Backup_2024-07-30\", slight casing crack).  \n- **Authentication Terminal** (displaying \"ERROR: Checksum Mismatch\").  \n- **Quarantine Bin** (locked, contains 3 corrupted USB drives).  \n\n**c. Functional Ambient Objects:**  \n- **Label Printer** (low on toner, jam light blinking).  \n- **ID Card Scanner** (green LED on, last log: \"User_Gamma authenticated\").  \n\n**d. Background & Decorative Objects:**  \n- **Faded \"Data Integrity\" Poster** (peeling at corners).  \n- **Overflowing Trash Bin** (crumpled validation reports inside).  \n\n---\n\n#### **2. Primary Archival Vault**  \n**a. Anchor Furniture & Installations:**  \n- **Server Rack A7** (2.5m tall, requires two people to tilt safely).  \n- **Emergency Power Relay** (locked behind a steel grate).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Master Backup\" Tape Drive** (status: \"Last Verified 14 days ago\").  \n- **Broken Cooling Fan** (grinding noise, overheating warning active).  \n\n**c. Functional Ambient Objects:**  \n- **HVAC Control Panel** (set to 18°C, slight condensation on glass).  \n- **Fire Suppression System** (pressure gauge in green).  \n\n**d. Background & Decorative Objects:**  \n- **Dusty \"Server Maintenance Log\"** (open to June entries).  \n- **Decorative Plant** (fake, covered in static cling dust).  \n\n---\n\n#### **3. Restoration Lab**  \n**a. Anchor Furniture & Installations:**  \n- **Forensics Workbench** (anti-static mat, magnifying lamp).  \n- **Legacy Drive Adapter Station** (floppy, ZIP, Jaz drives).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Corrupted Snippet Tape** (\"Error: Encoding Mismatch\").  \n- **Reference Code Snippet** (printed on thermal paper, fading).  \n\n**c. Functional Ambient Objects:**  \n- **Oscilloscope** (displaying noise pattern).  \n- **Coffee Maker** (empty carafe, \"Clean Me\" light on).  \n\n**d. Background & Decorative Objects:**  \n- **Whiteboard** (half-erased brainstorming notes).  \n- **Stack of Outdated Tech Magazines** (\"Java Monthly, 1999\").  \n\n---\n\n### **Scene Affordances & Embedded Potential**  \n\n#### **Collaborative Transportation Affordances**  \n- **Server Rack A7** (weight: **250kg**, dimensions: **2.5m x 0.8m**) – Requires **two agents** to safely move.  \n- **Emergency Power Relay** (locked behind a **500kg steel grate**) – Needs **coordinated effort** to open.  \n\n#### **Reasoning & Tool-Use Affordances**  \n- **Attribute-Based Reasoning:**  \n  - Among **five external HDDs** in Receiving, only **one** has:  \n    - A **blue \"Priority\" sticker**.  \n    - A **scratched barcode label**.  \n    - **Slightly warmer casing** (indicating recent activity).  \n  - **Distractor:** A decorative **blue stress ball** on the desk.  \n\n- **Compound (Tool-Use) Reasoning:**  \n  - **Problem:** The **Authentication Terminal** is frozen.  \n  - **Solution:** The **reset key** is inside a locked drawer (which requires **two keycards**).  \n\nThis environment is **rich in multi-agent challenges**, where **precision, coordination, and reasoning** are critical to success.  \n\n---  \n**Final Note:** Every object serves a purpose—whether as a task focus, a collaborative obstacle, or atmospheric depth. Agents must navigate both the **functional** and **decorative** layers to succeed."
}