{
  "id": 1239,
  "raw": "\nRetrieved from http://spectator.org/articles/41012/americas-record-recession\nText:\nThe Obama Watch\n\nAmerica’s Record Recession\n\nThe failure of Keynesian economics reconfirmed as never before -- not that any of it will register with our president.\n\nBy 8.26.09\n\nSend to Kindle\n\nKeynesian economics was born in the 1930s, the brainchild of British economist John Maynard Keynes. It argued that the way to stimulate a flagging economy back into growth was to increase government spending and deficits. The extra demand for goods and services from that increased spending would induce increased production to meet the demand, restoring full employment and growth.\n\nThe concept was quickly embraced by politicians and lefty academics because it justified exactly what they wanted. For the liberal/left politicians dominant in Washington at the time, it gave them cover for the record government spending they wanted to buy votes, without having to raise taxes fully to pay for it. For the lefty academics, it gave them cover for their wish list of runaway government spending policies.\n\nThere was just one problem. It never worked to revive economic growth and end the Depression. Rather, as demonstrated by Amity Shlaes in her landmark book The Forgotten Man, it was one component of a slew of Big Government policies that put the \"Great\" into the \"Great Depression,\" keeping unemployment absurdly high and preventing any natural, cyclical recovery for more than a decade.\n\nThe fallacies of Keynesian economics were exposed decades ago by Friedrich Hayek and Milton Friedman. Keynesian thinking was then fully discredited in the 1970s, when the Keynesians could offer no explanation and no cure for the double digit inflation, interest rates, and unemployment, and the persistent stagnation, that resulted from their policies. President Reagan formally dumped Keynesianism in favor of free-market and supply-side policies that produced a 25-year global economic boom.\n\nYet, President Obama showed up in early 2009 with the dismissive certitude that none of this history ever happened, and national economic policy was decidedly back in the 1930s.\n\nThe New Failure of Keynesian Economics\nAccording to the National Bureau of Economic Research, the current recession started in December 2007. From the beginning, we approached this recession with old-fashioned Keynesian economics, rather than the more modern, incentives-oriented, supply-side economics that has swept the world. In February, 2008, then President Bush cut a deal with Congressional Democrat majorities to pass a $152 billion stimulus bill entirely based on the Keynesian rationale of countering the recession with increased spending and deficits. The centerpiece was a tax rebate of up to $600 per person, which had no significant effect on economic incentives, as reductions in tax rates do.\n\nThis Keynesian stimulus produced no significant blip in the raging economic downturn, richly earning its well deserved fate of having been completely forgotten. Bush Treasury Secretary Henry Paulsen, the economic guru of the Administration at the time, himself was intellectually stuck in the deep historical recesses of Keynesianism, failing to promote Reagan's free market and supply side policies to counter the downturn. Indeed, Reagan's 25-year global boom ended as the Bush Administration abandoned every component of Reaganomics one by one, culminating in Paulson's throwback Keynesian stimulus in early 2008.\n\nYet, contrary to his campaign theme of change, President Obama simply quintupled down on Bush's 2008 Keynesianism. Obama learned nothing from the Bush/Paulsen/Pelosi/Reid early 2008 Keynesian failure, which Senator Obama vigorously supported at the time. President Obama came back in February, 2009 to support a new, $787 billion, purely Keynesian stimulus bill.\n\nEven the tax cut portion of that bill, which President Obama is still wildly touting to the public, was purely Keynesian. The centerpiece was a $400 per worker tax credit, which, again, has no significant effect on economic incentives. While President Obama is proclaiming that this delivered on his campaign promise to cut taxes for 95% of Americans, in the Democrat budget that passed Congress this year even this tax credit disappears after next year.\n\nSince World War II, recessions have averaged 10 months, and the longest has been 16 months. Exactly when the current recession can be scored as over is unclear at this point (positive GDP growth may have finally restarted). But it now has been 20 months since the recession began in December 2007, and it will clearly end as the longest by far since World War II. Indeed, from 1887 to 1929, recessions averaged 10 months as well, with the longest during that time also 16 months. For over 120 years at least, recessions have lasted the longest only when countered by intellectually and practically discredited Keynesian economics.\n\nWe now hear loud hosannas not for recovery, but for the slowdown in economic decline, with only 250,000 jobs lost last month, and the economy declining by only 1% in the second quarter. Based on his rhetoric, President Obama expects political credit for anyone who still has a job!\n\nThis bar for success is way too low. As indicated above, real economic recovery is now overdue by at least 4 months. Rather than promoting recovery, the Keynesian economic policies adopted by both Obama and Bush since the beginning of this recession have more likely delayed it, by borrowing hundreds of billions and ultimately trillions in investment capital out of the private economy, and destroying the jobs that would have resulted from that money in the private economy.\n\nCycles Naturally Go Up As Well As Down\nRemember the term business cycle? The sweeping, pro-growth policies adopted by President Reagan were so successful in preventing any major downturn for 25 years that we don't seem to remember what that term means anymore. But it implies that along with periodic downturns the economic cycle will naturally turn up as well. Every morning the American people wake up and throw themselves into restoring the economic viability of their businesses, or finding themselves jobs. This is the primary factor in causing the economy eventually to turn back up.\n\nThe Keynesian economic policies adopted by Obama and Bush do nothing to help these businessmen and working people cure the economy. Borrowing close to a trillion dollars from the private economy to increase government spending by close to a trillion dollars does nothing to expand the economy on net. Indeed, it may well result in a net loss of jobs due to government carrying costs and the economic friction resulting from moving all of that money around. Moreover, again this policy does nothing to increase incentives for investment, starting new businesses, expanding businesses, creating new jobs, or entrepreneurship. For these reasons, the best estimate of the number of jobs saved or created by the Obama stimulus is exactly zero.\n\nThe result of the willfully blind, throwback, untutored Keynesian economic policies continued and wildly expanded by President Obama is the longest recession since World War II dragging on for around 20 months now, and maybe still more. Almost 7 million jobs have been destroyed during this overextended downturn. Besides the 250,000 additional jobs lost last month, another 422,000 former workers dropped out of the workforce altogether. Almost 800,000 workers are counted as officially discouraged because they can't find work, and so are not even counted as in the work force or in the official unemployment rate. Another 8.8 million who have been reduced to part-time status due to the recession are also not counted in the unemployment rate, and many others have suffered reduced hours as well. Over one third (5 million) of the 14.5 million unemployed have now been without work for at least 27 weeks, or about half a year, with almost 600,000 joining their ranks last month alone.\n\nPersonal income is down $427 billion from its peak in May 2008. Because the economy has been performing worse than expected, even the Obama Administration is now admitting that the deficit over the next 9 years will be $9 trillion, $2 trillion more than it projected at the time of its stimulus package in February. That is an increase in cumulative deficits of almost 30% from the mistaken Obama Administration projections of just 6 months ago. These deficit and debt numbers will only get worse as the recovery turns out to be not as strong as the Obama Administration has projected.\n\nRejecting Obama's rigid, doctrinaire Keynesianism, France and Germany saw economic growth return in the second quarter, with India, Brazil, and even communist China enjoying reviving growth as well. Clearly, what we have suffered in America is the failure of Keynesian economics yet again.\n\nThe Free Market Restores Economic Growth\nThe slowdown in economic decline we have recently experienced, and the actual recovery we will see soon, is due to the natural, curative process of the free market, not big government spending, deficits and debt, for the reasons discussed above. As Alan Reynolds explained in the Wall Street Journal on August 21:\n\n\nIndeed, in that same article Reynolds goes on to show that countries with higher government spending relative to GDP suffered deeper recessions over the past year and a half, while countries with lower government spending experienced shallower recessions or none at all. So, again, Keynesian spending stimulus does not seem to promote economic recovery.\n\nReigniting the Economic Boom\nEconomic recovery permanently reducing unemployment will only come from private job creating investment, which still has not sufficiently revived. Nothing in President Obama's Keynesian economic policies, or in Bush's Keynesian policies from 2008, helps with that.\n\nProducing long-term, booming, economic growth will require a fundamental change in economic policy. Start with corporate tax rates that are now just about the highest in the world. Restoring American competitiveness will require reducing the federal corporate tax rate from 35% to at least 20%. Yet, Obama plans to raise the corporate tax burden further.\n\nSharply raising individual income tax rates and capital gains tax rates, as Obama plans to do, is exactly the opposite of what is needed to counter still catastrophic unemployment. Scrap all that economic foolishness and instead cut the middle class 25% income tax rate to 15%, leaving 90% of taxpayers with a 15% flat tax. Scrap as well the proposed new 8% payroll tax on businesses that do not provide employee health insurance, which would perpetuate unemployment and further reduce wage incomes.\n\nAnother component of a foundation for long-term, booming growth is a reliable supply of low cost energy. But here again Obama is pursuing just the opposite, with a program of massive taxpayer subsidies to switch to unreliable, high cost alternatives, and a new cap and trade tax imposing trillions in new cost burdens with no policy justification.\n\nFinally, with only 10% of stimulus funding spent so far (another reason the Obama economic program deserves no credit for the slowing decline), University of Chicago economics professor Casey Mulligan is right. We should cancel the rest of the stimulus spending, which would cancel the borrowing of hundreds of billions more out of the private sector.\n\nUnfortunately, President Obama is still wedded to his political talking points, and his ideological blinders seem now to be attached to the skin. So don't expect any policy changes, no matter what happens. Expect an eventual return to 1970s style economic results instead.\n\nLike this Article\n\nPrint this Article\n\nPrint Article\nAbout the Author\n",
  "response": "### **Scene Concept: \"The Forgotten Economic Policy Archive\"**  \n\n#### **1. Overall Scene Theme and Core Concept**  \n*Theme:* A sprawling, semi-abandoned government archive storing decades of economic policy documents, research, and obsolete equipment—a relic of failed Keynesian experiments. The space is a maze of high shelves, locked cabinets, and forgotten relics, requiring collaborative navigation and problem-solving to uncover valuable records buried under bureaucratic chaos.  \n\n*Core Concept:* Teams must work together to locate, retrieve, and analyze critical documents while navigating physical obstacles (heavy file boxes, jammed machinery, locked doors) and logical challenges (deciphering outdated filing systems, cross-referencing records). The density of objects and their states (locked, broken, misplaced) creates an environment where **multi-agent coordination is mandatory**—no single agent can efficiently complete tasks alone.  \n\n---\n\n### **2. Spatial Layout and Area Descriptions**  \nThe archive is divided into **four key zones**, each with distinct challenges:  \n\n1. **Main Document Hall** – The central hub, lined with towering metal shelves stuffed with banker boxes, binders, and scattered loose papers. A large **manual freight elevator** (stuck between floors) dominates the center.  \n2. **Policy Research Wing** – A dimly lit annex with **microfilm readers, typewriters, and a locked server cabinet** containing old economic datasets. A **flickering fluorescent light** casts intermittent shadows.  \n3. **Storage Vault** – A secured area behind a **reinforced door (stuck due to a jammed hydraulic mechanism)**. Inside, rare **1970s economic reports** are stored in climate-controlled cases.  \n4. **Administrative Office** – Cluttered desks with **outdated computers, rotary phones, and a wall-mounted keybox (missing two keys)**. A **stuck drawer** contains a crucial access card.  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. Main Document Hall**  \n**a. Anchor Furniture & Installations:**  \n- **Industrial metal shelving units (2.5m tall, 1m deep)** – Sturdy but overloaded; some shelves sag under weight.  \n- **Freight elevator (1.5m x 2m platform, stuck between floors)** – Manual pulley system requires two agents to operate.  \n- **Collapsible rolling ladder (3m tall, wobbly left wheel)** – Needed to reach top shelves.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Sealed banker box labeled \"1975 Stagflation Reports\" (25kg, requires two agents to lift safely)**  \n- **Jammed microfilm projector (reels inside but belt snapped)**  \n- **\"Fragile: Do Not Stack\" crate (partially crushed under other boxes)**  \n\n**c. Functional Ambient Objects:**  \n- **Dusty label maker (low on tape, jammed once per 10 uses)**  \n- **Wheeled cart (one squeaky wheel, holds up to 50kg)**  \n- **Overflowing recycling bin (blocking half an aisle)**  \n\n**d. Background & Decorative Objects:**  \n- **Yellowed \"File Carefully\" poster peeling off the wall**  \n- **Dead potted fern on a filing cabinet**  \n- **Coffee ring stains on a desk with a half-empty mug**  \n\n---  \n\n#### **B. Policy Research Wing**  \n**a. Anchor Furniture & Installations:**  \n- **Microfilm reader station (1970s model, partially disassembled)**  \n- **Bulky mainframe terminal (off but hums when touched)**  \n- **Locked server cabinet (requires keycard + manual override lever)**  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Misplaced keycard (hidden under a stack of punch cards)**  \n- **Broken reel scanner (missing a tension spring)**  \n- **Unlabeled floppy disks in a cracked case**  \n\n**c. Functional Ambient Objects:**  \n- **Rotary phone (dial sticks at '6')**  \n- **Adjustable desk lamp (flickers intermittently)**  \n- **Tape dispenser (nearly empty, tape tears easily)**  \n\n**d. Background & Decorative Objects:**  \n- **Outdated \"Inflation Trends 1980\" bulletin board**  \n- **Dusty economics textbooks (one bookmarked at Keynes' chapter)**  \n- **A spiderweb between two monitors**  \n\n---  \n\n#### **C. Storage Vault**  \n**a. Anchor Furniture & Installations:**  \n- **Reinforced steel door (hydraulic hinge stuck in half-open position, requires lever force)**  \n- **Climate-controlled document cases (humming faintly, one flashing \"Low Coolant\")**  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **1973 Oil Crisis dossier (sealed in a fireproof case, combination-locked)**  \n- **Leaking pipe above a stack of reports (risk of water damage)**  \n- **Manual override crank (hidden behind a loose panel)**  \n\n**c. Functional Ambient Objects:**  \n- **Dehumidifier (clogged filter, needs cleaning)**  \n- **Stepladder (rusted joints, groans under weight)**  \n\n**d. Background & Decorative Objects:**  \n- **Moth-eaten \"Restricted Access\" curtain**  \n- **Cobwebbed emergency exit sign (flickering)**  \n\n---  \n\n#### **D. Administrative Office**  \n**a. Anchor Furniture & Installations:**  \n- **Large oak desk (one drawer stuck due to swollen wood)**  \n- **Wall-mounted keybox (missing two keys, one dangling by a thread)**  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Master Key List\" (torn corner, smudged ink)**  \n- **Jammed paper shredder (overheated, blinking red light)**  \n\n**c. Functional Ambient Objects:**  \n- **Filing cabinet (top drawer squeaks loudly when opened)**  \n- **Landline phone (off-hook, faint dial tone)**  \n\n**d. Background & Decorative Objects:**  \n- **Calendar stuck on August 2008**  \n- **Half-eaten sandwich in a desk drawer (…why?)**  \n\n---  \n\n### **4. Scene Affordances and Embedded Potential**  \n\n#### **Collaborative Transportation Affordances:**  \n- **Freight Elevator:** Requires **two agents** to pull the manual release lever simultaneously while a third stabilizes the platform.  \n- **\"1975 Stagflation Reports\" Box (25kg, bulky):** Too heavy for one agent—must be carried by two or moved via cart (which has a **squeaky wheel**, requiring coordination).  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:**  \n  - Among **five nearly identical document boxes**, only **one** has a **blue stripe, a torn shipping label, and a faint coffee stain**—critical for retrieval.  \n  - The **correct microfilm reel** is identifiable by a **small red dot**, unlike the others (distractor: a **decorative red sticker** on a nearby shelf).  \n- **Compound (Tool-Use) Reasoning:**  \n  - **Problem:** The vault door is stuck.  \n  - **Solution:** The **override crank** is hidden behind a loose panel (requires prying with a **letter opener from the office**).  \n  - **Secondary Problem:** The crank is **rusted**, requiring **lubrication (WD-40 can in a janitor’s closet)**.  \n\n---  \n\n### **Final Notes on Design Intent**  \nThis environment is **deliberately overstuffed** with objects—some critical, some red herrings—forcing agents to:  \n- **Collaborate physically** (heavy lifting, joint manipulation).  \n- **Reason carefully** (filtering signal from noise in a visually dense space).  \n- **Chain actions** (tools are scattered, requiring traversal between zones).  \n\nThe **mundane clutter** (old coffee cups, dead plants, outdated posters) adds realism while increasing perceptual complexity. Agents must **ignore irrelevant stimuli** while **zeroing in on subtle clues**—mirroring real-world problem-solving.  \n\n**Perfect for multi-agent AI testing.** 🚀"
}