{
  "id": 1262,
  "raw": "\nRetrieved from http://www.dailypaul.com/294023/video-rand-paul-says-america-is-in-full-blown-crisis-day-of-reckoning-has-arrived\nText:\n39 votes\n\nVideo: Rand Paul Says \"America Is In Full Blown Crisis,\" Day Of Reckoning Has Arrived!\n\n\"In a speech to pastors in Iowa, Senator Rand Paul says, \"America is in a full blown crisis\" and that the country has, \"arrived at a day of reckoning.\" He says that America needs revival saying, \"I think our moral compass is wavering.\"\n\nIf video doesn't work then go here to view the entire speech\n\nThe speech was given last Friday at the Iowa Pastors and Pews event in Des Moines. The Brody File had the only access.\n\nSenator Rand Paul:“I think we've arrived at another crossroads. We've arrived at a day of reckoning in our country. And the question is, will we falter or will we thrive and recover our mojo, as I like to put it. America I think has much greatness left if we believe in ourselves, if we believe in our founding documents, if we believe in a system that made us the richest, the freest and the most humanitarian nation ever. But the cracks are evident, the sand is shifting, I think our moral compass is wavering.\"\n\nContinued here:\n\nTrending on the Web\n\nComment viewing options\n\n\nYay, yet ANOTHER Rand reference to Lincoln!\n\nSeriously, I WANT to get behind this guy but I just wanna scream WTF! every time he moronically references the genocidal maniacal proto-fascist Lincoln.\n\nIs he pandering? Surely he isn't ignorant to something his father and the entire libertarian movement understands as a matter of course.\n\nI know what you mean. my\n\nI know what you mean. my interest level suddenly dropped after that I heard the \"L\" word.\n\nAndrew Napolitano for President 2016!\n\n\nEr... Lincoln turned tyrant.\n\nEr... Lincoln turned tyrant. He didn't start that way.\n\nHe looks tired; he has really aged--\n\nit makes me sad.\n\nit's hard to be awake; it's easier to dream--\n\nwell that what happens in life\n\ni find aging is great since it kills dictators.\n\nWhere Christians get it wrong\n\nGood talk... The point on laws following virtue, not virtue following laws is SPOT ON. Christians spend FAR too much time trying to bring virtue through politics. This is misplacing their energy to fight the symptoms instead of the cause of the disease...\n\n\n\n\nAbraham Lincoln\n\nAs stated in a letter from Lincoln to Horace Greeley\n\n\nAbraham Lincoln\n\nHe didn't give a damn about black people. He just wanted to consolidate power to the union.\nNo I do not condone slavery and do not side with the confederate point of view. But people need to get their freaking history straight. And Rand would do better not to mention Lincoln if he wants to stay consistent. He is just trying to do damage control from that Southern Avernge's comments.\n\nlincoln? really?\n\nhasn't rand read thomas dilorenzo or tom wood?\n\nThanks for posting... very insightful\n\nI am starting to toy with the notion that, similar to the situation we are facing today, that the whole Civil War was orchestrated by the international bankers to destroy the old constitution and the American government, to replace it with a corporation owned and operated by TPTB.\n\nThey would use the elimination of slavery as the backdrop in history, but they idea was to bring every American into indentured servitude to the international banking elite. \"Franchisees\" they called everyone.\n\nSlavery was indeed an evil institution and one that was directly contradictory to the ideals of our Founders and/or the principles they laid out for this nation.\n\nHowever, I believe slavery woulda, coulda, and shoulda been eliminated through peaceful, or at least less violent, less all encompassing means. Britain, Brazil, Canada and many other nations ended their institutions of slavery with little to no violence whatsoever, and certainly without a civil war.\n\nI believe leadership on both sides of the American Civil war, was involved in this conspiracy.\n\nI just watched Gettysburg (1993) with Martin Sheen as Lee, and Tom Beringer as Longstreet, again the other night. Hadn't seen it in a while. It seems the South did the one thing that could have lost them that war, with Pickett's Charge and Lee's decision to stay and fight at Gettysburg, when they should have never invaded the North and stayed at home to fight a defensive, guerilla style war, keeping their Army and therefore their nation intact. The only way the South could've lost is if they allowed their main army (Army of Northern Virginia) to be lured into the open where it could be destroyed. That is exactly what happened due to inexcusable strategic mistakes made by Lee and some of his subordinate Generals.\n\nAgain... This is an idea I've just began toying with, that leadership of both the North & South orchestrated that war to hand control of the US back over to international banking elite. I don't know if I even believe it myself, yet.\n\nAre you a POT or a PET - Person Embracing Tyranny?\n\n\"If the North triumphs, it is\n\n\nThis quote is from Gods and Generals (the prequel to Gettysburg and way better)so I don't know if it is really a quote since I have not been able to verify it, but it is true and apt none the less and is in fact the best second best line in the entire movie.\n\nAndrew Napolitano for President 2016!\n\n\nTo understand Lincoln discover the root problem\n\nContrary to the impression one gets from reading popular historical accounts of Lincoln as a statesmen and constitutional philosopher he spent virtually his entire political career prior to 1860 engulfed in the dirty works of party politics. Lincoln was not a guileless naïve and unsophisticated backwoodsman and rail splitter. He was a shrewd cynical manipulative politician who was not above playing dirty trick such as writing anonymous letters to the editor of newspapers denouncing his political opponents.\nFrom the moment Lincoln first entered political life as a candidate for the state legislature during the 1832 presidential election “writes historian Robert Johannes” he had demonstrated an unwavering fidelity to Henry Clay and “The American System”.\nBy 1838 Lincoln had worked his way up to the position of leader of the Illinois Whig party. Lincoln spent nearly three decades preceding his election as president working tirelessly in the trenches of the Whig and (after 1856 the Republican parties) to organize voters in Illinois and other states of the Whigs mercantilist agenda.\nMercantilism which reached its height in the Europe of the seventeen and eighteen centuries was a system which employed economic fallacy to build up a structure of Imperial state power as well as special subsidy and monopolistic privilege to individual or group favored by the state.\nThis is what the Whigs stood for: the acquisition of political power through the dispensation of patronage. They had no grand philosophy or ideology; they wanted political power and private riches and had no qualms about using taxpayer’s money as the mechanism for acquiring these things.\nClay was the champion of that political system (the Whigs) which doles out favors to the strong in order to win and keep their adherence to the government. His system offered shelter to devious schemes and corrupt enterprises. He was the beloved son (figuratively speaking) of Alexander Hamilton with his corrupt funding schemes, his superstitions concerning the advantage of a public debt and a tax to make certain corporation profitable when they cannot stand alone.\nLincoln understood that patronage was the route to political power and potentially to personal wealth. In 1859 Lincoln declared that he was always a Whig in his politics. And indeed he was. Both he and his wife were ardent admirers of Henry Clay the leader of the Whigs. In his 1852 eulogy to Clay, Lincoln declared Henry Clay as the undisputed leader of the Whigs and “The American System” and Lincoln professed Clay as his idol and role model.\nThe American Whig party was founded in 1832 as a reaction to President Andrew Jackson abolition in 1832 of the Second Bank of the United States. The name “Whigs” was chosen to imply that these men were opposed to despotism and centralized government tyranny as were the American Whigs of 1776 and earlier the British Whigs who advocated Classical Liberalism ( today refer as Libertarian).\nBut the vary name Whig was a cleverly contrived deception. The nineteenth century American Whigs were in face the champion of centralized consolidated government and all students of political philosophy understood at the time (Much better than they do today) that centralization of political power was destructive to liberty.\nMercantilism relies crucially on the spreading of economic fallacies. Lincoln also believed in a crude version of the Marxian labor theory of value. Announcing that “free trade perpetuated a system whereby some have labored and others have without labor enjoyed a larger portion of the fruits. To secure to each laborer the whole product of his labor or as nearly as possible is a most worthy object of any good government.”\nLike all Whigs Lincoln was in favor of inflationary finance through the printing of paper money by a central bank or if need be by state government banks and was an ardent opponent of a monetary system based on gold or any other precious metal.\nLincoln was always a Whig and was almost single mindedly devoted to the Whig agenda of protectionism, central banking and corporate welfare for the railroads and shipping industries –euphemistically referred to as “Internal Improvements”, Lincoln was such a blind follower of the Whig party line that many of his economic policy speeches were embarrassingly illogical and sounded dumb and foolish.\nHe was influential in passing legislation with regard to the third major element of Whigs corporate welfare or internal improvements. At the time the use of federal funds for so called internal improvement, such as subsidies to the railroad industry were widely unconstitutional. But thanks to Lincoln’s political skills, Illinois was a leader in using state tax revenue for such purposes. The Illinois experience in government funded: internal Improvement, under Lincoln political leadership provided a case study of why such uses of tax dollars were viewed with great suspicion. The internal improvement system that was an adoption of which Lincoln had played such a prominent part had collapsed with the result that Illinois was left an enormous debt and an empty treasury.\nThe battle with Andrew Jackson over the recharting of the Second bank of the United States is what ignited the creation for the Whig party in the North. The Whig political strategy was as simple as it was corrupt; promise to plunder the taxpayers for the benefit of corporations and banks in return for the everlasting financial support ( and kickback) from those same entities all the while drowning the public in the false rhetoric opposing executive tyranny, championing the small family farm.\nA central bank and high protectionist tariff were the key stones to the Whigs plan for political plunder for that’s how the massive internal improvements schemes were to be funded and monopolies created. Jackson was the mortal political enemy, for he regarded the bank as dangerous to liberty of the American People because it represented a fantastic centralization of economic and political power under private control. Jackson understood the implication of a politicized money supply as well as the Whigs did. The difference between them was that Jackson thought the results would be unequivocally bad for the country; the Whigs understood that a politicized money supply was a key to their personal advancement and wealth accumulation. Jackson condemned the bank as a vast electioneering engine which had the power control the government and change its character. That’s exactly what they wanted and have done……..they won the war.\n\n\nI'm agreeing with Lawmanjed!!! :)\n\nI think there are others who think the same things; I don't know what I believe about this, yet, either--\n\nit's hard to be awake; it's easier to dream--\n\nI'll bet the only thing we disagree on is...\n\n\nNot to change the subject.\n\nAre you a POT or a PET - Person Embracing Tyranny?\n\n\nI'll take you at your word. You did NOT change the subject! LOL!\n\nit's hard to be awake; it's easier to dream--\n\nTeleprompter, nuff said.\n\nTeleprompter, nuff said.\n\nBlind Sniper\n\n'nuff said\n\nHere's another\n\nSenator Rand Paul (R-KY) guest speaking at Godspeak Calvary Chapel Thousand Oaks in Newbury Park, California on June 2, 2013. The entire video is here: https://vimeo.com/67513512\n\n\n\n\nBMWJIM's picture\n\nThis is not just a speech. For the first\n\ntime I think you see the man.\n\n\n\n\nthat was actually inspiring!\n",
  "response": "# **Scene Concept: \"The Crisis Archive\" – A Hidden Historical Research Bunker**\n\n## **Overall Scene Theme and Core Concept**  \nInspired by the themes of political crisis, moral reckoning, and historical revisionism, this scene is a **clandestine underground research bunker** where a team of archivists, historians, and analysts collaborate to uncover suppressed truths about past political upheavals.  \n\nThe bunker is a **multi-room, high-security facility** where fragile documents, encrypted data drives, and delicate artifacts must be carefully preserved, decrypted, and analyzed. The nature of the work demands **multi-agent coordination**—heavy crates need multiple people to move, encrypted files require specialists to decode, and sensitive equipment must be handled with precision.  \n\nThe atmosphere is **tense, dimly lit, and cluttered**, with the hum of old servers, flickering fluorescent lights, and the scent of aged paper and ozone from electronics.  \n\n---\n\n## **Spatial Layout and Area Descriptions**  \n1. **Main Research Chamber** – The central hub with worktables, document scanners, and a large digital whiteboard tracking historical connections.  \n2. **Secure Archives Vault** – A climate-controlled room with locked filing cabinets, fragile manuscripts, and unprocessed evidence crates.  \n3. **Decryption & Tech Station** – A workstation with old and new computers, external hard drives, and a disconnected secure server rack.  \n4. **Break Room / Storage Closet** – A cramped side room with a coffee maker, a mini-fridge, and overflow storage for supplies.  \n5. **Exit Tunnel & Security Checkpoint** – A reinforced door with a keycard reader leading to a narrow escape tunnel.  \n\n---\n\n## **Detailed Area-by-Area Inventory**  \n\n### **1. Main Research Chamber**  \n**a. Anchor Furniture & Installations:**  \n- A **10-foot-long steel research table** with a scratched, ink-stained surface, bolted to the floor.  \n- A **large digital whiteboard** mounted on the wall, displaying a tangled web of red strings and sticky notes linking historical figures and events.  \n- A **heavy-duty document scanner** (model: **Xerox DocuMate 470**, slight paper jam in tray 2).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- A **sealed evidence box** (dimensions: **60x40x30cm**, weight: **25kg**, labeled **\"CONFIDENTIAL – 1865 CORRESPONDENCE\"**).  \n- A **locked briefcase** (combination lock, slightly dented, with a faded **\"Property of Treasury Dept.\"** sticker).  \n- A **microfilm reader** (functional but missing its **focus knob**).  \n\n**c. Functional Ambient Objects:**  \n- A **rolling office chair** (hydraulic lift broken, stuck at lowest height).  \n- A **desk lamp** (flickering LED, adjustable arm bent out of shape).  \n- A **wall-mounted analog clock** (stuck at **4:17**, faint ticking audible).  \n\n**d. Background & Decorative Objects:**  \n- A **frayed U.S. flag** pinned haphazardly to a corkboard.  \n- A **stack of outdated newspapers** (headlines about economic crises, yellowed with age).  \n- A **dusty coffee mug** with the text **\"World’s Okayest Historian\"**.  \n\n---\n\n### **2. Secure Archives Vault**  \n**a. Anchor Furniture & Installations:**  \n- **Three industrial shelving units** (reinforced steel, bolted to walls, shelves slightly warped from humidity).  \n- A **freestanding fireproof safe** (model: **Sentinel S-1234**, biometric lock, currently **ajar**).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Five sealed acid-free document tubes** (each labeled with a different year: **1861, 1863, 1865, 1877, 1913**).  \n- A **leather-bound ledger** (title: **\"Private Correspondence – H. Clay\"**, pages brittle, some torn).  \n- A **broken humidifier** (display reads **\"ERROR: LOW WATER\"**, disconnected hose).  \n\n**c. Functional Ambient Objects:**  \n- A **wheeled library ladder** (wobbly left wheel).  \n- A **small dehumidifier** (running, humming loudly).  \n- A **wall-mounted emergency flashlight** (dead batteries).  \n\n**d. Background & Decorative Objects:**  \n- **Cobwebs in the corners** of the ceiling.  \n- A **framed portrait of Alexander Hamilton** (glass cracked).  \n- A **pile of discarded gloves** (latex and cotton, some torn).  \n\n---\n\n### **3. Decryption & Tech Station**  \n**a. Anchor Furniture & Installations:**  \n- A **heavy server rack** (weight: **300kg**, dimensions: **2m tall, 1m wide**, bolted to floor, blinking status lights).  \n- A **dual-monitor workstation** (left screen flickering, right screen displaying **\"DECRYPTION IN PROGRESS – 47%\"**).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- A **USB drive** (labeled **\"RECOVERY – DO NOT TERMINATE\"**, plugged into a hub).  \n- A **disassembled hard drive** (exposed platters, small screwdriver nearby).  \n- A **printed encryption key** (taped to the desk, partially obscured by coffee stains).  \n\n**c. Functional Ambient Objects:**  \n- A **noisy cooling fan** (rattling, needs cleaning).  \n- A **labeled binder** (title: **\"CIPHER MANUAL – 3rd EDITION\"**, pages dog-eared).  \n- A **stool with uneven legs** (wobbles when sat on).  \n\n**d. Background & Decorative Objects:**  \n- A **sticky note** saying **\"Change password!!!\"** on the monitor.  \n- A **half-eaten granola bar** in its wrapper.  \n- A **stack of expired access badges** in a tray.  \n\n---\n\n## **Scene Affordances and Embedded Potential**  \n\n### **Collaborative Transportation Affordances**  \n- The **300kg server rack** cannot be moved by one person (requires two agents to lift safely).  \n- The **sealed evidence box (25kg)** is too heavy for a single agent to carry far without strain.  \n\n### **Reasoning & Tool-Use Affordances**  \n- **Attribute-Based Reasoning:**  \n  - Among the **five document tubes**, the **1865 tube** is the only one with a **red wax seal** and a **small tear** on the label.  \n  - The **USB stick labeled \"RECOVERY\"** is the only one plugged into the **blue USB hub** (others are black).  \n- **Compound (Tool-Use) Reasoning:**  \n  - The **microfilm reader is missing its focus knob**, but a **nearby drawer has a loose screwdriver** that can be used to adjust it manually.  \n  - The **locked briefcase** requires a **4-digit code**, which is written in pencil on a **sticky note hidden under the coffee mug**.  \n\n---\n\n## **Conclusion**  \nThis scene is **densely layered** with objects that demand **collaboration, problem-solving, and precise interaction**. The high-security research bunker setting inherently requires **multi-agent coordination**, while the **historical artifacts and encrypted data** provide deep **reasoning challenges**. The **background clutter** (coffee stains, outdated newspapers, broken tools) adds realism and forces agents to **filter signal from noise**.  \n\nThis environment is **ripe for tasks** such as:  \n- **Decrypting a classified document** (requiring one agent to find the key while another operates the terminal).  \n- **Moving fragile evidence** (needing two agents to lift and stabilize a heavy crate).  \n- **Repairing the microfilm reader** (retrieving a tool from another room).  \n\nThe design ensures that **no object is generic**, every detail serves a purpose, and **collaboration is mandatory** for success."
}