{
  "id": 1261,
  "raw": "\nRetrieved from http://www.dailypaul.com/255567/jobs-the-international-phenomenon-no-one-wants-to-talk-about\nText:\n0 votes\n\nJOBS: The international phenomenon no one wants to talk about\n\nNew York Times: \"Technology, Both Miracle and Burden\"\n\n\"YALTA, UKRAINE — One of the paradoxes of our age is that we are simultaneously living through a time of positive economic innovation and also a time of the painful erosion of the way of life of many middle-class families...\n\nWhen Mr. Milner [Russian Internet investor] talks about the technology revolution, he paints a dazzling picture of literally unprecedented innovation, bringing tremendous savings and benefits to consumers.\n\nBut when you talk to economists about the impact of those same forces on middle-class jobs, you come joltingly down to earth. The revolution Mr. Milner describes is part of a sea change in how the economies of Western industrialized nations work — and one that is hollowing out the middle class...\"\n\n\nTrending on the Web\n\nComment viewing options\n\n\nGeneral unemployment is caused\n\nby government, not technology. Every technological innovation is a plus to economic well-being and the middle class. The middle class is shrinking because of its being plundered of trillions of dollars for the benefit of large banking interests and the MIC. The view that technological innovation is a destroyer of jobs is just a small variant of the broken window fallacy.\n\nTechnology is a good thing\n\nIf we had real money and true enforcement of fraud and market manipulations every advance to improve productivity would improve the lives of everyone.\n\nTechnology advances reduce cost to produce products people want and need therefore people need less income to maintain a lifstyle. But we have funny money, fraud and market manipulations that counteract these improvements to make people need more income to maintain their lifestyles.\n\nTechnology is cushioning the blow from the thugs ripping us off.\n\n\"Jobs\" aren't the issue,\n\neconomic liberty is the issue. No one dreams of working at a job for someone else their whole life. This is the MSM box: \"we\" \"need\" jobs, jobs, jobs. \"Jobs=prosperity\". No, wealth creation and accumulation equal prosperity. If people had the value of REAL money, owned their homes they bought, had the freedom to open businesses and pursue occupations without being gatekept by licensing, regulations, and credentialling protectionists jobs would not be an issue.\n\nWell put\n\nAs I told my kids:\n\nDo you really want a job so you can buy a CD player for your dining room? (That was the premise of the initial discussion). They said yes.\n\nI said, don't you just want the CD player and not the hassle of working? Yes.\n\nAh, but don't you just want the ability to play CDs and not the actual player? Yes, I think so.\n\nAnd don't you really, when it all boils down, just want to be able to listen to whatever music you want at your convenience? Yes.\n\nBut if you worked, you'd have to buy a CD player, then all the CDs you wanted, total that up with social security and other job expenses and divide by 75% tax rate and then divide that by whatever you can make per hour. That's probably many weeks of work.\n\nAlternatively, you could just open some internet radio, playlist, youtube or similar site and skip the rest. Now, what do you want in life? House, car, food, clothes....\n\n\nThe ever-recurring doctrine of \"technological unemployment\" -- man displaced by the machine -- is hardly worthy of extended analysis. It's absurdity is evident when we look at the advanced economy and compare it with the primitive one. In the former there is an abundance of machines and processes completely unknown to the latter; yet in the former, standards of living are far higher for far greater numbers of people. How many workers have been \"displaced\" because of the invention of the shovel? The technological unemployment motif is encouraged by the use of the term \"labor-saving devices\" for capital goods, which to some minds conjure up visions of laborers being simply discarded. Labor needs to be \"saved\" because it is the pre-eminently scarce good and because man's wants for exchangeable goods are far from satisfied. Furthermore, these wants would not be satisfied at all if the capital-goods structure were not maintained. The more labor is \"saved,\" the better, for then labor is using more and better capital goods to satisfy more of its wants in a shorter amount of time.\n\nMurray N. Rothbard, Man, Economy and State, with Power and Market, Scholars Edition, Chapter 9, p587, originally published in 1962.\n\n\"A curse on machines! Every year, their increasing power relegates millions of workmen to pauperism, by depriving them of work, and therefore of wages and bread. A curse on machines!\"\nBut to curse machines is to curse the spirit of humanity!\nIt puzzles me to conceive how many men can feel any satisfaction in such a doctrine.\nThis is not all. If this doctrine is true, all men think and invent, since all, from first to last, and at every moment of their existence, seek the cooperation of the powers of nature, and try to make the most of a little, by reducing either the work of their hands or their expenses, so as to obtain the greatest possible amount of gratification with the smallest possible amount of labor. It must follow, as a matter of course, that the whole of mankind is rushing towards its decline, by the same mental aspiration toward progress, which torments each of its members.\nHence, it ought to be revealed by statistics, that the inhabitants of Lancashire, abandoning that land of machines, seek for work in Ireland, where they are unknown; and, by history, that barbarism darkens the epochs of civilization, and that civilization shines in times of ignorance and barbarism.\n\nClaude Frederic Bastiat, The Bastiat Collection, p31, published by the Ludwig Von Mises Institute, written 1850.\n\n\nLudwig Von Mises, Human Action, Scholar's Edition, Chapter XXX, p768, Originally published 1949.\n\nDid any of the people supporting the OP's original concern/argument, including the OP, actually listen to Ron Paul?\n\n\nThe distruction of the middle\n\nThe distruction of the middle class is not caused by technology. It is caused by the government taking at least 50% of everything we produce and blowing it down a rat-hole, imo.\n\nJobs & Technology - It's one of the factors. There are\n\ndifferent factors to account for it. But that technology, i.e. machines, replace jobs formerly done by people isn't something that can be denied. Furthermore, the Internet has in many cases done away with the \"middle man,\" that middle-man (store owners) having been part of formerly employed \"middle America.\" In terms of taxes, while I wouldn't argue that there is government waste, as the recent Romney \"gaffe\" pointed out, an awful lot of Americans don't pay taxes - and as Romney didn't point out, much of that is because Americans are unemployed, unable to find jobs; underemployed; or simply low-wage earners.\n\n~ John Muir\n\n\nMachines increase efficiency, which lower costs, lowering prices, making things generally available, multiplying customers millions of times over. The nature of jobs change, but the amount of jobs increase as resources are used better and better.\n\nFord put people in the horse and buggy industry out of work, but created millions and millions of jobs for mechanics, assembly line workers, salespeople, etc.,etc. Gutenberg put hand book-copiers out of work, but created endless millions of writers, editors, publishers and printers, since books were now affordable for common people.\n\nBetter use of resources simply means that quality of life increases overall. People generally can afford things they couldn't afford before....when the price of things like cars, books, or computers lower to a generally-accessible level, endless millions of customers are suddenly created, those industries explode, obsolete (i.e., expensive, inefficient) industries die off, and jobs shift accordingly. It's called progress.\n\nThere's lots of truth in what you say\n\nbut I think in general, you have to compare a product before tech to an identical product after. In this case, the only gain from increased progress is reduced cost. (Resources are seen as a cost in this.)\n\nIdeally, the financial benefits of this lowered cost SHOULD be shared with the employees (including the owner) and the customers at some rate determined by the market.\n\nIn practice of the last century however, the ideas of corporations, the stock market, insurance, globalization, short term winfalls, lobbying for laws and regulations against your competition and workers, and other current 'games' have shifted the deserved wages to higher corporate power.\n\nIn effect, people should now be making many multiples of what they currently earn and prices should be half or less than they are. The extent that they aren't that way now shows you exactly how much of our wages have been robbed by the banks and corporate offices.\n\nTo see how to shift this back, see my comment a few below this one.\n\nPeople are making many\n\nPeople are making many multiples of what they did in past centuries, or even past decades, in terms of value. They have personal transportation machines, personal communication machines, plumbing, electric light, entertainment boxes in every room....this is all based on innovations that maximize efficiency in resource usage. And each of these luxuries has a vast industry attached to it, meaning that the innovations have created jobs by the million that did not previously exist. The more innovations, the more jobs--and the more incredible, life-improving technology you can buy with your wages, making the actual *value* of your wages much more than you might think of it as at first glance.\n\nThe only thing that needs to happen for all the benefits to be felt by everyone is for government to stop distorting the market. That's all. Eliminate government and let the market work, and we'll all live better than any king ever has.\n\nSure, that's all true.\n\nBut that stuff is social ladder stuff. Throughout history, there has been a steady increase in what the norm is to maintain constant standing on the social hierarchy. The items you list are mostly resulting from that shift. I agree that it's often unnecessary fluff, but it's still a reality.\n\nHowever, the point I was making wasn't about what we get, it was about what we are forced to give to remain 'normal'. Without going back down the 'what is normal' path again, people are now forced to work more, not less and they gain less, not more. This is the opposite of receiving the benefits of technological advancement. Ergo, the fruits of the tech movement have been diverted to only those that control the system.\n\nYou're \"Eliminate government\" statement, while completely accurate, is simply naive to the reality of today's propaganda and marketing campaigns. Even in politics, we can't keep waking up larger percentages of the population to undisputed truths because the opposition is more successfully using fear to sway others back to oppression. Until our side holds the power of money over the other side, money can always buy our opposition more than ideals can fight it. Winning will never come from breaking the cycle at the government link first. It has to be done elsewhere.\n\nTo break the chain, we have to take back the money. If we simply stopped all monthly payments that end up in bankers' hands, they would be out of business in a very short time. With their new-found poverty (almost funny to write that!), they won't be able to buy the influence they need to rise back up. It's kind of like cutting the head off the snake as opposed to nibbling away, tail first. This is why RP is more focused on the Fed than the election. He recognizes this reality.\n\nIt's not as hard as one would think though. There are basically two paths to succeeding. One way is a mass awareness type of boycott. The other is out-competing them with genuine free market principled businesses. This still takes quite a few people but it can start small and grow as it shows its benefits over the increasingly bad alternative.\n\nI was just....\n\nI was just disputing the idea that technology has any kind of negative effect on the human condition....it doesn't ultimately decrease jobs or decrease quality of life.... That's all I was saying.\n\nAs far as solutions, I respect your thoughts, I just don't, personally, see any nice neat way out. When enough people are really starting to hurt, they'll start wondering what the hell went wrong....our job, I think, is to beat the drum and raise awareness so that at the crisis point enough people are informed enough to blame the government thugs, rather than free people and the free market.\n\nI understand\n\nI am not saying that technology inherently has any negative effects on the human condition (well put). I'm just saying that it does ultimately reduce the workforce needed.\n\nSure, as you state, it increases the required workload in the short term, but the ultimate result is definitely a reduction. Take any industry in isolation. Say, farming... what now takes 2 people used to take over a hundred. The difference lies in those external jobs you indirectly reference.\n\nAt some point, those jobs will be consolidated or automated out and the number will ultimately cut back. My point in taking this track is not, however, to argue that technology is bad because it harms the middle class, but quite the opposite.\n\nThe benefits from technological advancements actually helps. No one can argue that surgery, medical, air conditioning or the internet are not vast conveniences. It's just the apparent result that they are against (and often their being used for tyranny - different topic!). My stance on this is that the job reduction should be a great thing. Just think if we were able to ensure the profits were fairly shared among the workers as with the owners of all the businesses. Just think if those workers also held some accountable voting control in their companies. If, by some miracle, we returned to those days, the average career length might migrate from 40 years down to 20. Instead, it has gone significantly north.\n\nWith the increased wealth from an average job, people may leave early and allow the next generation to take their slot. This alone would turn the unemployment number negative, bringing out the voice of the worker in the fashion of the striking workers of the last century. When workers gain the upper hand again, there will be no stopping them from walking out on a bad or lousy paying job. That will be the day the small businesses take the power back from the bloated, stock-market financed mega-corporations we now live with.\n\nThen, lastly, when those corporations and the banksters who swindle the profits out of them all go under, the people will regain power in government once again. That will be the day my work will be done.\n\nSorry, false again\n\nNo, you're wrong on farming...remember \"what is seen and what is not seen.\" Those 98 people who are no longer farmers...all those hours and years that are no longer spent farming, are now applied to other, more beneficial endeavors. The expenditure of exactly that amount of time and energy didn't cease, it was just freed up, by technology, to be applied to other, more sophisticated things.\n\nBooks are written, airplanes are designed, software is developed, etc., etc., by people who are freed from trying to feed themselves by directly interacting with the land...Again, it's called progress.\n\nBy your logic we should all live at starvation level in the woods, spending all of every day hunting and gathering...after all, then there would be, as there is among animals, 100 percent employment.\n\nI don't have any thoughts on your proposed solution. Sounds a bit Marxist and as if it would require central planning, and therefore coercion. You might want to spend a year or two studying at mises.org before you try to jump ahead with it.\n\nTry reading a little more in-depth\n\nI fully acknowledged your big argument.\n\n\"Take any industry in isolation. Say, farming... what now takes 2 people used to take over a hundred. The difference lies in those external jobs you indirectly reference.\" (Emphasis added)\n\nThen I said, \"At some point, those jobs will be consolidated or automated out and the number will ultimately cut back.\"\n\nI was trying to be brief and not spell out ever little step, but here goes. When those external jobs, say for farming it might be the tractor tire manufacturer, get automated and they get reduced, the total hundred jobs \"WILL ULTIMATELY CUT BACK.\" What happens when you compare 1 million farms with 100 workers each (100,000,000 total - a century ago) to 100 thousand farms each with 2 employees and some external support groups that support all those farms by a total of 1,000,000 people (200,000 PLUS 1,000,000 = 1.2M today)? That's the reality of the externalties. That external million jobs support not just one former position on the original million farms. They support all the externalties on all the farms. On top of that, the supposed tractor tire guy now supports the heavy equipment industry with his tires too. There went your ratios.\n\nSorry, but I used to automate plants and factories. I can tell you without hesitation that automation increases jobs in the short term, but after not too long, those jobs are not longer needed. I know of one college steam plant that went from 38 operators (not counting admin, etc.) to 3 employees and after the equipment was designed and installed (my job), I had to move on to find other work. I've also written a single software program that consolidated a dozen bean-counters into one over-seer. Where's the externalties there if the computer used was already being accounted for by some other task?\n\nThis has been studied by many and without chasing down quotes, I can say that the average consensus is that today we need about 15% of the workforce (per capita) of 100 years ago. This is the result of automation, simplification and consolidation. The days of needing a 3 person travel agent for each town are long gone. Today, someone writes an app one time and 20% of the world uses it many times.\n\nBut I need to be clear here because this is the main point which you missed. I did not imply that this is all a bad thing. I was not leading you to the \"starvation level in the woods\" result. Quite the opposite.\n\nI was trying to point out that it could go either way and we must ensure it benefits the people, not just the monopolists. My statement, \"Just think if we were able to ensure the profits were fairly shared among the workers as with the owners of all the businesses. Just think if those workers also held some accountable voting control in their companies. If, by some miracle, we returned to those days, the average career length might migrate from 40 years down to 20. Instead, it has gone significantly north.\" was intentionally passive in not saying HOW to accomplish this because I was asking a targeted question.\n\nHowever, by your last paragraph, I see that you won't consider it until you're convinced it isn't Marxist or collectivist. It's actually nothing more than a small group using free market principles to more of an extreme. It's completely open, voluntary and non-cohersive and only grows by its attraction to others seeking higher profit. Basically, if we do things right, even on a small scale, then we will prosper and that prosperity will propagate outward to others, causing it to grow.\n\nThe result is high enough wages that people voluntarily retire early enough to cause the needed workforce to drop to 15% (preliminary end goal) while the number of voluntary workers drops below that. This results in a worker's market, meaning they can set the terms of employment and they can take only jobs they want. The difference then would be covered by companies needing to automate further to get work done that no one wanted to do.\n\nOh, and next time you suggest that someone read Mises, you might want to check how long they've been a member here. (Got ya by 2 weeks! LOL) After reading Mises, et al, extensively for a long time, I wrote a book on how all this interacts in the real world. That endeavor (waiting to time the publishing with some other events) led me to a number of contacts that is actually putting this all into action. As you can see, it really is about 'the message', not 'the man'.\n\nContact me if you want more info on a specific piece of the big puzzle, but please at minimum, have an open mind. Not everything has to be a government, top-down fight.\n\nPoint taken\n\nI guess I just really wanted to harp on the notion that there is absolutely nothing to be feared from technological advancement, and it seemed, and still seems to a degree, that you're putting forward this fallacy.\n\nI still don't, for instance, buy the idea that automation decreases jobs overall. It frees up energy and time for innovation and new, probably often totally unrelated, industries are developed....it frees up energy and time not only among the people who no longer work in that industry, but by lowering the price of whatever is being produced, so consumers, on average, throughout the entire economy, need less resources for necessities & life-enhancing goods and services. A surplus of energy and time is created throughout humanity as a whole, and this creates possibilities and outcomes that nobody can totally grasp or predict.\n\nI realize you're saying that technological advancement can be misused by govt monopolists, but I would just point out that primitive conditions can also be, and certainly have been, exploited by govt monopolists...the problem begins and ends with govt monopolists.\n\nI don't rule out whatever your solution happens to be, I'm just saying that you have a society full of people bred to be ignoramuses, operating under a soft tyranny, and largely happy about it....I'm just saying that needs to be addressed first....solutions will naturally come about, the market will solve everything, when people really begin rejecting government. I stand corrected as far as characterizing your solution as Marxist. As long as there's no coercion involved, it's cool with me....I just think it might be cart before the horse....there are endless examples already, everywhere, of success being achieved when government is nullified, but people are too brainwashed to recognize what's taking place...and when the government recognizes it, the positive activity is outlawed.\n\nThanks for the stimulating discussion.\n\nApologies for my tone\n\nIt's sometimes hard to see who's on the other end of a comment since the same point made could be uneducated and naive while at the same time be very educated and insightful, depending on the level of depth.\n\nYou're probably not going to find a more optimistic person on technology. I've been pushing to use as much of it as possible but to do it 'the right way' for so long I can't remember. My utopian future has robots doing all but 5% of the jobs and everyone takes a 4 year term in those slots. But we have a long long way to go first.\n\nBelieve it or not, when designing a path to get to that future, it's not the technical issues that are holding us back. The problem is that it will destroy our civilization to just unleash such automation without a corresponding shift to giving the workers the fruits of that change. (Picture all the factories fully automated and the workers unemployed.) After designing such a business plan (basically pushing the entrepreneur to borrow from many small local people), we determined that there was no need for the big banks, the stock market or retirement funds in this new community. The rest of the plan just kind of fell into place from there.\n\nThis leads to the last piece that you may be seeing differently than I'm proposing. By taking the banks out of the picture, we're eliminating the excessive interest paid them (about 1/3rd of lifetime expenses) and replacing it with object you buy once, not rent forever. If we play this out, it leads to having all a person would normally buy in 40 years, paid off in about 8. So they can work 9 (extra one for savings, retirement) and then retire. I understand your suggestion that they may go spend that money on more goodies and grow the economy further, but once you're secure and the things you bought were lasting, not disposable, wouldn't many people choose to not work? I think that by placing the workers in the driver's seat on wage rates and work conditions, we can expect much less litigation on worker rights and unemployment. We can also expect reduced wasteful \"fluff\" jobs. (the jobs that are easily eliminated by tech).\n\nThe root key issue in all this is that now the banks steal most of our productive value from us and if we make some simple changes we can realize we don't even need anything from them so we could keep that value ourselves. I see a majority of today's society as uninformed of this fact while still trying to maintain their place on the social ladder (now transformed to be the economic ladder). It's not their fault they keep fighting for more money and compromising more all the time for it. They know not of any real solution.\n\nAgreed, it's been a good discussion.\n\n\nnot certain what to think, much less what to do--\n\nwe just work all the time--\n\nit's hard to be awake; it's easier to dream--\n\nAn easy turn-around\n\nIt's not just jobs or debt. It's a shift in the ownership of the companies. And that has happened because we allowed money to buy social status and controlling power. If we take back that money, we also take back that power and remove the rungs of the social ladder.\n\nI would argue that it is a natural tendency for technology to reduce the number of jobs. The difference, however, is that with an aware population and a fair marketplace for starting businesses and other things like taxes, we should have migrated to many more businesses with the lowest level employees holding much more accountability (and it's resulting pay) than they do now.\n\nThis is what I see being the end game of the tech and internet revolutions. Not a million small businesses making up 15% of GDP with 40,000 mega-corps doing the rest. More like 500 mega-corps with 5% of the GDP with 100 million small ones doing the remaining 95% of GDP. When this happens, and it is trending that way faster (but still very small), we will see inequality reduced massively.\n\nWith that increased equality, we will see less debt which will foster a faster change.\n\nAll this could begin to happen with just the infancy tech we've had so far, but make no mistake, we're still licking the chocolate coating of this tech ice cream cone. There's so much more on its way.\n\nEveryone is so intrigued by 3D printers. Well, very soon, we'll be able to recycle our waste plastic directly into free new plastic objects. We'll be able to upload CAD/CAM parts to a machine which will direct ship us the parts at less than volume costs today. We'll be able to do all our electronics entertainment, utility and communications on one mobile device which has much less power needs and can last many generations of upgrade. We'll be able to cut food, energy, housing and travel costs so much it becomes an insignificant part of the budget.\n\nThese are just the 'basics' of the up and coming tech. If you just look at the robotics and automation fields, nearly every piece needed to do every task we may want is already done. We just have to wait for someone to put them all together in the same box.\n\nThose advancements will truly bring about a technological revolution. The trick for our survival is to ensure that we get our fair share of the profits or we'll forever be paying those who control it. As long as we keep this big picture in mind, it's not hard to do all this but without that foresight, it will not happen.\n\nHow can we \"ensure that we get out fair share\"?\n\nEven if the lowest level person would have more accountability, what makes you think the salary for that position would be increased? Seems to me that greed controls everything these days.\n\nOh, and thank you for your entire comment, tamckissick. It was very helpful to my understanding of \"the big picture\". I just don't get how we can get our fair share in this. Could you dumb your answer down for me?\n\n―Emmet Fox\n\nIt's not a matter of dumbing it down\n\nIt's more a matter of a shift in thinking to open your eyes.\n\nThere are two ways to start a small business but people today only see one. That one is to go get a loan, go into debt of some kind and allow that debt to control prices and wages forever. If that upset you, you're already starting to see the answer.\n\nThe other way is to rally real people behind helping a business get going. I don't care if that's by 10,000 people donating $10 each or if they each purchase a blade of grass (self picked) for $1 each. They can do any combination of crowdfunding or just have a good old fashion barn raising. The point is that by cutting the beginning debt of the company, many community benefits become automatically available.\n\nWith little or no debt, a startup business has less people wielding power over it. Traditionally, this has resulted in the investor placing 4-6 of his people on the company's board of directors. Then they mandate that the business comply with their HR, PR, sales, OSHA, ISO9000, accounting, stock, retirement, insurance and other 'guidelines'. In practice, this takes a typical $200k startup cost up to $3M. It's no wonder they feel they have to go public and cash out of self ownership every time.\n\nWith less overhead and less debt, now the fun stuff can happen. The owner can avoid most marketing and sales costs by shifting even half that budget to wages. Couple that with a good speech and some profit sharing and he's got a stronger word-of-mouth market than he could have bought. ...and the employees wages went up.\n\nWith higher paid workers and lots less overhead, they can now offer many creative job swapping programs. This keeps people happy because swapping shifts or taking your turn at in-house daycare or cooking becomes a near zero cost benefit. Even distributor and customer direct pickup can be better coordinated to eliminate most shipping costs. Productivity soars.\n\nFor the community, the product price can be reduced even while maintaining these higher wages. To illustrate this, consider that a typical business has 11% manufacturing costs which actually covers all materials (6%) and labor. Give 10% to the owner and you're left with 79% to split between higher wages and lower prices.\n\nAnd lastly, don't forget that of that 79% that was spent, likely more than 50% went to Wall St., got stripped down to minimum and then out to 'regular investors'. Without this money leaving the community and without this cost being forced to grow each year (earnings return), the company can stay in business, paying both owner and employees the highest wages and not rely on growing their sales into the global market. That's a lot more money left in the community than if half of it left.\n\nBy the way, this is why the corner dive restaurant has remained in business for 60 years but the new one across the street can't survive more than 5.\n\nThanks. I understand what you mean and I have seen that\n\nput into practice. But, the results were usually the opposite of what you conclude. By cutting the debt upfront, the owners get more profit, not the workers who are usually paid less than if they worked for a large outfit.\n\nWhat you propose should work. But, I've never seen it. Greed still gets the upper hand. (And there are fewer workers in those cases, who do the work of 2 or more in the larger places. So not much job creation there.) Either I'm missing something, or you are right in theory but, not in practice.\n\nBTW, in my neighborhood, the corner dive has gone out of business and the new ones are doing as well as the food they serve and the atmosphere in which they serve it. I couldn't say the same about the hired help, though.\n\nThank you for your thoughtful explanation. I do appreciate that and voted you up to cancel out the negative vote. (Apparently, someone else doesn't see it happening that way, either.)\n\n―Emmet Fox\n\nOh, you're correct under 'today's system'\n\nI'm referring to a new system. The secret part is that it's really no different other than in one small way.\n\nTo get the worker power and wages you rightfully suggest won't happen on their own, you only use your powers for good not evil. What I mean by that is that you don't crowd-fund, donate or otherwise help start a local business unless the new owner is on-board with these principles. Whomever is doing the organization of the fundraising (that's supplanting today's investment phase) needs to put the word out on what conditions this free help comes with. In my experience, entrepreneurs are much more worker friendly before getting corrupted by debt. They will easily agree to extra wages if it means they don't have to operate their business forever on a constant growth path.\n\nI've done a similar business plan for a couple business startups so far. Here's one for a small company that molds plastic parts for making modular, air-tight greenhouses.\n\nCase a) Borrow $9M, frantically build a global factory, buy into a global sales and marketing plan, employ 4 of the investor's buddies as board members at $200k/yr, pay high department costs for 9 months before first sale, and adhere to the endless investor restrictions. Then pay 93% of net profit to 'the system' and profit around $254k/year after a one-time, half-mil upfront bonus. He took case b) instead.\n\nCase b) Borrow $45k from a friend's IRA, buy extra molds, some software, hire 1 helper, spread the word and make 1 sale, produce a video of that first build, hit garden shops to sell 3 more, buy more equipment, sell another 2, hire a marketer that can help manufacture, get contract for 1/month, borrow another $80k from IRA-guy's friends based on contract, keep trudging for 8 month and then self-built a metal building... and so on. After 2 years, he's ramped employees to 17, (many ex-cons - his desire), and now earns about $400k, I think. He's paid off the $125k and the 40% tax penalty times 3.2 in that time and has no debt at all. His employees all have greenhouses and get 'royalties' for sales and contracts. Best of all, his prices are below the competition, not above it. I think it works very well.\n\nI like it!\n\nUnfortunately, most people I know in business (not all but, definitely most) aren't so nice and generous. We have a lot of minds and hearts to change before that could ever happen on a scale that would actually make a difference. (sigh)\n\n―Emmet Fox\n\nJust offer them a choice\n\nTell them you can get them very low, no strings start-up cash if they follow the right principles. Even get them to agree in writing if you don't trust them. Just don't offer this to unsound businesses like mortgage brokers! LOL Otherwise, they can go visit the sharks.\n\nI'd bet they'll come see you within a couple weeks.\n\nThen when your investment crowd gets their double-the-stock-market-return, they will be more open to doing it again. Then you find you have a growing snowball on a mountain.\n\nfireant's picture\n\nWrong. It's DEBT which is hollowing out the middle class.\n\nI get so tired of these dolts who always try to blame industrialization and innovation.\n\nUndo what Wilson did\n\nagreed. but a losing battle\n\nagreed. but a losing battle here on DP.\n\nPeter Schiff has some good quips about this topic... most of DP would stand to learn some of the fundamentals of austrian economics.\n\nRe Jobs & Technology - So, you consider me a \"dolt.\"\n\nI don't, but of course I'm biased. Anyway, I think you're failing to look at the big picture. No one claimed that technology was the only variable in the equation, but it IS one variable - and a significant variable at that. Technology replaces PEOPLE - not only diminishing the number of needed jobs, but the nature and quality of those jobs.\n\nMost affected are those who once \"worked with their hands.\" With so much now mass-produced by machines, besides the point of our having lost genuine \"craftsmen,\" there are simply less jobs available for those people. It's foolish to think that the answer is better education in the \"STEM\" subjects of science, technology, engineering, and math. Some people (millions) aren't academically-oriented. That's not to say they don't have gifts and talents - just not those that today's world has much use for. (That would exist EVEN IF the jobs that remained had stayed in the U.S. Outsourcing only exacerbates the problem.)\n\nBut it's more than just an issue of \"labor jobs.\" For instance, small bookstores (once found on Main Streets across America) were owned and operated by people who were not only entrepreneurial but literate as well, with knowledge and an appreciation for... books! Classic literature, modern literature, non-fiction titles, children's books, books for special interests, etc., etc. Those were replaced by less personal bookstore chains and mass-merchandising chains, and now the altogether anonymous Amazon. These small bookstores across America that fulfilled a need within a community also supported families who lived within those communities - a \"win-win\" situation.\n\nNow, with so much information available \"for free,\" there is less of a demand for books altogether. (Who even looks at a cookbook anymore? People google for recipes.) Now those who still buy books are inclined to order on line. There are LESS jobs (in the publishing industry as a whole, not just bookstore jobs); and the jobs still needed are no longer within a community but low-paying jobs working in gargantuan regional warehouses. Also gone are those local people who were once experts in their fields.\n\nYou could make the same analogy for video stores, record stores, hardware stores, clothing stores, drug stores, any number of jobs erstwhile provided by small businesses. Today, there are even less farm jobs. That, too, is largely due to technology, though not entirely. At my local market, the only available garlic - an easy-to-grow staple - comes from China.\n\nThe benefit: we have cheaper goods (of less quality). But while there are savings on one end, taxes go towards funding government benefits for those who can no longer find work. Well, actually, federal taxes only go towards paying the interest on the national debt. We have borrow MORE MONEY to fund welfare benefits.\n\nThere are some cultures where community leaders make more conscious choices as regards the adoption of technology or other changes affecting a community: they consider the positive and negative consequences - both tangible and intangible. Why, traditional native Americans consider consequences to \"the seventh generation.\" We're not only a materialistic society, but more shortsighted. In my experience in business, people look all the way down the road to the next quarter's profit & loss statement.\n\nBut that's neither here nor there. The bottom line is: technology replaces people. And one way or another, at a minimum, people have to eat, be clothed, and be sheltered. The article was fittingly titled: \"Technology, Both Miracle and Burden\"\n\n~ John Muir\n\n\"The bottom line is:\n\n\"The bottom line is: technology replaces people. \"\n\nThis is unequivocally a good thing. A job is not an end in itself, it is a means to some other ends. (with very rate exceptions, such as people who love their work, not only in that it's tolerable, but that they would do it even if they recieved no pay).\n\nThe purpose of human action is to remove displeasure (or seek pleasure). This is what action is. If there are machines that are providing the same goods to society with lesser inputs of human labor, this is a GOOD thing.\n\nAs a thought experiment, let's say an alien race came in contact with earth and took a liking to us and started teleporting all sorts of goods to us... houses, cars, food, ipods, etc... all free of charge. Would this be a terrible thing becasue it \"took all our jerbs!!!!\"? Or would it be a blessing in that we can now obtain the same level of need-satisfaction as previously with much less effort? If you think it's the former, exclude me from your community and your community-leader's watchful eye, please.\n\nRe job/technology, your analogy is not valid.\n\nFirst of all, I don't agree with your analysis of human action. Removing or seeking pleasure is certainly the motivation of most, as most people are externally motivated (by money, power, competition, avoidance of punishment, etc.) - as opposed to being internally-motivated, i.e., motivated by principle (regardless of reward or punishment). But I'll accept it for the purpose of argument, lest you come back with, \"Ah, but then 'being principled' is what gives principled people pleasure!\" Yes and no. Anyway, to your point...\n\nYour alien example only makes the case that jobs are not inherently good or bad but generally a means to end, which is more or less a truism. No argument there. But your hypothetical scenario conveniently fails to identify who you mean by \"us.\" I'd have no problem with aliens wanting to GIFT us with food, clothing, and shelter free of charge, SO LONG AS either 1) EVERYONE received the food, clothing, and shelter OR, 2) for those who didn't, there remained a MEANS for them to secure their needs through WORK.\n\nIt works nicely when, within a community, each person is able to make a contribution such that enables all to prosper, not necessarily equally, but in terms of at least providing for basic needs. If new technology makes it easier or cheaper for some families to live, at the same time as depriving others of any means to feed themselves, well, then let's just be HONEST about the trade-offs and real cost of our having our conveniences or toys.\n\nIf we made decisions more consciously, thinking about the consequences of our actions, maybe we'd make some different decisions. And if we contemplated the effect of our actions and foresaw negative consequences and we proceeded regardless, well, I guess whether we'd be able to sleep at night would depend on who we were, the respective set of principles by which we live. (I won't bring spirituality into the discussion but leave it at that.)\n\n~ John Muir\n",
  "response": "### **Scene Concept: \"The Automated Factory Retrofit Project\"**  \n\n#### **1. Overall Scene Theme and Core Concept**  \nA once-thriving industrial factory is undergoing a massive retrofit—its outdated machinery is being replaced with cutting-edge automation. The scene is a **hybrid space caught between eras**: rusting conveyor belts sit beside gleaming robotic arms, while human workers and engineers collaborate (or clash) with their robotic counterparts.  \n\nThis environment is inherently **multi-agent** due to:  \n- **Heavy object manipulation** requiring coordinated human-robot teams.  \n- **Complex troubleshooting** where engineers must diagnose mechanical failures using both analog tools and digital interfaces.  \n- **Safety hazards** requiring synchronized actions (e.g., locking power grids before repairs).  \n\nThe **atmosphere** is one of **tension and transition**: oil-stained work orders pinned to bulletin boards, holographic schematics flickering above workbenches, and the constant hum of machines struggling to adapt.  \n\n---  \n\n### **2. Spatial Layout and Area Descriptions**  \n**Primary Areas:**  \n1. **Assembly Line Floor** – The factory’s heart, with a mix of old and new machinery in mid-conversion.  \n2. **Maintenance Bay** – A repair station with tools, diagnostic screens, and partially dismantled robots.  \n3. **Control Room** – Overlooks the factory floor, filled with monitors, alarm panels, and a locked server rack.  \n4. **Storage & Logistics** – Packed with crates of spare parts, some mislabeled or misplaced.  \n5. **Worker Break Area** – A repurposed corner with a coffee machine, lockers, and protest flyers about automation.  \n\n---  \n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. Assembly Line Floor**  \n**a. Anchor Furniture & Installations:**  \n- **Legacy Conveyor Belt (8m long, 1.5m wide, steel frame, partially disassembled)** – One section is jammed with a seized gearbox.  \n- **Robotic Arm (Kuka KR 1000, payload 1000kg, firmware v2.4.7, status: \"Calibration Required\")** – Mounted on a reinforced pedestal.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Hydraulic Press (500-ton capacity, manual override lever stuck in \"Engaged\" position)** – Requires two agents to reset.  \n- **Faulty Sensor Array** – Misreading alignment data, causing robotic collisions.  \n- **Emergency Stop Panel** – One button is missing, wires exposed.  \n\n**c. Functional Ambient Objects:**  \n- **Tool Cart (on wheels, holds wrenches, multimeter, grease gun)** – Partially blocking an emergency exit.  \n- **Parts Bin (labeled \"Actuators - DO NOT USE\")** – Contains mismatched servos.  \n- **Overhead Crane (2-ton limit, remote control missing battery)** – Hanging above a pallet of fragile components.  \n\n**d. Background & Decorative Objects:**  \n- **Graffiti on Support Beam (\"MACHINES WON’T PAY YOUR RENT\")** – Faded but legible.  \n- **Stack of Yellowed Manuals (1987 Hydraulic Systems Guide)** – Dusty, pages stuck together.  \n- **Dented Hard Hat** – Left on a railing, OSHA sticker peeling.  \n\n---  \n\n#### **B. Maintenance Bay**  \n**a. Anchor Furniture & Installations:**  \n- **Workbench (3m x 1m, steel surface, stained with coolant)** – Bolted to the floor.  \n- **Diagnostic Terminal (touchscreen, cracked corner, login screen: \"ENGINEER ACCESS REQUIRED\")**  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Disassembled Servo Motor (serial #SERV-8821, missing rotor)** – Matches a broken arm on the line.  \n- **Circuit Tester (LeakSeeker Pro, battery dead)** – Needed to trace faulty wiring.  \n- **Locked Tool Cabinet (digital keypad, default code reset to \"0000\")** – Contains torque wrench.  \n\n**c. Functional Ambient Objects:**  \n- **Rolling Chair (one wheel wobbly)** – Drifts slightly when unoccupied.  \n- **Parts Washer (full of murky solvent)** – Lid slightly ajar, fumes detectable.  \n- **Whiteboard (scribbled notes: \"Check bearing alignment on Arm #3\")** – Half-erased.  \n\n**d. Background & Decorative Objects:**  \n- **\"Employee of the Month\" Photo (2015, torn at the corner)** – Shows a worker beside an old press.  \n- **Coffee Stain on Blueprint** – Obscures a critical wiring diagram.  \n- **Broken Neon \"EXIT\" Sign** – Flickers intermittently.  \n\n---  \n\n#### **C. Control Room**  \n*(Abridged for brevity, but includes:)*  \n- **Server Rack (locked, keycard slot, \"MAINTENANCE ONLY\")**  \n- **Alarm Panel (three blinking red lights: \"OVERLOAD – LINE 2\")**  \n- **Security Monitor (one camera displays static)**  \n\n---  \n\n### **4. Scene Affordances and Embedded Potential**  \n\n#### **Collaborative Transportation Affordances:**  \n- **Hydraulic Press Reset:** The manual release lever requires **two agents (combined strength > 80kg)** to disengage.  \n- **Pallet Relocation:** A **500kg motor crate** must be moved using the overhead crane, but the remote requires a battery (stored in the locked tool cabinet).  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:** Among **five servo motors** in the parts bin, only **one** matches the broken robot (serial #SERV-8821, blue housing, \"WARNING: HIGH TORQUE\" sticker). The others are decoys (wrong voltage ratings).  \n- **Compound Reasoning:** The **faulty sensor array** can only be recalibrated using the **LeakSeeker Pro tester**, which itself needs a **fresh 9V battery** (found in the break room’s smoke detector).  \n\n#### **Dynamic Problems:**  \n- **Safety Lockouts:** The **control room’s server rack** is locked, but the keycard is inside a **random worker’s locker** (requires finding employee ID in their abandoned lunchbox).  \n- **Environmental Hazards:** A **coolant leak** spreads slowly—if not contained with absorbent pads (stored in Logistics), it triggers a **slippery floor penalty** for movement.  \n\n---  \n\n### **Final Notes:**  \nThis scene is **dense with potential tasks**—collaborative heavy lifting, diagnostic puzzles, security overrides, and time-sensitive hazards. The **contrast between old and new tech** forces agents to **improvise solutions**, while **background clutter** (misplaced tools, protest signs) adds realism and perceptual noise. **Every object has a purpose**, whether functional, atmospheric, or a hidden clue.  \n\nWould you like additional refinements (e.g., sound/lighting details, more task breakdowns)?"
}