{
  "id": 1263,
  "raw": "\nRetrieved from http://www.dailypaul.com/318464/urban-guerilla-gardenering-on-an-entire-city-block-in-south-la?page=1\nText:\n17 votes\n\nUrban Guerilla Gardening on an Entire City Block in South LA\n\nJohn from http://www.growingyourgreens.com/ shares with you an entire city block in South Los Angeles that is now growing food. In this episode John shares with you the results of a guerrilla gardening project that was installed in South LA in August 2013 by over 100 guerrilla gardeners. You will discover how this project looks about 1/2 year later and if residents of the area are continuing to use the raised beds to grow food.\n\n\nDo you think its a good idea to install raised bed gardens for people so they can grow their own food if they choose? Do you feel most people value fresh food from the garden?\n\nTrending on the Web\n\nComment viewing options\n\n\nSome years ago the MO Well Fed Neighbor Alliance\n\nwould come to your house, if you had a yard or some space you weren't using and they would plant it, tend it, raise food and give you a share of it. The rest was distributed around in this cooperative network.\n\nWhat made them kinda special is they had evaluated all of the land in the community and they would evaluate your land to determine what crops would do best there. Therefore they had efficient production of each type of crop and with the share/swapping, everybody involved would get a wide variation of produce.\n\nI was prepared to showcase them in our community and get more folks involved but....\n\n....but somebody told them we are the evil conservatives. This was a leftist thing. So that door closed with a bang. Even hit me on the ass on the way out. See, apparently some conservo-clown had victimized them and called them \"stupid socialist libtards\" which utterly alienated them to libertarians.\n\nAnother example of neoclown hate destroying a perfect relationship.\n\n\nSlaughts31's picture\n\nThank you for sharing\n\nI really enjoyed this episode, and this guy's enthusiasm for growing. We do have favorable growing conditions in SoCal that make it so we can grow year round.\n\nWe are only in our second season of growing, and learning pretty much never stops. We have had some great/abundant/delicious harvests in the side-yard but also a few tragedies. There's always more that can be done!\n\nLet the farmers handle it.\n\nI think many people believe that food production has become something they are unsatisfied with. Some believe too many pesticides are used, others that the food comes from too far away, GMOs, etc. But to receive the type and quality of food that you desire doesn't require you to dedicate yourself to producing your own food.\n\nFarmers can handle all of your demands, but the government has to get out of the way. If you demand it, we can supply it. But unfortunately with government interference, it is difficult to know exactly what people want. Because we determine demand by price, government interference affect price in more ways most can imagine.\n\nTake corn in the USA as an example. 2011 we had 84 million acres, with 50% being dedicated to ethanol use. That is 42 million acres of wasted land. Put that into other more useful crops and the price of food will plummet.\n\nHey Brigger, this is off topic\n\nBut I tried to get ahold of you with a private message a while back. Can you try sending me one? Or should I try another one? I'm down in Chile at the moment and will probably be in your area soon, so I wanted to touch base.\n\nJohn has a great youtube gardening channel\n\nHe shares tons of tips on \"raw eating,\" \"growing and eating greens,\" and John is also an avid \"juicer,\" and he does tons of \"juicer reviews\" and even has a site where he sells or helps sell juicers. He is a fantastic guy. Gotta check out his channel.\n\nLittleWing's picture\n\nI like the idea of community gardens!\n\nHave you seen The Incredible Edible Town?\n\nIncredible Edible Todmorden from haymedia on Vimeo.\n\nWebsite: http://www.incredible-edible-todmorden.co.uk/\n\n\nFish Poop!\n\nGet how to aquaponics info and training from our site. Learn sustainability to support yourself and while feeding hungry kids around the world.This year we got another surprise at the Aquaponics and Earth Sustainable Living Farm. Due to heavy traveling schedules, we put our crops in one month late but according to local gardeners our crops are at least a month and half early.\n\nWhat happened? -- We developed what we call, \"super fish mulch.\" Everything we put into the mulch grew like crazy! We have been eating tomatoes for over two months and most of the plants produced fruit within a couple weeks of planting, another breakthrough using fish waste at the A.E.S.L. micro farm!\n\n\nBMWJIM's picture\n\nJust started doing this behind\n\nthe motorcycle shop. 2 months in and the system is settling down and everything is looking very good. Created a 2x5x1 grow bed and a 50 gal aquarium. Have 7 bream in the aquarium and have been eating lettuce at about 2 head per week. Tomato plants are looking good and cucumbers are just starting to produce. Have the first butternut squash as of this morning. Watermelon not doing so well but the first couple of months was very difficult getting everything at the right levels.\n\nAs an experiment this is quite fun. Still does not satisfy the way my greenhouse and large garden does although I may try it on a slightly larger scale at my home.\n\n\n\ngreat idea...\n\nWill be killed by corporate dollars though.\n\nIf the people don't depend on the corporations for survival then the whole game falls apart... and we can't have independent & self-sufficient people running around like they're not slaves. It sends the wrong message.\n\nAt their inceptions, the #Liberty, #OccupyWallStreet and #TeaParty movements all had the same basic goal... What happened?\n\nWill not be killed by corporate dollars.\n\nWe out number them.\n\n\nSometimes I wonder who you consider to be \"we\" and \"them\"\n\n\nI would be concerned about pollution\n\nfrom the street, the passing vehicles, dogs, trash, and strangers like John touching my kale.\n\nI use this:\n\nEnvironne Fruit & Vegetable Wash\n\nPurified water, natural cleansing agents (derived from plant oils(berries and coconuts)), polysorbate-20 (derived from sorbitol/berries and plums), grapefruit seed extract, lemon and orange extract.\n\nFreedom is not: doing everything you want to.\n~ Joyce Meyer\n\nThis is an awesome idea.\n\nThis is an awesome idea. Gardens are most likely the single most important aspect of being free, even above firearm ownership. If you can make your own food it becomes much harder for the government to control you or make you desperate enough to be on their assistance.\n\n\nThat was interesting\n\nseems like the project should have been a volunteer project people do themselves rather than the government being involved. Those who wanted the boxes would be more likely to have cared for the boxes, those not interested wouldn't have the boxes gathering trash.\n\nHope they can figure out how to make it work because it is a good idea.\n\n\nI think it's a great idea. Thanks for the post.\n\nI think it would be great in any area (urban or suburban), not just a city's downtown area - although there, too!\n\nIt was unclear who owned and was responsible to maintain the area between the sidewalk and road. Anyway, I don't think you should have to have a raised bed on your property if you didn't want it. But if you did, maybe it could work something like Habitat for Humanity.\n\nFrom a group of volunteer gardeners & carpenters (or anyone handy enough), small teams could be matched up with people wanting a raised bed in their yard. Maybe the people would even have the means (and could donate money) but just not know where to begin. Or maybe they would only be able to contribute their time and labor. At the least, they'd end up with one garden bed (maybe 2 x 4 like in the video) planted with seeds or small plants and given instructions for care; at the most, they'd have learned how to make a garden bed and would add beds (or simply plant more on their own) and maybe become part of the volunteer team helping others.\n\n~ John Muir\n\nThere You Have It\n\nResponsibility for the parkways belong to the homeowner (and many nearby are owned by landlords), but the city won't let you do anything to block access from a parked car to the sidewalk, and they won't let you put in trees or remove \"their\" trees, if any. They hassle property owners to the point where many give up the idea of trying to maintain the parkway as part of their landscaping.\n\nPersonal responsibility coupled with zero rights is a recipe for failure. The best-looking parkways usually belong to homeowners who haven't found out, yet, that they are violating the law or who have chosen to ignore it.\n\nIncidentally, many of the streets of Los Angeles are lined with carob trees (\"Jacob's Bread\"), because activists in the war on poverty thought growing them would help supplement residents' diets. They drop pods on the sidewalk that can become a hazard to walkers, bikers, and skateboarders, and have roots that can crack the pavement. But you can't cut them down!\n\nOne of the WORST government-run errors is that they plant tall trees under power lines, which on some streets run above the parkways, and then butcher them when the trees get too tall.\n\nWhat do you think? http://consequeries.com/\n\nreedr3v's picture\n",
  "response": "### **1. Overall Scene Theme and Core Concept**  \n\n**Theme:** *Urban Guerrilla Greenhouse & Aquaponics Hub*  \n\nThis scene is a repurposed industrial warehouse in South Los Angeles, covertly transformed into a high-tech urban farming cooperative. The space blends DIY sustainability with advanced horticulture—raised garden beds, aquaponics systems, solar-powered grow lights, and a bustling community of volunteers working to grow and distribute fresh food.  \n\n**Why Multi-Agent?**  \n- Heavy objects (hydroponic tanks, soil bags) require teamwork to move.  \n- Complex systems (aquaponics, composting) demand coordinated monitoring.  \n- Security measures (hidden entrances, surveillance) encourage role delegation.  \n- Time-sensitive tasks (harvesting perishables, adjusting irrigation) need parallel workflows.  \n\n---\n\n### **2. Spatial Layout and Key Areas**  \n\n**A. Main Greenhouse Hub**  \n- A converted loading dock with glass-paneled ceilings, housing rows of raised beds, seedling trays, and humming hydroponic towers. The air is humid, tinged with earth and ozone from UV lamps.  \n\n**B. Aquaponics & Fish Room**  \n- A dimly lit back room with bubbling tanks of tilapia and catfish. PVC pipes snake overhead, feeding nutrient-rich water to adjacent grow beds. A digital pH monitor blinks warnings.  \n\n**C. Tool & Supply Shed**  \n- A cluttered nook with labeled crates of seeds, jars of homemade fertilizer, and well-worn gardening tools. A chalkboard lists daily tasks.  \n\n**D. Compost & Recycling Station**  \n- A corner with stacked bins of decomposing greens, a manual shredder, and a worm farm. A faint earthy odor lingers.  \n\n**E. Covert Security Outpost**  \n- A small booth with a live CCTV feed, walkie-talkies, and a map of local patrol routes. A red \"LOCKDOWN\" button sits under a glass cover.  \n\n**F. Community Distribution Zone**  \n- A folding table stacked with crates of harvested kale, tomatoes, and herbs. A sign reads: \"TAKE WHAT YOU NEED, LEAVE WHAT YOU CAN.\"  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. Main Greenhouse Hub**  \n**a. Anchor Furniture & Installations:**  \n- **Hydroponic Towers (x4):** 2m tall, PVC frames with staggered plant pods, dripping water into catch basins.  \n- **Solar Grow Lights:** Suspended from chains, some flickering due to faulty wiring.  \n- **Large Planting Tables:** Plywood surfaces stained with soil, holding 12 seedling trays under humidity domes.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Problem\" Grow Light:** One unit’s cord is frayed, requiring electrical tape (located in Tool Shed).  \n- **Overflowing Drip Tray:** A clogged nozzle leaks water onto the floor—needs unclogging with a wire tool.  \n- **Locked Seed Cabinet:** Padlocked; key is hidden inside a hollowed-out gardening manual in the Tool Shed.  \n\n**c. Functional Ambient Objects:**  \n- **Weather Station:** Displays temp (78°F), humidity (65%), CO2 levels.  \n- **Manual Watering Can:** Rusty spout, half-full.  \n- **Radio:** Tuned to a local station, static cutting through occasional music.  \n\n**d. Background & Decorative Objects:**  \n- **Graffiti Tags:** \"GROW FREE\" spray-painted on a support beam.  \n- **Wilted Basil Plant:** Forgotten on a windowsill, leaves browned.  \n- **Dirty Work Gloves:** Discarded near a soil bag, crusted with dried mud.  \n\n---\n\n#### **B. Aquaponics & Fish Room**  \n**a. Anchor Furniture & Installations:**  \n- **Fish Tanks (x3):** 500L capacity, algae-streaked glass, bubbling aerators.  \n- **Grow Beds:** Gravel-filled, sprouting lettuce and chard, fed by fish-water circulation pumps.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Faulty Pump:** One grow bed’s pump is silent—needs a replacement impeller (stored in Tool Shed).  \n- **pH Alert:** Monitor flashes \"ACIDIC\" — requires baking soda (kitchen shelf).  \n\n**c. Functional Ambient Objects:**  \n- **Net & Bucket:** For fish handling, slightly slimy.  \n- **Feed Dispenser:** Automatic timer set to release pellets at 2-hour intervals.  \n\n**d. Background & Decorative Objects:**  \n- **Fish Anatomy Poster:** Faded, pinned crookedly.  \n- **Dented Metal Cup:** Used to scoop feed, left on tank lid.  \n\n---\n\n### **4. Scene Affordances & Embedded Potential**  \n\n**Collaborative Transportation Affordances:**  \n- **Hydroponic Reservoir (200L, 1.5m long):** Requires two agents to lift safely.  \n- **Compost Bin (80kg when full):** Wheelbarrow nearby, but needs one agent to stabilize while another steers.  \n\n**Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:**  \n  - Among five seed packets (all labeled \"TOMATO\"), only one has a handwritten note: \"HEIRLOOM - PLANT IN ZONE 5A.\" A nearby planting chart clarifies zones, but a decorative seed collage adds visual noise.  \n- **Compound Problem-Solving:**  \n  - The locked seed cabinet’s key is inside a hollowed book—but first, agents must deduce which of 20 gardening manuals is slightly thicker.  \n\n**Dynamic States & Urgency:**  \n- A fish tank’s oxygenator is failing—agents have 10 minutes to fix it before fish stress.  \n- The solar battery (display: \"CHARGE: 23%\") will shut off grow lights at dusk unless recharged via hand-crank.  \n\n---\n\n### **Final Atmosphere Notes**  \nThe space hums with purpose: the scent of damp soil, the glug of water pumps, the occasional radio crackle. Every object has history—scuffed tools, yellowing instruction notes, a half-drunk coffee cup atop a soil-stained blueprint. This is a living system, where neglect has consequences and collaboration isn’t optional.  \n\nWould you like to refine any details (e.g., add more sensory elements, adjust object distribution for balance)?"
}