{
  "id": 1316,
  "raw": "\nRetrieved from http://blog.timesunion.com/capitol/archives/1131/paterson-the-public-employee-unions-lied/comment-page-3/\nText:\nPaterson: ‘The public employee unions lied.’\n\n\n\n\n  1. state worker says:\n\n    DOH 4 consultants started last week and that was just one project I know of 2 more coming soon and this is in just one unit. I can’t imagine how many more are on the way, but lets lay off the union workers.\n\n  2. Reality Needs A Chance says:\n\n    STOP, The unions are not even a little bit a part of this financial issue the state is in. Why don’t we ask Mr. Cuomo why he wasted over $6M in rental credits on appearance enhancements to his offices at 120 Broadway in Manhattan. Why don’t we ask Mr. Cuomo why the department of Law has an appropriation of $99Million for a new data center that will be on par with data centers that serve a multitude of other state agencies combined. And an expected actual cost exceeding $200M. Why don’t we ask why the state agencies are forced to purchase furniture through Corcraft as a “preferred vendor” when the know and actual cost fro their product is 200% of exact or better quality products from commercial entities that hire people and pay taxes.\n\n  3. Come on says:\n\n    I love how most of the comments here were posted on days and times State “Workers” were on duty, or supposed to be. You could cut a good 1/3 of state positions and nothing would change.\n\n    Now bracing for typcial state worker responses on how hard they “work”.\n\n  4. John says:\n\n    Paterson seeking over 100 appointments for his friends from the legislature this comming week is just a cunard!! Since technically these people don’t do any work and just collect a paycheck. So they really have nothing to do with the work force and the people he intends to ruin to achieve his savings.\n\n  5. John says:\n\n    hey Rich come and replace me!!!! since it is so easy. We have jobs we can’t fill, no one wants. Private agencies don’t want to deal with Developmentaly disabled pedophiles and forensic individuals. The state trys to push more and more into your neighborhoods each day. Come on Rich I would love to see you on the front line when some one goes off. Staff are very limited in what they can do, one of the reasons there is such a high injury rate. you can’t confine them or put them in seclusion so all a poor worker can do to protesct others is grab them and hold on it’s called scip\n\n  6. A Political Pawn says:\n\n    David Paterson, the most practiced and notorious liar in New York State calls somebody a liar, and the Times Liar’s Union prints it! No news here!\n\n  7. The Fox says:\n\n\n    Since you opened the door on having an “Open Bid” on state jobs with your comment; lets see if you can compete with my credentials:\n    Master Degree (Magna Cum Laude) High Honors\n    Bachelor Degree (Honors)\n    Associates Degree (Honors)\n\n    Several leading certifications in the IT industry and almost 10 years experience in the field, plus one professional publication (I may do a second one next year). Now with that in mind, how many people do you think will be able to compete against that?\n\n    Just curious. I don’t mean to sound arrogant, but your assumption that people in private sector are better than others, just irritates me. If you saw my resume, you would see someone who is passionate about his field, works hard to get where he is at, and continuously educates himself to remain current and marketable. Public sector may not pay as well as private sector salary-wise, but I enjoy a good work-life balance and other benefits. Also, before you think that I have only worked for public sector, think again, I have spent almost seven plus years in private sector before going into public sector. I have seen and experienced both the good and bad in both industries, and all I can say is that as long as I am paid a fair wage with decent benefits, and have a good work-life balance, then I am willing to work for that organization. I want to be treated as an asset, not as a liability.\n\n    I hope you are catching my drift, because you may be in for a rude awakening when you see people with credentials that are even better than mine, working for the state and yet are willing to work for the lower salaries (compared to private sector peers) for one reason or another. As I have previously mentioned, mine is mostly work-life balance; I value my time with friends and family, and personal fulfillment over making a bigger salary. I am thankful to have my job even though I am dissatisfied with my salary, because of the other benefits.\n\n    Anyway, have a great day!\n\n  8. DeerJohn says:\n\n    Andonandonandonandonandon: does anyone thing things will change when Mario II takes over?\n\n  9. ResidentX says:\n\n    “come on”, you do realize that not everyone has the same hours… dont you? I guess not.\n\n  10. Jim says:\n\n    Will someone please explain how a lag pay would have resolved the State’s 9 billion dollar fiscal crisis? The numbers do not add up. A lag pay would only be a drop in the bucket. Would anybody be able to venture a guess at how many years of lag pay it would take to resolve the State’s current 9 billion dollar fiscal crisis? Again it seems to me that the real issues are: Outsourcing private sector jobs overseas for cheaper labor costs, welfare/health care for those who do not work, and too many pork projects.\n\n    A fair and equitable way to obtain savings is to continue the hiring freeze, reassign existing employees to the most critical jobs, cut or eliminate all social programs the same percentage, reduce all employee wages the same percentage, and eliminate tax loopholes that give the wealthy a tax break.\n\n  11. Jim says:\n\n    The percentage of wage reduction should be the same for the public sector and private sector. Now that’s fair and equitable.\n\n  12. Kathy says:\n\n    i am sick of people saying state workers dont work, just because there are a few of them, you should not make a judgement on all of us. I work my butt off everyday, i waited almost 4 years to get a job with the state and when i finally got hired in September I am now targeted for layoff. The ones who need to get out of there are the per diems collecting a full pension and getting a paycheck to work there part time and all they really do is hang out and talk on the phone all day. The others that need to go are the students that are there because mommy or daddy or auntie has pull and they sit there texting and come and go as they please. But because they have senority I will be the one out the door when I am doing 5x the work they do. And to the person who said that their agancy is hiring from the outside, well they probably were not one of the agencies that were cut. DMV was supposed to loose 80 people STATEWIDE so why were there 72 notices given out in Albany? So now I and 71 other of my co workers will collect unemployment? How does this layoff help again?\n\n  13. CarlGottsteinJr. says:\n\n    Union hacks lie often.\n\n    Lies and extortion and cronyisim.\n\n    Stock and trade.\n\n  14. reality bytes says:\n\n    This seems as good a place as any to let all the privately employed people know – Guess what? Unless we took a day’s vacation, personal, or other banked leave, TODAY WAS NOT A HOLIDAY FOR US!!!\n\n    Now, how many of you private sector crybabies HAD today off as a holiday??\n\n  15. u2 says:\n\n    “Resident X”. You asked for a link to the 51.54% fringe benefits for some State Employees…….You have received…….\n\n    Assuming your a State Employee, please add in the “indirect pay” to total 51.54%. I don’t cut the checks, I just help supply the funds.\n\n  16. maverick100 says:\n\n\n    You do realize what that is, correct? It’s the way OSC “bills” state agencies for those costs – in other words it’s the state paying itself, which means a net sum of $0 leaving state hands. Is it an accurate reflection? Hardly. Additionally, you twist the “non Federal” rate by adding in the “indirect cost rate”.\n\n    Health insurance is the largest expense, and the largest canard. Health insurance rates for the state are fixed, they do not vary with employee salaries. The way insurance is set up, single employees pay 10% of the cost of the plan, and employees on family plans pay 25% of the cost of the plan.\n\n    The current single rate is $29/pay period. $29 * 26 pay periods = $754, which represents 10% of the total cost. $754 * 10 = $7540, which is the total cost of the plan. $7540 – $754 = $6786, which is the states share of the premiums. For an employee with a single plan to have health insurance be the equivalent of 23% of their salary or more, they’d need to be making less than $30k.\n\n    For family plans, the current employee contribution per pay period is $110. Following the same math: $110 * 26 = $2860. $2860 * 4 = $11440. $11440 – $2860 = $8580, the total cost of a family plan to the state. In other words, the employee would have to be making $37k or less for their family plan to be worth 23% of their salary or more.\n\n    Additionally, neither pension rate matches either the official 2010 or 2011 rates published by OSC, so again, how is this accurate?\n\n    Social Security, Workers Comp, Unemployment… All things every employer pays. Additionally, the accuracy of these figures are questionable as well. Employers and employees pay the same rate for their respective social security taxes. Looking at my own check, social security represents about 6.2% of my gross, not 7.6% as listed in the chart. Given that so far, every rate has been inaccurate, it’s not a stretch to imagine that Workers Comp and Unemployment are overstated too.\n\n    EBF = CSEA, which they get in lieu of Dental and Vision Benefits, as CSEA administers those benefits out of the EBF.\n\n    Dental/Vision = PEF & M/C. They don’t utilize EBF. So again here, we have another inaccuracy.\n\n    In other words, with all the holes in this, it looks like swiss cheese, and just another way government does “creative” accounting to cook it’s books, since these figures represent money changing hands back to OSC from agency budgets. OSC then goes on and pays the bills, which are generally at lower rates then they seem to be charging the agencies as show above.\n\n    I could have stopped at health insurance, because that alone blows your idea out of the water. A single guy making $67k basically changes that 23% into 10%. Then take into account the creative math on the other items to add up to another 5%, and you could easily go from 48% down to 33%. As shown, your “gotcha” link is, as I said above, nothing more than smoke and mirrors.\n\n  17. maverick100 says:\n\n    @ u2:\n\n    One more thing. The additional charge you call “indirect pay” is not listed as “indirect pay”. It’s listed as “indirect cost”, which if I had to take an educated guess, it’s most likely an amount OSC charges to agencies for the “privilege” of having OSC pay the bills for them, like an administrative fee. Think otherwise? You’d better be able to tell us what “benefit” we receive that it’s paying for. But it’s far more likely it’s just another “creative” accounting maneuver. Let’s not forget money changes hands between agencies all the time to pay their “bills” for each others services. OFT is another fine example of such a thing. The rates agencies have to pay OFT to provide services to them are generally highway robbery, and are certainly far above cost.\n\n  18. maverick100 says:\n\n    @ Chester:\n\n    In re: #54 – given the official inflation rates from the Feds over the last 15 years, we’d actually be making 11% more right now if our raises were tied to inflation if you compare our annual raises to those inflation rates.\n\n    It would have meant we wouldn’t have seen a raise in the last year or two which would have keep the sheeple complaining about our raise last year quiet – even though ironically they’d be paying us more today than they already do. The sad part is most of them probably think tying raises to the rate of inflation would have saved them money – some of them have even blindly suggested it previously, so obviously they don’t know the facts. This would be just another example of those sheeple being willing to shoot themselves in the foot because they don’t educate themselves on the issues, and instead just complain based on partisanship and/or stereotype.\n\n  19. stateworker_slug says:\n\n    Workforce savings? C’mon, Governor: Take a look around at all the Pataki-era appointees who burrowed into the ranks of hard-working rank and file civil service positions, and get rid of them. Need a hint? Start with the PSC.\n\n  20. Chester Snodgrass says:\n\n    Jim wrote: “The percentage of wage reduction should be the same for the public sector and private sector. Now that’s fair and equitable.”\n\n    Can we use my wife’s, daughter-in-law’s, or older son’s places of employment as the measure? They all received signigicant raises each of the past two years. None of them work for any form of government.\n\n    If so, then I’d be getting a nice raise too.\n\n  21. Jim says:\n\n    @u2. It looks like these numbers include federal funds to me.\n\n    It also seems to me that the private sector has been eroding employee fringe benefits for years now to try and offset cheap overseas labor costs and equalize costs. Now that US firms cannot cut anymore they outsourced American jobs to third world nations, which by the way we are on track to become in a few more years if things do not improve.\n\n    If anyone looks at the history of the labor movement they would soon discover why it happened in the first p[lace…to stop child labor, to provide living wages and benefits, to combat the actions of the captains of industry, to stop political corruption, and to help make America what it would become during the post World War II era. This race to the bottom is going to change our American values, attitudes, beliefs and expectations…and not for the better.\n\n  22. Jim says:\n\n    @yohyny. Maybe those that want a lag, furlough, percentage worked per week reduction, or take a leave without pay for a few weeks or months to achieve their cost saving goals and objectives.\n\n    I am not sure how taking less pay will resolve a structural issue related to entitlement program costs that are skyrocketing. Please tell me what is the purpose of a contract anyway, if its terms and conditions are not maintained. As a union member were you responsible for the Wall Street problems, corporate welfare, creation of pork programs and other bad business decisions? I see that Wall Street lavishness has been restored.\n\n  23. Jim says:\n\n    @yohyny. Maybe those that want a lag or furlough could accomplish their goals and objectives if they worked a reduced percentage per week or took a leave without pay for a few weeks or months to achieve the cost savings they so badly desire. Maybe these people are wealthy and do not live from paycheck to paycheck like many poor rank and file workers.\n\n    The problem is these people would soon realize that the cost savings was spent on entitlement programs 5 times over and that the State would still need to still eliminate their jobs. Rather than divide as union members, we need to unite. This is a psychological shell game being played out. Just look at history and what happens when a group divides…they lose.\n\n  24. rlandschoot says:\n\n    all boils down to whose ox is getting gored, and which side of fence bull is.\n    They will NEVER cut welfare benefits since many legislators tenure in office is directly dependent on how much they give welfare\n\n    Example? Medicaid patients getting multiple drugs from doctors, some of which duplicate ones they’re allready taken. So much for health management from Medicaid examiners. Much more to this but remember, votes!X\n\n  25. Jim says:\n\n    @rlandschoot. Correct, special interests often influence the political process. It seems that unionized workers were selected targets because they divert attention from the real issues, cause an emotional reaction, and the members do not contribute buckets of money to political campaigns to the same degree as corporations.\n\n    It is time for a change in the way campaigns are financed.\n\n  26. Not a State Worker says:\n\n    Hi – I didn’t call anyone names. I’m not angry. Sorry if I came off that way. I am trying to engage in a conversation.\n\n    Can we start with the premise that taxpayer dollars should be spent in the most efficient way possible? That way we divorce the conversation from comparisons with the private sector. 30 years ago we needed a large state workforce but now there is a large system of not-for-profits that can do a lot of the work at around 1/2 the cost. Why wouldn’t the state continue to shift to that sector to reduce costs?\n    I don’t berudge state workers their salaries and benefits – except where they don’t really do much work. We all know that it happens. It also happens at the management level. It is true that we can’t paint all public sector workers OR managers with a broad brush. But why would you get upset over layoffs of people who have no work to do (Tryon)?.\n    Should large state hospitals that serve 100 or less patients be consolidated with others? In 1955 we had 93,000 patients in 25 state hospitals – now we have 4,000 in 17. Should these decision be made with the convenience of the worker in mind or what is best for the system? Seems to me that more consolidation could have taken place over the years in that area.\n    Pension padding is a problem. The pension system is just unsustainable. How do we deal with it? And getting rid of managers is not going to do it. Do you all think we should just raise taxes to cover it? Or should the constitution be revisited so that pension obligations can be adjusted? Other?\n\n    ResidentX- NY does not pay $60 billion in Medicaid. It pays around $25. You added in the feds 50% share and then added some. If it pays $25 there cannot be 10s of billions in fraud. NY just has the most generous program in the country, thanks to lawmakers. It has opted in to every optional service and has the most expansive eligibility criteria. It’s a problem that needs to be addressed. Also, just curious – how did you decide that a private sector person making $50,00 is the equivalent of a state worker making $35,000. Where did you get that from?\n    Maverick100: You pay 6.2% in SS and 1.45% for Medicare. That is the 7.6% that you see deducted for FICA. 7.6% is correct.\n\n  27. Ellen says:\n\n    No Paterson, YOU lied~\n\n  28. Helper says:\n\n    What a wonderful site this is, where state workers can speak their mind without risk of repercussions. It sure is a better site than the one posted by Paterson himself where supposedly state workers could post their comments and complaints regarding waste, fraud and corruption while at the same time requiring the person to identify themselves before posting their complaints. I would say that the website was created to fool people into thinking that he was doing something about the state’s problems when in reality he was intentionally discouraging them from speaking their minds when something wrong was going on.\n\n  29. Chester Snodgrass says:\n\n    ResidentX wrote: “If it pays $25 there cannot be 10s of billions in fraud.”\n\n    Does that mean there isn’t any fraud in the portion the Federal Government pays? Or does it mean we shouldn’t care about the waste in the Federal portion?\n    I know that I pay plenty of Federal tax, and I want the fraud and abuse stopped there too.\n\n  30. maverick100 says:\n\n    Not a state worker:\n\n    That’s the total FICA out of my check.\n\n    As far as your comments on pensions, padding is more of a PFRS issue than an ERS issue. Things were changed quite some time back for ERS members to cap any “padding”, that allows no more than 10% over the previous few years. PFRS however was not capped, meaning most of it takes place in local police and fire outfits. This explains why even though the PFRS is a much smaller system – it’s less than 10% of the size of the ERS, yet they have more employees at the $80k and above pension range than the ERS, and pretty much stay even in numbers all the way down to $60k +. Padding for ERS members is pretty much a thing of the past.\n\nRSS feed for comments on this post.\n",
  "response": "### **1. Overall Scene Theme and Core Concept**  \n\n**Scene Type:** *State Government Office Building – A Mid-Renovation Administrative Hub*  \n\n**Core Concept:** This scene depicts a labyrinthine state office building undergoing partial renovation, where bureaucratic inefficiency, shifting priorities, and the clash between union workers and outsourced consultants create a chaotic, collaboration-heavy environment. The space is a microcosm of systemic dysfunction—overcrowded workspaces, abandoned project materials, and a mix of outdated and newly installed infrastructure.  \n\n**Why Multi-Agent?**  \n- **Heavy/Large Objects:** Furniture deliveries, dismantled cubicles, and equipment crates require multiple agents to move.  \n- **Information Fragmentation:** Critical documents are scattered across departments, forcing coordinated retrieval.  \n- **Conflicting Workflows:** Union staff and consultants operate in parallel, creating dependencies (e.g., one group has access to systems the other lacks).  \n\n---  \n\n### **2. Spatial Layout and Area Descriptions**  \n\n**1. Central Bullpen (Open-Plan Workspace)**  \n- A sea of mismatched cubicles in varying states of disassembly. Some are empty, others piled with outdated reports.  \n- Overhead fluorescent lights flicker; one has a dangling panel.  \n- **Atmosphere:** Grumbling workers, ringing desk phones, and the hum of a struggling HVAC system.  \n\n**2. Renovation Zone (Partitioned Construction Area)**  \n- Half-installed drywall, exposed wiring, and stacked flooring materials.  \n- A **locked storage cage** holds new monitors still in anti-static wrap.  \n- **Atmosphere:** Sawdust, the sharp scent of fresh paint, and distant power tool noises.  \n\n**3. Archives Room (Overstuffed Document Storage)**  \n- Floor-to-ceiling shelves with labeled but disorganized boxes.  \n- A **broken wheeled ladder** leans against a shelf; the top rung is cracked.  \n- **Atmosphere:** Musty paper, the faint ozone smell of an overheating server in the corner.  \n\n**4. Break Room (Neglected Common Area)**  \n- A **jammed vending machine** (LED display reads \"ERR 43\").  \n- Fridge with a handwritten \"CLEAN ME\" note; inside, a moldy takeout container.  \n- **Atmosphere:** Stale coffee, a microwave beeping incessantly.  \n\n**5. IT Closet (Overloaded Server Room)**  \n- **Blinking server racks** with Post-it notes like \"DO NOT REBOOT – PATCH IN PROGRESS.\"  \n- Tangled cables; one **unplugged fiber line** dangles near a spilled soda can.  \n- **Atmosphere:** Hot electronics, the whir of cooling fans struggling.  \n\n---  \n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **Central Bullpen**  \n**a. Anchor Furniture & Installations:**  \n- **\"Legacy\" Cubicles (x12):** Particleboard, 1.8m tall, some missing panels.  \n- **Conference Table (Abandoned):** Scratched veneer, one collapsed leg propped by a phone book.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Outsourced Consultant Workstation:** Brand-new ergonomic chair (adjustable arms, lumbar support) **locked** to the desk.  \n- **Union Payroll Printer:** Jammed with a crumpled W-2 form (red \"ERROR – CONTACT ADMIN\" light).  \n\n**c. Functional Ambient Objects:**  \n- **Desktop Magnifier Lamp:** On, but flickering due to a loose bulb.  \n- **Label Maker:** Out of tape, with a half-printed label reading \"BUDGET CUTS—\".  \n\n**d. Background & Decorative Objects:**  \n- **Defaced Motivational Poster:** \"TEAMWORK!\" graffitied with \"LIED TO US AGAIN.\"  \n- **Dusty Trophy:** \"MOST EFFICIENT DEPARTMENT 1997.\"  \n\n#### **Renovation Zone**  \n**a. Anchor Furniture & Installations:**  \n- **Plywood Barricade:** Nailed shut, but one panel is loose (revealing a **missing fire extinguisher** bracket).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Unopened Equipment Crate:** 120kg, labeled \"CORCRAFT FURNITURE – PREFERRED VENDOR.\"  \n- **Contractor Blueprints:** Rolled, with a coffee stain obscuring the electrical grid.  \n\n**c. Functional Ambient Objects:**  \n- **Extension Cord Snaked Across Floor:** Plugged into a **tripped circuit breaker**.  \n\n**d. Background & Decorative Objects:**  \n- **Discarded Hard Hat:** Sticker reads \"SAFETY FIRST (unless budget says otherwise).\"  \n\n#### **Archives Room**  \n**a. Anchor Furniture & Installations:**  \n- **Collapsing Shelf Unit:** Leaning dangerously; one support bolt is missing.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Audit Box #114:** Contains the only **signed contract copy** (buried under 2003 tax forms).  \n- **Microfilm Reader:** Powered on, but the lens is cracked.  \n\n**c. Functional Ambient Objects:**  \n- **Stapler:** Jammed with a **bent staple** embedded in the mechanism.  \n\n**d. Background & Decorative Objects:**  \n- **Dead Plant:** Parched in a \"WORLD’S BEST BOSS\" mug.  \n\n---  \n\n### **4. Scene Affordances and Embedded Potential**  \n\n#### **Collaborative Transportation Affordances:**  \n- **CORCRAFT Furniture Crate (120kg, 2m long):** Requires two agents to lift safely (one to stabilize, one to guide).  \n- **Server Rack Battery Backup (90kg, awkward grip points):** Must be moved to access the unplugged fiber line.  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:**  \n  - **\"Find the Corrosive Chemical\"** – Among five bottles on a shelf, the correct one has:  \n    - **Blue cap** (others are red/green).  \n    - **Handwritten \"CORROSIVE\"** (printed labels say \"NON-HAZARDOUS\").  \n    - **Half-full** (others are sealed/new).  \n  - *Distractor:* A decorative **blue glass paperweight** nearby.  \n- **Compound Problem-Solving:**  \n  - **Problem:** Jammed payroll printer.  \n  - **Solution:**  \n    1. Retrieve the **maintenance key** (stored in IT closet, behind a locked drawer).  \n    2. Use the key to open the printer’s **service panel** (hidden latch).  \n    3. Clear the **crumpled W-2** (requires fine motor precision).  \n\n---  \n\n**Final Atmosphere Notes:**  \n- **Auditory:** Muffled arguments from adjacent offices, a **leaking ceiling pipe’s drip** synced to the flickering light.  \n- **Olfactory:** Stale bureaucracy (toner, burnt coffee, industrial cleaner).  \n- **Visual:** **Post-it notes** everywhere—some urgent, some years out of date.  \n\nThis environment is **ripe for emergent tasks**: reorganizing during a power outage, mediating disputes over workspace, or uncovering buried evidence of mismanagement. Every object’s state tells a story of neglect, haste, or resistance."
}