{
  "id": 1318,
  "raw": "\nRetrieved from http://chowhound.chow.com/topics/403803\nText:\nHOME > Chowhound > Ontario (inc. Toronto) >\n\n\nChowhound Review: Perigee dessert tasting\n\n  • 4\n\nMy favourite part of dinner is dessert so I was anxious to try the dessert tasting at Perigee in the Distillery District in Toronto, and so convinced my husband to take me there in lieu of a birthday dinner.\n\nFor $40 each we received a cheese plate + various breads, 3 main desserts, 3 amuse-bouches, and a few nibbles with the bill which we were too full to try. The cheese plate is optional so if you don't want it I assume another dessert will be served instead of it. The food was great, we both really enjoyed it. There were plenty of interesting flavour and texture combinations. The cheese plate and one of the desserts was shared between the two of us, and for the other 2 desserts and amuse-bouches we each received different dishes. Can't remember all the details of the food but it included lots of fruit flavours like mango, rhubarb, grapefruit, and pear ...different types of desserts like sorbets, panna cotta, pastries ... there was also a caramel souffle ... and the last course was chocolate-themed. Very filling so I would recommend a light, early dinner before such a tasting.\n\nPerigee has a large open kitchen and we were seated by it. The head chef described the 3 main dishes for us so I felt like I was on \"Iron Chef\". Never been to the restaurant for dinner, but the couple beside us were having it (they only have tasting menus there) and it looked good too, with generous portions.\n\n  1. Click to Upload a photo (10 MB limit)\n  1. Interesting idea... is it only available recently (i.e. summer?). I haven't been back since I've had my child about 18 months ago, but recalled that the desserts were quite good.\n\n    Did you have to book a table in advance, and do you have to go in after a certain time? Was there also any options for dessert wine/beverage pairings?\n\n    1 Reply\n    1. re: Royaljelly\n\n      I'm not sure how long it's been available, but I believe it's an ongoing thing now. They take bookings at 9:30 pm or later ... I don't know if a reservation is essential but it's probably a good idea. They didn't recommend any special drink pairings but they do have a small selection of dessert wines to pick from.\n\n    2. My wife and I had the dessert tasting over the winter. I think they've been offering it for quite some time. If I recall correctly, we received the breads with spreads, jam and honey, not cheese, and we each received 2 amuses and 3 main deserts (and just like dinner they made different dishes for each of us so we had 10 different items in total). We ordered it with the wine pairings, which if I recall correctly were an additional $25. The food and service were outstanding and we would definitely return. The sommelier picked some nice dessert wines to complement the food. I don't recall any of them being exceptional (but at an average of about $8/glass, I wouldn't have expected them to be). I think reservations are advisable since you'll be going for the late seating.\n\n      1 Reply\n      1. re: Ottawagy\n\n        we've been there twice, once as a couple on valentine's, and once as a party of 8. i don't recommend going in a large group - our waiter really had a difficult time keeping up, basically got irritated and snotty, and the space just isn't the same somehow. i definitely recommend seats overlooking the kitchen, much more fun.\n",
  "response": "### **Scene Concept: \"Perigee Underground Test Kitchen\"**  \n\n#### **Overall Scene Theme and Core Concept**  \nA high-end, experimental dessert kitchen hidden beneath the Perigee restaurant—designed for R&D, private tastings, and culinary training. The space is a **hyper-detailed, multi-functional lab-kitchen hybrid**, where chefs, sommeliers, and assistants collaborate under tight deadlines to refine avant-garde desserts. The scene is **inherently collaborative** due to:  \n- **Precision timing** (desserts with exact temperature/plating requirements).  \n- **Specialized roles** (pastry chefs, mixologists, plating artists).  \n- **Heavy/awkward objects** requiring teamwork (industrial mixers, liquid nitrogen tanks).  \n- **Complex tool dependencies** (missing ingredients, locked specialty pantries).  \n\n---\n\n### **Spatial Layout and Area Descriptions**  \n1. **Central Workbench & Molecular Station**  \n   - A large stainless-steel island with embedded induction burners, precision scales, and a nitrogen vaporizer for flash-freezing.  \n   - **Atmosphere:** Cold mist lingers near the nitrogen tank; the air smells of burnt caramel and citrus zest.  \n\n2. **Temperature-Controlled Ingredient Vault**  \n   - A glass-walled refrigerated room with labeled drawers (-20°C freezer, 4°C chilled section, 12°C wine storage).  \n   - **Atmosphere:** Frosted glass fogs intermittently; a faint humming from compressors.  \n\n3. **Plating & Presentation Studio**  \n   - A dimly lit area with adjustable LED lamps, black slate tiles for plating, and a DSLR camera for food photography.  \n   - **Atmosphere:** The clink of tweezers placing edible gold leaf; a sticky residue from prior syrup spills.  \n\n4. **Sommelier’s Nook**  \n   - A curved bar with a sink, wine fridge, and racks of dessert wines/liqueurs. A chalkboard lists pairings.  \n   - **Atmosphere:** Oak barrels leak a vanilla scent; a broken cork on the floor.  \n\n5. **Dishwashing & Storage Annex**  \n   - Industrial dishwashers, stacked crates of fragile glassware, and a hand-wash station for specialty tools.  \n   - **Atmosphere:** Steam rises from a half-open washer; a cracked ramekin in the \"discard\" bin.  \n\n6. **Chef’s Office & Recipe Archives**  \n   - A cramped space with a laptop, binders of failed experiments, and a wall of Polaroids documenting past creations.  \n   - **Atmosphere:** Sticky notes with frantic scribbles (\"REMEMBER: grapefruit gel sets at 65°C!\").  \n\n---\n\n### **Detailed Area-by-Area Inventory**  \n\n#### **1. Central Workbench & Molecular Station**  \n**a. Anchor Furniture & Installations:**  \n- **300kg nitrogen tank** (wheeled base, pressure gauge at 1200psi, attached hose with frost buildup).  \n- **2.5m stainless-steel workbench** (scratched surface, magnetic knife strip above, embedded digital timer).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Dehydrator** (on, 50°C, containing pear crisps; display flashing \"LOW WATER\").  \n- **Sous-vide circulator** (error code \"E3,\" bath at 72°C with vacuum-sealed mango purée bags).  \n- **Locked flavor cabinet** (requires keycard; inside: vial of saffron extract, rare Tahitian vanilla pods).  \n\n**c. Functional Ambient Objects:**  \n- **Digital scale** (sticky residue, needs calibration).  \n- **Stack of silicone molds** (heart-shaped, half with residual chocolate).  \n- **Magnetic timer** (counting down: 4:22, beeps every 30 sec).  \n\n**d. Background & Decorative Objects:**  \n- **Splattered recipe notebook** (open to \"Caramel Soufflé v7,\" crossed-out notes).  \n- **Dessert photos** (taped to fridge, one curled at the corner).  \n- **Broken pipette tip** (discarded near sink).  \n\n---\n\n#### **2. Temperature-Controlled Ingredient Vault**  \n**a. Anchor Furniture & Installations:**  \n- **Glass-door freezer** (-20°C, internal shelves labeled \"Sorbet Bases,\" \"Fruit Coulis\").  \n- **Wine rack** (angled slots, 12 bottles of dessert wine, one missing—label reads \"Reserved for Pairing #3\").  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Rhubarb gel canister** (labeled \"pH 3.2 - USE GLOVES,\" lid slightly ajar).  \n- **Gold-leaf dispenser** (empty; refill box on top shelf, out of reach without ladder).  \n\n**c. Functional Ambient Objects:**  \n- **Spare apron** (draped over a hook, flour stains).  \n- **Thermometer** (left in water bath, reads 11.3°C).  \n\n**d. Background & Decorative Objects:**  \n- **Faded safety poster** (\"CRYOGENIC HANDLING PROCEDURES\").  \n- **Dented metal bowl** (stacked crookedly, remnants of chocolate).  \n\n---\n\n### **Scene Affordances and Embedded Potential**  \n\n#### **Collaborative Transportation Affordances**  \n- **Nitrogen tank (150kg, wheeled but requires two people to maneuver around obstacles).**  \n- **Industrial mixer bowl (8L capacity, filled with 12kg of chocolate mousse—requires stabilizing while pouring).**  \n\n#### **Reasoning and Tool-Use Affordances**  \n- **Attribute-based Reasoning:** Among five unlabeled squeeze bottles (all opaque, same shape), only one contains **caramelized honey** (distinctive by its **warm viscosity** and **smell of burnt sugar**). The rest hold savory glazes, requiring sniff/flow tests.  \n- **Compound Reasoning:** The **locked flavor cabinet** (problem) needs a keycard last seen in the **sommelier’s nook**, tucked under a wine ledger. Agents must deduce its location via process of elimination (e.g., checking the chef’s frantic notes first).  \n\n---\n\n### **Final Atmosphere Notes**  \n- **Sound:** Dripping faucet in the dish area, occasional hiss from nitrogen release.  \n- **Light:** Flickering LED in the plating studio casts inconsistent shadows.  \n- **Smell:** Overlapping scents of citrus, yeast, and a faint electrical burn from an overworked blender.  \n\nThis scene is **ripe for tasks** like:  \n- **Coordinated plating** under time pressure.  \n- **Troubleshooting broken equipment** (e.g., fixing the sous-vide error).  \n- **Retrieving time-sensitive ingredients** before they spoil.  \n- **Resolving conflicts** (e.g., two chefs needing the nitrogen tank simultaneously).  \n\nThe density of **red herrings** (e.g., similar-looking bottles) and **physical constraints** ensures robust multi-agent collaboration."
}