{
  "id": 1334,
  "raw": "\nRetrieved from http://finance.yahoo.com/mbview/threadview/?bn=e0cd3f16-f9e8-33ca-91c2-a4c24f47b3d9&tid=1336255618000-68886d82-9ae0-35e5-800c-c524da6ac22b&tls=la%2Cd%2C119\nText:\nFri, Dec 26, 2014, 5:45 PM EST - U.S. Markets closed\n\n\n% | $\nQuotes you view appear here for quick access.\n\nEnterprise Products Partners L.P. Message Board\n\n  • arbtrdr arbtrdr May 5, 2012 6:06 PM Flag\n\n    Distribution growth and costs\n\n    The following is a compilation of data from RBC, WF, and CITI issued in the last week. The number of units outstanding has held fairly constant growing by under 30M since 1/1/11. The units listed are avg. weighted with ditution included. Distributions are YE run rate (including estimates).\n\n    2011 860M $2.41 $1.983B .0075/qtr\n    2012 887M 2.53 2.161B .0075/qtr\n    2013 921M 2.70 2.413B .01 change to .0125\n    2014 928M 2.92 2.640B .0125 change to .015\n\n    The retained earnings are expected to continue but drop to a coverage ration of 1.10-1.25X by YE 2014.\n\n    By YE 2014 the retained earnings have resulted in approximately 90M less units being issued.\n\n    The comparison of KMP increases and EPD was surprising over the last 8 years. KMP has increased at a rate slightly over 6% and currently has a coverage ratio of 1.02X expected to drop below 1.0X. EPD has increased at about 5.85% and has had a coverage ratio of 1.35X expected to drop to the 1.15X.\n\n    1/4 cent in one quarter is $2M but when compounded the difference in only 2 years was significant.\n\n\n    SortNewest  |  Oldest  |  Most Replied Expand all replies\n    • Carm-\n\n      Time to let it go. OK?\n\n      The buyout of DEP was not a sale. Yes, you got a stepped up basis, but hard to plan on getting bought out. FWIW, it is also was not supposed to work that way according to the tax code.\n\n    • I think the main argument against it is why they haven't done so until now and that they've said they are going to increase it. This is like over at the SLE board, saying wheres' the spinoff, where's the spinoff, they are lying, lying! Meanwhile, they said it will happen by June 30 and it's May 13th. Why not wait until July 1 and see what happens. Likewise, let's see what happens at the next board meeting and distribution rate announcement prior to the next earnings. If they keep it the same or don't announce a plan to increase the rate from .075, I will be upset too but for now let's take them at their word, that's all I'm saying.\n\n      Meanwhile, if the rate grows and they spell out a path to continue growth from .01 or whatever the new rate is, how hard will it be to convince people to invest in a company that continued to raise the distribution through the worst economic environment since the great depression and is now increasing the rate. Probably not hard.\n\n      Like ARB was saying you can make numbers say whatever you want. For instance as you pointed out, the distribution growth is decreasing as the unit price increases, that's true. However, let's say you bought 100 units at 40, investing 4,000 dollars. The yield on your original investment of $4,000 continues to grow by the same amount because the cash from your pocket is fixed. I bought shares at 18.75 at the time the yield was around 10% and folks on CNBC, SEEKING ALPHA etc. were saying that's not sustainable, buyer beware. Meanwhile about 4 years later, those shares that were yielding 10% whn bought at 18.75 are now yielding over 14% while interest rates have gone down. Not to mention all the units that have been purchased though distribution reinvestment at a fixed rate making the effective yield much higher if you factor in unit price appreciation. So you can spin it almost any way, but in the end the only thing that matters is not where a price of an asset has been, but where it is going.\n\n    • you keep saying I was saying your increase in distribution rate would be \"drastic\". I was not, my point was it would TAKE a DRASTIC increase to move the unit price up significantly thereby freeing less cash for growth only to provide a little more cash for unit holders in the near term while sacrificing growth for future distributions. I don't know your age, and i don't need to know, but I certainly understand that if you're closer to 70 than 50 you might want that cash now and not care about the future. Since many of the board members are in-fact the largest shareholders my opinion is it takes a lot of discipline to look to a future that may not include them instead of shoving as much money in their pocket as they can right now through a much higher distribution, which is going to be raised which is why I'm so puzzled as to why you are so worked up.\n\n      There will be an announcement before the next quarter increasing the distribution rate from .075 to something higher that none of us could possibly figure out since no one outside the company really knows how accretive DEP's assets may be becoming and how the reverse seaway pipeline might add.\n\n      I would have a problem if they did not raise the distribution rate by the end of the year, quite simply because they more or less said they would and I would at that point feel misled. For now, they have treated unit holders well in my estimation as far as considering now and the future.\n\n      I haven't really called you a name, though ignorant, cheerleader and dumb have all been thrown my way. I am not perfect but I am pleased that a man of 32, myself, seems to be much more mature than a man undoubtedly his senior.\n\n    • technically, their not your statements right, they're seeking alphas and morningstar.....according to your earlier statements. EPD has never been down 11% in one day. Thanks so much for the comic relief, i just got off the phone with my old college roommate and he thinks you're a riot too. Usually i would put you on ignore but you are waaaaay to entertaining.\n\n      Bottom line, could you have made more money in other investments than EPD over the past 3 years. Of course you could have, but not in half the other MLP's for starters and there would have a lot more headaches tied to up and downs in the overall market and not have nice tax-friendly distribution.\n\n      When capital gains and dividend taxes go up next year, do you think that's going to make MLP distributions more or less attractive for folks that are looking for income in a low interest rate environment?\n\n    • yes talk to DEP unit holders and ask them what their cost basis is with their \"new\" EPD units.\n\n    • I am indeed still a teacher. I also spent time as an accountant. One of the things I learned is you can make the numbers say almost anything you want them to. Choosing the time of comparison changes the facts. One also needs to compare apples to apples and MLPs are a very diverse group of companies.\n\n      I normally take a historical perspective in looking a a company since companies are usually slow to change their ways of doing business. As to EPD there was a long term plan when Dan was alive that continued for over a decade. Since his passing there has been a verbal statemnt that it is business as usual, but the reality is changes have been happening.\n\n      2010 brought the big one and last of the DD planned events in the buyout of the GP that was dilutive about 5% for 2010 and nuetral for the first 1/2 of 2011. This buyout will increase the cash flow in future years by an ever increasing amount. Same situation for DEP.\n\n      If I therefore look to the future and think about EPD having really only one yearly look at their distribution policy (Yes, it seems a bit short sighted but they have always tried for appearance of stability and strength)thus they nnned to first see the effect of the GP buyout and then DEP along with a geometric ramp up of organic programs. By July of this year the acquisitions will be digested and they should have a picture of what their program looks like and how it will effect cash flow.\n\n      I have stated that I suported the conservative nature and agree you need to see how a frac plant build goes, but after building 6 or 8 or them it should both get cheaper, faster, and the result more predicatable. That will result in a increase which IMHO will do little for the unit price of EPD, but will stabilize it in the $50-60 area through 2015 when wee have higher interest rates. If I am wrong - and I hope so - the plants will be significantly more profitable and DCF will rise significantly higher to provide for something in the.0125 to .015 increase rate. As an accumulator since 1995 that holds a maximum position in EPD that makes me a happy camper. I will gladly trade a couple %points of gain for the security of a stable secure distribution.\n\n\n    • I certainly don't disagree with any of that...\n\n      Carny said I was full of crap when I stated a simple fact... that EPDs performance was middle of the pack\n\n      I used a quickly available chart to prove it... and those #s quite conveniently were for the trailing 3 years... which I believe was his challenge/wager\n\n      The horse has been beaten to death.... I see no special return over the time frame given that so much cash has been retained....\n\n      Perhaps it starts to pay off big time moving forward... but I'm skeptical.... IF they raise the growth rate along the lines that you have proposed... EPD will probably perform the best in a troubled sector when the Fed acts\n\n      and I fully comprehend that it is the quality balance sheet that they have created that will make it so... I never once implied that the policy of retaining large amounts of cash wasn't a good one...\n\n      All I ever said was that the time had passed to bump the rate by a very small amount... and unfortunately many posters failed to comprehend it\n\n      and I'll tell you that I do not like being talked down to by someone as ignorant as Carny... beyond the silliness of calling a 1/4 cent bump drastic... who cares how he believes EPDs performance is the best..... He talks down at me and says that distributions are tax free... that IF the company is bought.. that there is a step up in cost basis... It would be outright dangerous for people to believe his posts are remotely factual... especially given the tax analysis we see here\n\n      I have seen posters on this board taken to the woodshed for simple mistakes of calling the distribution a dividend... calling a unit a share...\n\n      But no one challenged this putz of a cheerleader when he made completely ignorant statements like I have pointed out... and I know in my gut that you know his comments were outright stupid\n\n      and BTW.... I admire your profession... because good teachers who care about kids... matter... good teachers make an impact on my daughter every day... who is a junior in HS\n\n      and you make a big impact on this board with those that take the time to understand what you are saying... still teaching\n\n      unfortunately I think some like what you say... but haven't learned anything as a result\n\n    • Mktply -\n\n      I can give you a great explanation as to why EPD has preformed in the middle of the pack. EPD by doing its organic growth projects at an ever increasing number is doing two thnigs. #1 it is increasing expenses by some 1-2% of the projects until they go on line because of administrative costs. EPD suggested this number at some $80M a year. #2 it causes units and debt to be issued to pay for the projects before they are completed. Last year based on $2B in projects with an average 18-24mo completion time frame means about $50M in interest costs for projects in progress and about the same to pay distributions on units.\n\n      Thus there would be another $180M available if EPD would either slow down or stop organic projects to distribute. I for one am happy to wait but the average unitholder is not. They invest on what happens today and the current distribution.\n\n      I agree EPD can and should raise the distribution. I am also happy with the return EPD has provided me since in began.\n\n      Last, using the Seeking Alpha numbers is a bit misleading because if you take a different starting date you get different results. Each MLP has had great years and terrible ones. OKS for example went absolutely nowhere for years just after 2000 for about 6 years. Does that make the recent 3 years indicative that it is better than EPD - I think not.\n\n      With organic projects you have a delay on the return. EPD has done well. Also most of the comparison companies are most worth as much as the capital expenditures of EPD. Last it is easy to have an increase when you start with a small base. Not so easy to move an elephant.\n\n      Disclosure. I have owned OKS and EPD as core MLP positions for over 10 years.\n\n\n    • I agree too, although certainly will not be following you and selling down my holdings.\n      Really I can't see what should be so controversial about the idea of slightly increasing the distribution growth rate to at least 1c per quarter. They can easily cover it.\n\n    • You might want to reconsider that. There are plenty of MLPs with higher total return than EPD over the last 3 years.\n\n      And for the record, while staying out of this slugfest, I agree with the other poster that they should be able to manage a slightly higher distribution growth than this. With a fixed increase each quarter the distribution growth percentage keeps getting smaller each quarter. They could easily raise it to at least 1c per quarter without any negative impact. Some of the arguments here arguing against it have been pretty ludicrous.\n\n    • View More Messages\n\nTrending Tickers\n\n",
  "response": "### **1. Overall Scene Theme and Core Concept**  \n**Scene Type:** **High-Stakes Financial Trading Backoffice (Circa 2014)**  \nA frenetic, high-pressure backoffice of a mid-tier investment firm during the 2014 U.S. market close. The atmosphere is tense—computers hum, printers whir, and analysts scramble to finalize reports before the weekend. The scene is inherently collaborative due to:  \n- **Time-sensitive tasks** requiring parallel workflows (e.g., reconciling trades, verifying compliance documents).  \n- **Heavy/awkward objects** requiring team lifts (e.g., server racks, document archives).  \n- **Information asymmetry**—critical data is scattered across terminals, paper files, and whiteboards, forcing agents to share intel.  \n\n---\n\n### **2. Spatial Layout and Area Descriptions**  \n**A. Trading Floor Bullpen**  \nAn open-plan area with rows of cluttered desks. Monitors glow with frozen stock charts; sticky notes coat bezels. Overhead, a broken AC unit drips condensation into a makeshift bucket.  \n\n**B. Compliance Archive Closet**  \nA cramped, windowless room lined with filing cabinets. A flickering bulb casts shadows over boxes labeled *\"EPD 2011-2014 Tax Audits\"*. A dented fire extinguisher leans against a stack of CRT monitors.  \n\n**C. Server Room**  \nA glass-walled chamber housing humming racks. Wires snake across the floor; a half-disassembled UPS battery leaks acid onto a *\"FRAGILE: CORROSIVE\"* spill kit.  \n\n**D. Break Room**  \nA dystopian respite: stained coffee mugs, a microwave displaying *\"00:00\"*, and a whiteboard scrawled with *\"DISTRIBUTION GROWTH ≠ DIVIDENDS!!!\"* in red marker.  \n\n**E. Executive Office**  \nA fishbowl with a leather chair and a locked cabinet. A framed *\"MLP Sector Performance 2008-2014\"* chart hangs crookedly.  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. Trading Floor Bullpen**  \n**a. Anchor Furniture & Installations:**  \n- **L-shaped workstation clusters**: Steel-framed desks (2m x 1.5m) with ergonomic chairs (one missing a wheel).  \n- **Overhead cable trays**: Sagging under tangled Ethernet and power lines.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Bloomberg Terminal #7**: Frozen on *\"EPD: $2.92 DIST\"*; keyboard missing \"Enter\" key.  \n- **Regulatory binder**: Thick, labeled *\"Q4 2014 Retained Earnings (CONFIDENTIAL)\"*, buried under three empty Starbucks cups.  \n- **Label maker**: Out of tape, displaying *\"ERR: CARTRIDGE\"*.  \n\n**c. Functional Ambient Objects:**  \n- **Laser printer**: Jammed with a crumpled *\"KMP vs. EPD Coverage Ratio\"* spreadsheet.  \n- **Desk phones**: One off-hook, emitting a dial tone.  \n\n**d. Background & Decorative Objects:**  \n- **Motivational poster**: *\"TEAMWORK: SYNERGY OVER SYMBOLS\"* with a peeling corner.  \n- **Dusty trophy**: *\"2012 RBC Energy Sector Accuracy Award\"*.  \n\n---\n\n#### **B. Compliance Archive Closet**  \n**a. Anchor Furniture & Installations:**  \n- **Industrial shelving units**: Rusting, loaded with banker’s boxes (30kg each, dimensions 40x30x25cm).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Misfiled folder**: *\"DEP Buyout Tax Implications\"*, wedged behind a fire hose.  \n- **Microfiche reader**: Powered on but displaying static.  \n\n**c. Functional Ambient Objects:**  \n- **Wheeled step stool**: One stuck wheel, squeaks loudly.  \n\n**d. Background & Decorative Objects:**  \n- **Mouse nest**: Shredded *\"2013 CITI Reports\"* in a corner.  \n\n---\n\n#### **C. Server Room**  \n**a. Anchor Furniture & Installations:**  \n- **Server rack A7**: 180kg, 2m tall, partly unbolted from the floor.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **NAS backup drive**: Blinking red *\"FAILURE\"* LED.  \n- **Spill kit**: Seal broken; neutralizer powder spilled.  \n\n**c. Functional Ambient Objects:**  \n- **KVM switch**: Stuck on *\"TERMINAL 3\"*.  \n\n**d. Background & Decorative Objects:**  \n- **Graffiti**: *\"DON’T TOUCH MY CONFIG\"* etched into a rack door.  \n\n---\n\n### **4. Scene Affordances and Embedded Potential**  \n\n**Collaborative Transportation Affordances:**  \n- **Server rack A7** (180kg, 2m tall) requires 2+ agents to stabilize during maintenance.  \n- **Banker’s boxes** (30kg) in the archive must be handed down from high shelves via relay.  \n\n**Reasoning & Tool-Use Affordances:**  \n- **Attribute-based Reasoning**:  \n  - Five nearly identical *\"EPD Distribution History\"* binders differ by:  \n    - *\"2014\"*: Blue tab, coffee stain on p. 12, sticky note: *\"COVERAGE 1.15X??\"*.  \n    - Distractor: A decorative blue binder holds unrelated catering invoices.  \n- **Compound Reasoning**:  \n  - **Problem**: Locked executive cabinet (requires key).  \n  - **Solution**: Keycard hidden inside *\"SLE Spinoff Draft\"* folder in compliance (itself behind a 20kg box).  \n\n**Dynamic States**:  \n- The leaking UPS battery will corrode the floor within 20 minutes unless neutralized (spill kit is incomplete—requires baking soda from the break room).  \n\n---  \n\n### **Design Intent**  \nThis scene forces agents to:  \n1. **Collaborate physically** (heavy lifting, simultaneous actions).  \n2. **Reason under noise** (distractors like decorative binders, broken equipment).  \n3. **Navigate asymmetric knowledge** (e.g., only one terminal shows the EPD freeze; only the step stool reaches the spill kit).  \n4. **Adapt to cascading failures** (printer jam → manual reconciliation → delayed compliance submission).  \n\nThe density ensures no task is trivial—even fetching coffee requires navigating a maze of chairs, sticky floors, and a broken machine."
}