{
  "id": 1391,
  "raw": "\nRetrieved from http://www.slate.com/articles/arts/books/2012/02/straight_by_hanne_blank_reviewed_.single.html\nText:\nHeterosexuality Is Only 150 Years Old\n\nReading between the lines.\nFeb. 9 2012 7:15 AM\n\nNo Hetero\n\nHanne Blank’s lively history of straights.\n\nA happy and man and woman on their wedding day.\nHow much of sexual orientation is what we've been taught to call ourselves?\n\nGeorge Eastman House Collection.\n\n\nTroy Patterson Troy Patterson\n\n\n\n\nStraight covers an impressive bit of social-historical ground despite being, true to its subtitle, a compact production. It runs 264 pages, including index and footnotes. There are no illustrations, lamentably, so let's start with the author bio. Hanne Blank is \"an independent scholar,\" earlier the author of Virgin: The Untouched History, and her \"work has been featured everywhere from Out to Penthouse\"—a gamut that would seem to exclude both Oui and Playgirl. She is, on the evidence, a rigorous thinker. Tracing the history of the word heterosexual and homosexual—coined, in 1868, by a pamphleteer opposed to the laws against \"unnatural fornication\" being written into the Prussian penal code—she is calm and clear. Tracing the way those coinages and the ideas animating them radiated into general discourse—by way of Kraft-Ebbing and Kinsey and Freud—she is deft and nimble. Shuttling back and forth through time to chat about related issues—including matrimony and sodomy, the economics of nonsexual bed-sharing and the history of romantic love—she exhibits the handsome confidence of a popular historian. And dragging herself into it, she uses a light touch to make us question the pronoun she.\n\n\nIn the acknowledgements, Blank thanks her partner for \"being such such a good sport about being made into a framing device for a history book.\" The author is a woman who claims \"no deep personal attachment to labeling myself in terms of sexual orientation,\" and her better half is, in terms of sexual organs, a man. But does the manhood make the man? He is diagnosed with Klinefelter Syndrome, \"one of the most common sex-chromosome anomalies,\" meaning that his DNA reads XXY. His looks are androgynous, and his testicles are no help to the perpetuation of the species, but everything's peachy … until you start wondering whether this couple's love would traditionally be allowed to speak its name.\n\nIt would be orthodox to say that he is a man and that their relationship is heterosexual, but Blank is most compelling when talking about doxa. One of her few resorts to jargon, it’s a necessary one. \"When anthropologists talk about this 'stuff everyone knows,' \" she writes, \"they use the term doxa. Doxa comes from the Greek for 'common knowledge,' and that's a pretty good description of what it is: the understanding we absorb from our native culture that we use to make sense of the world. … We all create it, together, mostly unintentionally.\" The doxa of straightness was created by tribal leaders and trial lawyers, by old wives and Viennese witch doctors, and it is being created by me as I write and you as you read. Blank has some questions for us, and they originated, it seems, with an intimate inquiry she confronts at the health clinic when wondering which box to tick, \"gay,\" \"lesbian,\" \"bisexual,\" \"transgender,\" or \"heterosexual.\"\n\nHanne Blank.\nHanne Blank\n\nCourtesy Hanne Blank.\n\nThe book's impetus may be personal but its passions are strictly philosophical. One mission of Straight is to argue with people identified, with a Cornel West flourish, as \"our right-wing brothers and sisters\"—some of whom, mostly scarily those running for president, assert that heterosexuality is all about procreation. But Blank's argument isn't against them. Rather, it's an engagement with the whole system of thought that allows and encourages right and left wings to take flight.\n\nIf I fail to convey the book's central point, that is because the book has no center. It's possible that Blank isn't the tenure-track type because her prose style is too good for too many of the departments that go in for her kind of thing—too free of weedy rhetoric to take root in the groves of academe. But also, Blank, though eminently reasonable, is not committed to sustained linear reasoning. The book hops among a useful riddle about \"marked categories\" (if we say that prude is the opposite of slut, then what are we saying about the person who is neither?), some thoughts on a court case involving the jazz pianist Billy Tipton (a woman who passed as a man, which was news to his widow), and a consideration of the metaphorical \"wide stance\" of Larry Craig (\"he straddled the border of what was permissible for a man in a position of power\"). Elsewhere, there are mini-essays on the cultural shift from courting to dating, the Defense of Marriage Act, the advent of no-fault divorce. … It's all smart, and it's all over the place.\n\n",
  "response": "# **Scene Concept: \"The Anthropological Archives\"**  \n\n## **Overall Scene Theme and Core Concept**  \n\n**Scene Type:** A sprawling, underfunded university archive dedicated to the study of human sexuality, gender, and social norms across cultures and history. The space is a labyrinth of documents, artifacts, and forgotten research, where scholars collaborate to uncover hidden narratives.  \n\n**Why Multi-Agent?**  \n- **Physical Collaboration:** Heavy, fragile artifacts require coordinated handling.  \n- **Information Retrieval:** Clues are scattered—documents must be cross-referenced, requiring division of labor.  \n- **Problem-Solving:** Some materials are locked, obscured, or incomplete, necessitating tool use and reasoning.  \n\n## **Spatial Layout and Area Descriptions**  \n\n1. **Main Research Hall** – The central workspace, lined with long tables, cluttered with open books, half-sorted papers, and reference materials. Dim lighting from flickering fluorescents.  \n2. **Restricted Archives** – A locked section containing sensitive materials (court transcripts, personal letters). Requires keycard access.  \n3. **Specimen Storage** – Shelves of preserved anthropological artifacts (clothing, ceremonial objects, medical models). Some items are fragile or hazardous.  \n4. **Digitization Lab** – A cramped corner with scanners, a humming server rack, and stacks of yet-to-be-processed documents.  \n5. **Scholar’s Lounge** – A break area with coffee stains, outdated magazines, and a whiteboard covered in half-erased theories.  \n\n---  \n\n## **Detailed Area-by-Area Inventory**  \n\n### **1. Main Research Hall**  \n\n**a. Anchor Furniture & Installations:**  \n- A 4-meter-long oak table (scratched surface, uneven legs, holds ~200kg of books).  \n- Three tall bookcases (overstuffed, one leaning precariously).  \n- A rolling ladder (squeaky left wheel, height: 3.5m).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **The \"Klinefelter Box\"** – A sealed archival case (60x40x20cm, reinforced glass lid, weight: 15kg) containing medical records on chromosomal anomalies. *Requires two people to lift safely.*  \n- **Unlabeled Ledger** – Thick, leather-bound (water-stained, missing pages). Inside: handwritten notes on 19th-century Prussian legal debates.  \n- **Microfilm Reader** – Functional but flickers intermittently. Beside it: a tangled film reel labeled *\"Kinsey Interviews, Reel 7/12.\"*  \n\n**c. Functional Ambient Objects:**  \n- A wheezing air purifier (filter clogged, orange light blinking).  \n- A corkboard with pinned notes (some illegible due to coffee spills).  \n- A working but noisy desk fan (oscillation stuck).  \n\n**d. Background & Decorative Objects:**  \n- A cracked \"No Food\" sign (ignored; crumbs visible under table).  \n- A faded poster: *\"The Social Construction of Sexuality\"* (peeling corners).  \n- A dusty trophy: *\"Best Thesis 1987\"* (tarnished, atop a shelf).  \n\n---  \n\n### **2. Restricted Archives**  \n\n**a. Anchor Furniture & Installations:**  \n- Steel security door (keycard reader, red LED when locked).  \n- Industrial shelving (bolted to floor, holds ~50 archival boxes).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Locked Cabinet (XXY Research)** – Requires a keycard (last seen in Scholar’s Lounge). Inside: original pamphlets from 1868 coining \"heterosexual.\"  \n- **Fragile Court Transcripts** – Aged paper (brittle, must be handled with gloves).  \n\n**c. Functional Ambient Objects:**  \n- A broken chair (leg snapped, shoved in corner).  \n- A fire extinguisher (expired, mounted on wall).  \n\n**d. Background & Decorative Objects:**  \n- Graffiti on wall: *\"Who decides what’s natural?\"* (faint pencil).  \n- A dead potted plant (dry soil, cracked ceramic).  \n\n---  \n\n### **3. Specimen Storage**  \n\n**a. Anchor Furniture & Installations:**  \n- Glass display cases (one cracked, held together with tape).  \n- A heavy wooden crate (marked *\"Fragile: Ceremonial Masks\"*).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Sealed \"Tipton Collection\"** – Contains Billy Tipton’s personal effects (locked, combination written on a sticky note in Digitization Lab).  \n- **Hazardous Sample Jar** – Blue-capped, labeled *\"Corrosive – Do Not Open.\"*  \n\n**c. Functional Ambient Objects:**  \n- A microscope (dusty, but functional).  \n- A box of latex gloves (half-empty).  \n\n**d. Background & Decorative Objects:**  \n- A mannequin wearing 1950s wedding attire (missing a hand).  \n- A stack of outdated *\"Journal of Sexology\"* issues (1970s).  \n\n---  \n\n## **Scene Affordances and Embedded Potential**  \n\n### **Collaborative Transportation Affordances**  \n- **The Klinefelter Box (15kg, reinforced glass)** – Too heavy for one person to carry safely; requires coordination.  \n- **The Wooden Crate (50kg, bulky)** – Must be moved with a dolly (present but stuck under a shelf).  \n\n### **Reasoning and Tool-Use Affordances**  \n- **Attribute-Based Reasoning:**  \n  - *Find the corrosive chemical bottle among five similar ones.* Only one has a **blue cap**, **handwritten label**, and **half-full liquid**. (Distractor: A decorative blue vase nearby.)  \n- **Compound Reasoning:**  \n  - *Problem:* The Restricted Archives are locked.  \n  - *Solution:* The keycard is inside a desk drawer in the Scholar’s Lounge, buried under old coffee receipts.  \n\nThis dense, atmospheric environment is primed for complex collaboration—requiring physical coordination, information synthesis, and multi-step problem-solving."
}