{
  "id": 1415,
  "raw": "\nRetrieved from http://en.wikipedia.org/wiki/Color_metaphors_for_race\nText:\nColor terminology for race\n\nFrom Wikipedia, the free encyclopedia\n  (Redirected from Color metaphors for race)\nJump to: navigation, search\n\nIn some societies and among some anthropologists, color terminology was used to label races, sometimes in addition to a non-color term for the same race. Identifying races in terms of their human skin color has been common since at least the Physiognomica falsely attributed to Aristotle.\n\nOther scientists were more cautious about such categorization, and Charles Darwin argued that the number of categories, or in this case the number of different colors, is completely arbitrary and subjective. For example, some claimed three distinct colors, some four, and others have claimed even more. In contrast, Darwin argued that there are gradations, or degrees between the numbers of categories claimed, and not distinct categories, or colors.[1]\n\nWestern classifications[edit]\n\nJohann Friedrich Blumenbach\nFurther information: Scientific racism\n\nOne of the earlier uses of the concept of “black” as a metaphor for race was first used at the end of the 17th century when a French doctor named François Bernier (1625–1688), an early proponent of scientific racism, divided up humanity based on facial appearance and body type. He proposed four categories: Europeans, Far Easterners, Lapps, and Blacks.[2] The first major scientific model was created in the 18th century when Carolus Linnaeus recognized four main races: Europeanus which he labeled the white race, Asiaticus, which he labeled the yellow race, Americanus, which he labeled the red race, and Africanus, which he labeled the black race.[3] By adding the brown race, which he called \"Malay\" for Polynesians, Melanesians of Pacific Islands, and aborigines of Australia,[4] Linnaeus' protégé, anthropology founder Johann Friedrich Blumenbach (1752–1840), came up with the five color typology for humans: white people (the Caucasian or white race), more or less black people (the Ethiopian or black race), yellow people (the Mongolian or yellow race), cinnamon-brown or flame colored people (the American or red race) and brown people (the Malay or brown race). Blumenbach listed the \"races\" in a hierarchic order of physical similarities: Caucasian, followed by Americans (Amerindian), followed by Mongolian, followed by Malayan, followed by Africoid peoples. Rand McNally's 1944 map of races describes Amerindians as being the copper race or copper people.[5]\n\nA 1920 map shows the races of the world classified by color: White (shown colored red), black (shown colored gray), yellow, brown, and red (shown colored light orange) (It was understood that Amerindians were the red race.); areas of mixed black and white populations are shown as purple. Later maps of the 1930s through 1960s brought the colors portrayed into line with the accepted definitions of the various races at that time according to physical anthropology (rather than simple external skin color alone as in this 1920 map) and one later map classified North Africans, Middle Easterners, the Iranian peoples, and South Asians as being white, Turkish peoples as being yellow, and restricted the brown category to those now called Austronesians, who were termed the Malayan race.[6]\n\nAccording to conservative writer Dinesh D'Souza, \"Blumenbach's classification had a lasting influence in part because his categories neatly broke down into familiar tones and colors: white, black, yellow, red, and brown.\"[7][8]\n\nDifferent races[edit]\n\nTwo historical anthropologists favored a binary racial classification system that divided people into a light skin and dark skin categories. 18th-century anthropologist Christoph Meiners, who first defined the Caucasian race, posited a \"binary racial scheme\" of two races with the Caucasian whose racial purity was exemplified by the \"venerated... ancient Germans\", although he considered some Europeans as impure \"dirty whites\"; and \"Mongolians\", who consisted of everyone else.[9] Meiners did not include the Jews as Caucasians and ascribed them a \"permanently degenerate nature\".[10] Hannah Franzieka identified 19th-century writers who believed in the \"Caucasian hypothesis\" and noted that \"Jean-Julien Virey and Louis Antoine Desmoulines were well-known supports of the idea that Europeans came from Mount Caucasus.\"[11] In his political history of racial identity, Bruce Baum wrote,\"Jean-Joseph Virey (1774-1847), a follower of Chistoph Meiners, claimed that \"the human races... may divided... into those who are fair and white and those who are dark or black.\"[12] Later, another binary racial classification system took hold de facto in the United States based on light skin people and dark skin or black people. According to Stephen Saris, in the United States there are two big racial divides. \"First, there is the black-white kind, which is basically anti-black.\". The second racial divide is the one is \"between whites and everyone else\" with whites being \"narrowly construed\" and everyone else being called \"people of color\".[13]\n\nUnderstanding of melanin[edit]\n\nRacial classification according to skin color became more complex when anthropologists added other, less obvious characteristics, in their attempt to achieve a scientific classification of races. It was later found that skin color depended essentially from the amount of melanin, and could vary widely in the same community. Thus, it could not provide a satisfying way to classify ethnic groups, much less \"races.\" Following World War II and the discredit of such racial classifications, more and more biologists and anthropologists began to question the concept itself of \"race.\" Thus, The Race Question statement by the UNESCO, in the 1950s, proposed to substitute the term \"ethnic groups\" to the concept of \"race,\" arguing that human communities were defined as much by cultural traits (language, religion, etc.) as by biological characteristics (skin color being only one of them, along with blood types, which did not recover previous racial classifications, etc.).\n\nSymbolism and uses of color terminology[edit]\n\nThe Martinique-born French Frantz Fanon and African-American writers Langston Hughes (\"That Word Black\"), Maya Angelou, and Ralph Ellison, among others, wrote that negative symbolisms surrounding the word \"black\" outnumber positive ones. They argued that the good vs. bad dualism associated with white and black unconsciously frame prejudiced colloquialisms. In the 1970s the term black replaced Negro in the United States.[14]\n\nTone gradations[edit]\n\nIn some societies people can be sensitive to gradations of skin tone, which may be due to intermarriage or to albinism and which can affect power and prestige. In 1930s Harlem Slang such gradations were described by a tonescale of \"high yaller [yellow], yaller, high brown, vaseline brown, seal brown, low brown, dark brown\".[15] These terms were sometimes referred to in blues music, both in the words of songs and in the names of performers. In 1920s Georgia, Willie Perryman followed his older brother Rufus in becoming a blues piano player: both were albino Negroes with pale skin, reddish hair and poor eyesight. Rufus was already well established as \"Speckled Red\", Willie became \"Piano Red\".[16] The piano player and guitarist Tampa Red from the same state developed his career in Chicago, Illinois, at that time: his name may have come from his light skin tone, or possibly reddish hair.\n\nMore recently such categorization has been noted in the Caribbean. It is reported that skin tones play an important role in defining how Barbadians view one another, and they use terms such as \"brown skin, light skin, fair skin, high brown, red, and mulatto\".[17] An assessment of racism in Trinidad notes people often being described by their skin tone, with the gradations being \"HIGH RED – part White, part Black but ‘clearer’ than Brown-skin: HIGH BROWN – More white than Black, light skinned: DOUGLA –part Indian and part Black: LIGHT SKINNED, or CLEAR SKINNED Some Black, but more White: TRINI WHITE – Perhaps not all White, behaves like others but skin White\".[18] In Jamaica albinism has been stigmatized, but the albino dancehall singer Yellowman took his stage name in protest against such prejudice and has helped to end this stereotype. The West Indian region uses the term \"coolie\" for all people of east Indian descent. In Trinidad, however, use of the term is considered extremely offensive.\n\n\nIn Russia, persons of Caucasus or Asian descent and other people having black hair are often referred to as Black (not because of skin color). \"White\", apart from its racial meaning, is also a term denoting opponents of the Bolsheviks during the Russian Civil War (see White movement for this usage) and \"Red\", apart from its racial meaning, means Communists or Bolsheviks while \"Green\" often means Ecologists.\n\nSometimes, Belarus and Belarusians have been referred to (in Western languages, not Russian) as \"White Russia\" and \"White Russians\", which can be misleading; see those articles for discussion in more depth.\n\n\nHuang (yellow) is a common surname, but does not refer to the East Asian race as was popular in Western languages until recently. However, the Yellow Emperor was a legendary founder of China. Yellow is also identified with the \"center\" cardinal direction (blue-east, red-south, white-west, black-north) while China is known as Zhongguo \"middle kingdom\".\n\n\n\n  • Black Bone and White Bone Yi\n\n\n\nThe word, 인종 in-jong, is used when describing a person's race, which also incorporates his or her skin color. Whitebaek, used with 인 in to make 백인, baek-in, literally means 'white-person' in Korean, cognate to Chinese bairen 白人 and Japanese hakujin 白人. 흑 heuk is used to describe persons of African descent, 흑 heuk literally means 'black' in hanja (Chinese characters/ Chinese-derived Korean) (i.e. 흑인, cognate to Chinese heiren 黑人 and Japanese kokujin 黒人).\n\nCentral Asia[edit]\n\n\nNorth America[edit]\n\nAmong the natives of North America, stylized medicine wheels are typically depicted[citation needed]\n\nwith four colors associated with not only cardinal direction, but also with color of race:\n\n  • North: White\n  • South: Black\n  • East: Yellow\n  • West: Red\n\n2000 US Census[edit]\n\nIn the 2000 United States Census, two of the five enumerated races are labeled by a color.[19] In the 2000 US Census, the white race, refers to a \"person having origins in any of the original peoples of Europe, the Middle East, or North Africa.\"[19] In the 2000 US Census, the black race, also called \"African American\" on the US Census, refers to a \"person having origins in any of the Black racial groups of Africa.\"[19] The other three races are not labeled by color.[19]\n\nFlag of the Races[edit]\n\nAt college campuses during the 1960s, some people demonstrated for world peace by carrying a Flag of the Races (also called the Flag of the Human Race) with five horizontal stripes (from top to bottom they were red, black, brown, yellow, and white, representing respectively the American Indian race, the Negro race, the Malayan race, the Mongolian race, and the Caucasian race). Gilbert Baker is said to have gotten the idea for the rainbow flag from this flag.[20] The early flag of the Republic of China also featured five stripes standing for five ethnicities.\n\nSee also[edit]\n\n\n  1. ^ \"It may be doubted whether any character can be named which is distinctive of a race and is constant.\", Charles Darwin, The Descent of Man p225,\n    The Mis-portrayal of Darwin as a Racist\n  2. ^ The End of Racism by Dinesh D'Souza, pg 123, 1995\n  3. ^ The Importance of “Whiteness” in American Legal History\n  4. ^ The Mismeasure of Man by Stephen Jay Gould, pg 402, 1996\n  5. ^ See: Rand McNally’s World Atlas International Edition Chicago:1944 Rand McNally Map: \"Races of Mankind\" Pages 278-279--In the explanatory section below the map, the American Indian Race is described as being \"copper-colored\"\n  6. ^ For an example of a later color race map, see: Rand McNally’s World Atlas International Edition Chicago:1944 Rand McNally Map: \"Races of Mankind\" Pages 278-279 (See explanatory section below map)\n  7. ^ The End of Racism by Dinesh D'Souza, pg 124, 1995\n  8. ^ Race, Identity and Africanity: A Reply to Eboussi Boulaga\n  9. ^ Painter, Nell Irvin. Yale University. \"Why White People are Called Caucasian?\" 2003. September 27, 2007. [1]; Keevak, Michael. Becoming Yellow: A Short History of Racial Thinking. Princeton University Press, 2011. ISBN 0-6911-4031-6.\n  10. ^ Eigen, Sara. The German Invention of Race. Suny Press:New York, 2006. ISBN 0-7914-6677-9 p.205\n  11. ^ Franzieka, Hannah. Berghahn Books: 2004. ISBN 1-57181-857-X James Cowles Prichard's Anthropology: Remaking the Science of Man in Early\n  12. ^ Baum, Bruce David. The Rise and Fall of the Caucasian Race: A Political History of Racial Identity. New York University: 2006. ISBN 0-8147-9892-6\n  13. ^ Zack, Naomi. American Mixed Race: The Culture of Microdiversity 1995\n  14. ^ Black, black, or African American?, Aly Colón\n  15. ^ Zora Neale Hurston's - Glossary of Harlem Slang \"Tonescale\"\n  16. ^ The Blues Collection issue 68, Piano Red, Contribution by Tony Russell, 1996\n  17. ^ Barbados - Post Report - eDiplomat\n  18. ^ RACISM IN TRINIDAD (pdf)\n  19. ^ a b c d US Census Bureau. Race. 2000. Accessed July 14, 2008\n  20. ^ Carleton College—“Symbols of Pride of the LGBTQ community”:\n",
  "response": "### **Scene Concept: \"The Chroma Archives – A Collaborative Anthropology Research Center\"**  \n\n#### **1. Overall Scene Theme and Core Concept**  \nThe Chroma Archives is a bustling interdisciplinary research center dedicated to the study of human cultural artifacts tied to color symbolism across history. The facility houses a vast collection of documents, pigments, textiles, and multimedia exhibits, all requiring careful cataloging, restoration, and analysis. The environment is inherently collaborative—large artifacts require multiple handlers, delicate items need synchronized precision, and researchers must cross-reference scattered data.  \n\n#### **2. Spatial Layout and Area Descriptions**  \nThe Archives consist of:  \n- **Main Atrium & Reception:** A high-ceilinged entry with digital displays tracking ongoing projects.  \n- **Pigment Lab:** A controlled-environment workspace for analyzing historical dyes and paints.  \n- **Textile Restoration Room:** A climate-controlled area with large worktables and preservation tools.  \n- **Document Vault:** A secure, humidity-regulated archive of manuscripts and maps.  \n- **Collaborative Research Hub:** An open-plan workspace with shared terminals, whiteboards, and artifact staging areas.  \n\n---  \n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. Pigment Lab**  \n**a. Anchor Furniture & Installations:**  \n- A **10-foot steel lab table** with embedded fume extractors, divided into quadrants for different pigment types.  \n- A **refrigerated cabinet** (2m tall, 1m wide) storing light-sensitive organic dyes in labeled vials.  \n- A **spectrophotometer workstation** bolted to a vibration-dampening platform.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- A **fragmented 18th-century color wheel** (60cm diameter, glass-protected) with missing segments needing reconstruction.  \n- A **locked titanium case** (40x30x20cm, 15kg) labeled \"Bernier’s Original 1684 Notes\"—requires two keys (held by different researchers).  \n- A **malfunctioning digital microscope** (display flickering, requires recalibration).  \n\n**c. Functional Ambient Objects:**  \n- A **centrifuge** (idle, last used for separating pigment binders).  \n- A **wall-mounted UV lamp** (switch sticky, needs firm pressure).  \n- A **stack of petri dishes** (some contaminated with dried residue).  \n\n**d. Background & Decorative Objects:**  \n- A **framed 1920s racial color-map** (slightly askew, edges foxed).  \n- A **chipped mug** labeled \"World’s Best Anthropologist\" holding paintbrushes.  \n- A **dusty safety poster** (\"WEAR GLOVES WHEN HANDLING CADMIUM PIGMENTS\").  \n\n---  \n\n#### **B. Textile Restoration Room**  \n**a. Anchor Furniture & Installations:**  \n- A **4m x 2m hydraulic textile table** (adjustable height, currently raised to 1.2m).  \n- A **freestanding magnifier arm** (3x magnification, joint stiff from disuse).  \n- **Textile storage racks** (aluminum, with numbered slots for rolled fabrics).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- A **partially restored 19th-century \"Flag of the Races\"** (3m long, frayed red stripe, pinned under tension clamps).  \n- A **misplaced dye-sample book** (buried under unrelated swatches in a drawer).  \n- A **jammed fabric steamer** (water reservoir full but nozzle clogged).  \n\n**c. Functional Ambient Objects:**  \n- A **bone folder and Teflon spatulas** (strewn near a half-rolled silk scroll).  \n- A **digital humidity gauge** (displaying 52% RH, slightly off calibration).  \n- A **wheeled thread cart** (one sticky wheel).  \n\n**d. Background & Decorative Objects:**  \n- A **faded \"Silk Conservation Guidelines\" poster** (1980s vintage).  \n- A **dead potted fern** (soil cracked from neglect).  \n- A **coffee stain** on a work log dating it to \"03/14.\"  \n\n---  \n\n#### **C. Document Vault**  \n**a. Anchor Furniture & Installations:**  \n- **Compactus shelving units** (3-ton capacity, manual crank handle).  \n- A **fireproof safe** (1.5m tall, combination-locked) for irreplaceable texts.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- A **disorganized box of Linnaeus’ race-classification drafts** (mixed with unrelated botany notes).  \n- A **stuck drawer** in the card catalog (requires simultaneous lifting and jiggling).  \n- A **mis-shelved 1944 Rand McNally atlas** (open to the \"Races of Mankind\" map).  \n\n**c. Functional Ambient Objects:**  \n- A **book cradle** (adjustable arms set too wide for current tome).  \n- A **flickering LED lamp** (needs bulb replacement).  \n- A **microfilm reader** (last used for 1930s Harlem slang dictionaries).  \n\n**d. Background & Decorative Objects:**  \n- A **leather-bound ledger** labeled \"Donations 1920-1950\" (spine cracked).  \n- A **dusty globe** (political boundaries outdated).  \n- A **framed photo of Blumenbach** (glass cracked in one corner).  \n\n---  \n\n### **4. Scene Affordances and Embedded Potential**  \n- **Collaborative Transportation:** The **10-foot textile table** (150kg, requires hydraulic lever coordination) and **Compactus shelves** (3-ton load, crank mechanism needs two agents—one to stabilize, one to turn).  \n- **Reasoning & Tool Use:**  \n  - **Attribute-Based:** Identify the **correct dye vial** (only one has a \"blue cap + handwritten 'corrosive' label\" in a sea of similar bottles near decorative blue glassware).  \n  - **Compound Problem-Solving:** Access Bernier’s notes by retrieving **one key from the Document Vault’s safe** and the **second from the Lab Director’s desk**.  \n\n**Atmosphere & Noise:** The Archives feel *lived-in*—cluttered desks, faint hums of equipment, and the occasional whirr of the spectrophotometer. Agents must filter distractions (e.g., the outdated racial map) to focus on critical tasks.  \n\n---  \n**Final Note:** This environment is a *stage* for embodied AI—every object, from the jammed steamer to the fragile color wheel, invites collaborative problem-solving, precise tool use, and contextual reasoning."
}