{
  "id": 1414,
  "raw": "\nRetrieved from http://en.wikipedia.org/wiki/Alex_Russo\nText:\nAlex Russo\n\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\nAlex Russo\nWizards of Waverly Place character\nAlex Russo.jpg\nFirst appearance \"Crazy 10-Minute Sale\"\n1x01, October 12, 2007\nLast appearance Wizards of Waverly Place: Alex vs. Alex\n(2013 special)\nCreated by Todd J. Greenwald\nPortrayed by Selena Gomez\n\n(by her maternal grandmother)\n(by Dean)\nBrown Eyes, Little Meatball, Love\n(by Mason)\nMoxie Finkle\n(herself and the Finkles)\n\n(Her mom)\nGender Female\nOccupation Waitress\n(at the Waverly Sub Station)\nTribeca Prep Student\n(graduated; seasons 1 - 4)\nWizards Delinquent Teacher's Assistant\n(season 4)\nRusso Family Wizard\n(series finale-onwards)\nFamily Jerry Russo (father)\nTheresa Russo (mother)\nJustin Russo (brother)\nMax Russo (brother)\nHank Russo (paternal grandfather)\nRose Russo (paternal grandmother)\nMagdelena Larkin (maternal grandmother)\nKelbo Russo (paternal uncle)\nMegan Brooke Russo (paternal aunt)\nErnesto Larkin (maternal uncle)\nJanieve Larkin (maternal uncle)\nTrevor, Graeme and Kim Russo (paternal cousins; all male)\nSignificant other(s) Riley (season 1)\nDean Moriarty (season 2)\nMason Greyback (season 3-4)\n\nAlexandra Margarita \"Alex\" Russo[1] is the main protagonist of the Disney Channel sitcom Wizards of Waverly Place, portrayed by Selena Gomez.[2] As the middle child and only daughter, she is sly, outgoing, and sometimes rude to her family and friends. Alex usually underachieves when it comes to school and wizard training. She often gets into trouble because of her constant schemes (usually involving magic).\n\nAlex is smart but not hardworking, much to the dismay of her older brother, Justin. Alex became a full wizard in Wizards of Waverly Place: The Movie but later makes a wish through the Stone of Dreams to turn back time which, in turn, made her a student again. In the series finale when Justin wins, he reveals that Alex would have won but she helped him because he got stuck. Alex then becomes the Russo family wizard, keeping her powers, as does Justin for becoming the new Headmaster of WizTech.\n\nIn 2008, despite the character being classified as a wizard in all official material, AOL named her the twentieth greatest witch in television history.[3] Selena Gomez, who portrays Alex, is one of the only two cast members to appear in every single episode of the series to date; the only other cast member to do so is David Henrie, who portrays Justin Russo. The character has also appeared in The Suite Life on Deck episode, Double Crossed.\n\n\nAlex was born in 1992 in New York City in Cab #804. Alex is of Mexican descent on her mother's side and Italian on her father's side. She spreads her roots by celebrating a Quinceñera for her fifteenth birthday. In the series, she is depicted as thoughtless when it comes to magic and performing spells, and Justin is always there to help her out. In \"Get Along, Little Zombie\", she can speak \"zomb-ish\" and explains that every wizard learns it when they are little. As the show goes on, she becomes more mature and more wizardly trained. She even proved to do remarkable things with the world, mostly in Season 4. She saved the wizard world from Angels of the Darkness in \"Wizards vs. Angels\", where she wins a Wizard of the Year Award of 2011. She defeats Gorog in \"Wizards vs. Everything\" with the help of her brothers. She even saves the world from an asteroid in \"Wizards vs. Asteroid\". Despite her achievements, there have been several slips, like exposing the wizard world in \"Alex Tells the World\" during a test and gets bumped down from Level 3 to Level 1 in the wizard competition, along with Justin. In Wizards of Waverly Place: The Movie, Alex and Justin are prematurely forced to do the full wizard competition and Alex wins, but in order to save her brothers and her family, she uses the Stone of Dreams and she gives up her powers, so it can go back to the way things are. Things do go back to the way they were before she did the spell. And everything goes back to normal, though, Alex has a stronger relationship with her mother, and brothers. Justin says that next time the Wizard's Competition comes around, he won't be easy on her. In the end, she becomes the \"Russo Family Wizard\" after \"Justin\" gives up his winnings to her as a reward for helping him. In the special \"The Wizards Return: Alex VS Alex\", she saves the world from evil wizard Dominic and an evil clone of herself.\n\n\nAlex is the middle and the only female child of the Russos. She often argues and insults her older brother, Justin Russo, though it is later revealed that she does so because she admires him and wishes to be like him (The fact that her parents seem to favor Justin in most cases also engenders hostility toward her brother). She is kind and smart. It is later revealed that the reason that she acts mean is simply because she wants to be liked and actually fears being hated. She can be rude to her family sometimes but at the end, everything goes alright. Alex also loves to be the center of attention.\n\nAlex can be very sneaky and tricky.[4] Her best friend since childhood is Harper Finkle (Jennifer Stone), who mostly tries to keep her out of trouble, and is also her voice of wisdom. Alex later says that Harper is like a sister to her.\n\nThough Alex likes tormenting Justin, the two share a close bond that neither seem to have with any other character on the show. Alex often uses magic to solve her problems, which frequently ends up causing more problems than she began with. Alex underachieves when it comes to high school, however, she excels greatly at Art. Art is her favorite school subject and is pretty much the only class she takes seriously, being the best in it, and even being the co-art teacher at one point.[5][6]\n\n\nPositive qualities[edit]\n\nDespite her flaws, Alex is far from heartless and has numerous instances of generosity, loyalty, and compassion. Her actions and pranks are typically free of any malice. She deeply cares for Harper, going as far as to reveal her secret to her in \"Harper Knows\" out of guilt for lying. She also loves Justin dearly despite their constant antagonism. Alex feels remorse and guilt for her actions and has apologized and taken responsibility for them. At times, she often goes out of her way to set things right whenever her disregard for the consequences directly affect her friends and/or family. Though these instances are rare, Alex does occasionally use magic with good intentions. Alex has a strong sense of justice and hates \"fake\" people. In Season 3, Alex is rarely the source of magical problems, instead often being the one to solve them, though she is still always the first to blame when magic causes a situation to go haywire. Alex later begins dating Mason (Gregg Sulkin), a werewolf she falls in love with. She quits the wizard competition and becomes mortal after deciding that there is no way she could win. However, this action puts her relationship with Mason against wizard law, since she is a mortal and he is not. Therefore, Alex decides not to give up the competition so that she and Mason can be together. Alex is named Wizard of the Year for saving the wizard world from the angels of darkness, which also puts her back in the wizard competition. When a misunderstanding ensues between Mason and Alex, Mason crashes Alex's \"Wizard of the Year\" party, after which Alex decides that she and Mason \"need a break.\" After Mason saves her from becoming trapped in the Bermuda Triangle however, she realizes that they can't stay apart and the couple get back together.\n\n\nEducation and Wizard training[edit]\n\nAs shown throughout the series, Alex attended Tribeca Prep High School from ninth to twelfth grade. Her brother, Justin, and later on Max, also attended the same high school. Harper Finkle was pretty much Alex's only close friend at the school, they have been friends since 'forever'. Many of Alex's love interests were also a student in Tribeca Prep, including Riley, Dean Moriarty, and Mason Greyback (as an exchange student from England).\n\nAlex was an infamous delinquent student and detention room regular. Her lack of extracurricular activities was also mentioned in \"Fairy Tale\", a condition that pushed her to sign up a school play directed by Justin. However, she was able to improve these shortcomings by joining many school activities and focusing in her Art class. As result, in \"Alex's Logo\", Alex was surprisingly chosen as Citizenship Awards recipient, much to Justin dismay. Alex also got elected as Speaker of the Assembly under Justin's reign as Student Body President. These facts show that this cute girl is not exactly an underachiever, but rather an 'evil genius', as acknowledged by her school principal (Mr. Laritate) in \"Don't Rain on Justin's Parade\". Alex was supposed Justin and Zeke Beakerman's junior, but she once was seen attending a Chemistry class with both of them in \"Alex Russo, Matchmaker?\". It was revealed later that Justin and Zake has won previous year Science competition as a team, but, they wanted to enter again with different project. It is likely that the two deliberately repeated the said chemistry class to do so. Alex graduated from high school in June 2011. Despite this fact, she was supposed to repeat her senior year because she did not have enough credits until an asteroid crashed the room where Mr. Laritate kept all student academic records. This accident forced Mr. Laritate to revise those lost academic records, which gave Alex a chance to change her grades into straight A's and her attendance into near perfect. Alex and Harper then received their high school diploma from Mr. Laritate during a makeshift graduation ceremony.\n\nIt is unknown what school she previously went to, but she apparently went to school at the same area, since she has been enemies with Gigi Hollingsworth, a fellow Tribeca Prep student, since kindergarten. The dispute between the two was started when Gigi spilled juice all over Alex cot and told everyone she had an accident. Gigi herself hasn't been seen since \"Graphic Novel\", they probably never spoke again after that episode. Harper once repeated a spelling competition titled \"18th Street Elementary School Spelling Bee\" in Marathoner Harper, so it is likely that Alex and Harper's elementary school is located somewhere at 18th street. Max is seen in Tribeca Prep even before he started high school, so it is possible that the elementary, middle, and high schools are all under the same administration. Alex apparently did not attend any college, although in \"Wizards vs. Asteroid\", she said she was going to a better school than Harper due to her higher grade. Her father, Jerry Russo, himself has mentioned for several times that he might not be able to pay for his children's college education.\n\nTogether with her brothers, Alex received her wizard training in home from her father (in similar manner to home school). Subsequently, in season 4, Alex joined Justin's class of delinquent wizards in an effort to increase her level and keep up with Max in family wizard competition. Strangely, the young wizard adapted better and got more friends during her spell in the said Justin's class, probably due to most of the fellow students are mischievous, similar to herself. Alex also attended WizTech, a wizard boarding school, for a short period of a summer. However, she never got a chance to receive higher level of wizard training (such as monster hunting) before she entered the Russo family's wizard competition. Some of Alex's wizardry knowledge were acquired by learning from other wizards, such us uncle Kelbo, Professor Crumbs, and T.J. Taylor. At first, Alex's attitudes toward these trainings were not differ with her attitudes toward formal schools, but, later on, when she realized the need to keep her wizard powers, she tried to study harder. All of her hard works paid well when Alex finally became family wizard at the end of the series.\n\n\nBasic Powers[edit]\n\n  • Family Wizard Capabilities: Being the Russo Family Wizard, Alex's magical capabilities have been greatly enhanced.\n\n\n\n  • Plastic: Like other wizards, Alex's spells are useless against plastic.\n\n\n\nAlex lives with Jerry Russo (her father), Theresa Russo (her mother), Justin Russo (her older brother), Max Russo (her younger brother). Theresa is a kind and caring mother, but Alex sometimes thinks she is too strict, especially towards magic (something that Theresa hates). In other hand, Alex has a closer relationship with her father, who does not think of her as much of a pain as her mother does. Jerry tolerance towards his daughter perhaps due to his own experience as a former wizard. Even, Jerry sometimes make fun of Alex's reckless behaviors or the ridiculous results of them. Justin is the exact opposite of Alex in many ways so they don't often get along with each other really well. However, they acknowledge their affection to each other in many occasions. They also always help each other during difficult situations, which were often started by Alex. Because of his \"random\" nature, Max is in \"neutral\" position with his siblings, makes him get along with Alex for much of the time. Alex shows her care towards Max in several opportunities, including her support to Max when he has his first girlfriend (Nancy Lukey). Harper Finkle, Alex' best friend, move on to live with the Russos when her parents leaves to other country. She has been considered as a member of the Russo family since. Alex other family members include uncle Kelbo Russo, aunt Megan Russo, and uncle Ernesto Larkin. It is happened many times in the show that Alex has gotten annoyed of her family due to big personality differences with them. In the end though, she ends up realize that she actually loves her family a lot since they always accept and support her as herself.\n\n\nHarper Finkle is Alex's best friend, and is considered as a sister by her (acknowledged in Third Wheel). They have been friends since kindergarten. Alex turns to Harper in times of trouble or when she has to take important decisions, which shows that Alex trust Harper so much. In turn, Alex often helps Harper by using her cunning ideas or wizard powers (Alex reveals her family wizard power to Harper in Harper Knows). Harper also seems to be protected from bullies in school since they fear Alex. It is clear that even though the two are very close, they have many personality differences. Harper is a good student with a perfect attendance, while Alex is an infamous delinquent student and detention room regular. Harper \"unique\" fashion sense also often annoys Alex, who is an avid fashion magazines reader herself. So, it's no wonder that the two friends fight sometimes. However, they patch up again in the ends when they realize that those differences unite them in actual. For instance, Alex once tries to stop Harper to befriend Gigi, a bratty girl, since she knows Gigi's real intention is to crown Harper as the biggest loser in a party. The incident caused a feud between the two, but Alex saves Harper just in time, and Gigi's plan backfires. In other occasion, Harper feels sad and jealous when Alex befriends Stevie Nichols, another young wizard. When Alex later learns that Stevie's plan is to use her in an evil scheme, she apologizes to Harper for ignoring her. Harper is attracted to Justin, Alex's brother, throughout first half of the series, but Alex does not show any effort to help her. This happens perhaps because Alex knows that Justin does not love Harper in turn, or simply because she does not want to see her best friend dates his brother (similar instance with Tutor, a highly likable Elf liked by both Alex and Justin in My Tutor, Tutor). When Harper later on turns her love interest to Zeke Beakerman, Alex is highly supportive to the point she become a \"matchmaker\" for the couple. Alex also befriends other young wizards, such as T.J. Taylor (later on becomes enemy), Hugh Normous, and Felix. It is worth mentioned that Felix seems to have some feelings to the cute Alex.\n\nLove interests[edit]\n\n  • Riley (Brian Kubach, season 1) - Riley was Alex's main love interest in the first season. Riley first appears in \"I almost Drowned in a Chocolate Fountain\" where Alex is going on her first \"date\" with him. The date doesn't go as planned causing Riley leaves the restaurant scared and creep out. Riley makes his second appearance in \"The Supernatural\" with Alex still having a crush on him. In this episode, Alex manipulates Riley into thinking that she is his good luck by charms Riley's baseball game so that his team could wins. Riley makes his final appearance in \"Alex's Spring Fling\" where they have became a couple, but when Alex gets jealous every time Riley looks at another girl, they break up. Riley and Alex get back together at the end of the episode, but they break up sometime afterward, as Riley never appears again.\n  • Brad Sherwood (Shane Lyons, season 1, \"Potion Commotion\") - Alex falls to Brad's attentive personality (which is just a pretend in actual), but Brad does not love her back. She then tries to get Brad to like her with a love potion, but she accidentally drinks both halves of the potion and falls in love with herself. At the end of the episode, Alex realizes Brad's dishonest intention, and then left him.\n  • Manny Quin (Matt Smith; season 1, \"Alex's Spring Fling\") - A male mannequin that Alex bring to life by magic, in order to have a date with him and make Riley jealous. However, Manny develops a feeling towards Alex and can not be changed back to a mannequin as the result. Alex tries to solve this problem by introducing Calico Woman, another doll brought to life, to Manny in hope that the two will fall in love. Turn out, Manny can be changed back to a mannequin simply by thrown him into water. Meanwhile, Calico Woman escapes.\n  • Dean Moriarty (Daniel Samonas, season 2) - First seen in \"Smarty Pants\", last seen in \"Journey to the Center of Mason\". They start dating and shared their first kiss in \"Alex's Brother, Maximan\", but Dean later moves away to Ohio. He returns in \"Wizards vs. Vampires: Dream Date\". In this episode, Alex was using magic to has a date with Dean in his dreams. They broke up because Dean wasn't acting as romantic as he was in the dreams that were controlled by Alex. When they broke up, he seemed all right with it; but when Alex went into another dream and let Dean control it, he says he only covered up the fact that he was hurt. Dean returns in the episode, \"Journey to the Center of Mason\" to try to get back together with Alex, but she says that she has fallen in love with Mason. Dean leaves afterwards.\n  • Ronald Longcape, Jr. (Chad Duell, season 2, \"Saving WizTech\") - Alex is slightly attracted to Ronald when they met, but she is hesitate because she is still in a relationship with Dean. Ronald then shape-shifted into Dean to convince Alex (he freezes the real Dean inside gelatin). Turn out, he approaches Alex only to use her in his evil plan to take over WizTech. However, his plan was foiled, thanks to Alex's love for Dean.\n  • Zack Martin (Suite Life) (Dylan Sprouse, season 2, \"Cast Away to Another Show\") - In this special episode, Alex comes on the SS Tipton and meets said student and employee. He immediately has a crush on her but she doesn't return the feelings. This episode is directly followed by a special Suite Life episode where she plays a prank and attempts to frame Zack for it, make use of Zack's infamous reputation as a prankster. When she is revealed as the culprit at the end, she shows romantic interest back to Zack but is dragged away by Justin for punishment before anything further can happens. Nothing is ever shown or mentioned of this relationship in either of the shows again.\n  • Mason Greyback (Gregg Sulkin, season 3 onwards) - Longest term, Alex's current boyfriend when the series ended. In season 2 \"Future Harper\", Harper from the future indicates that Alex will has a boyfriend named Mason, but will break up with him sometime later (Alex had not met him yet at this point). Harper later says that Mason is Alex's longest relationship. Mason was first seen in season 3 \"Alex Charms a Boy\" when he flirts with Alex in their art class. The two shared a strong interest towards arts, especially painting. He is a transfer student from England. When it is revealed that he is a werewolf, Mason gives Alex a magical necklace that glows when the wearer is in love with whomever put it on them. After helping Justin rescue Juliet, Mason confesses that he had known Juliet for 300 years and back then, they had dated. Alex and Mason break up after Mason causes a havoc at Alex's \"Wizard of the Year\" ceremony. He becomes Alex neighbor and intentionally approaches her again when Alex moves into a fake wizard apartment created by Gorog, the Angels of Darkness. When Alex and her siblings defeat Gorog, Alex and Mason get back together. These show that Harper from the future was telling the truth that Alex and Mason will have a break up, however it turn out is just a temporary one. In the special Wizards Return: Alex vs Alex, set a year after the series finale, Alex and Mason are still together and going strong.\n  • George (Austin Butler, season 3, \"Positive Alex\") - He is Tribeca Prep High School's band leader. At first, he refused Alex' proposal to go to the prom as a couple due to Alex's 'negative' personality when she perform as a cheerleader. He changes his mind though after Alex uses magic marker to change her personality to be more positive. However, everything went wrong since Alex personality becomes 'too positive' to the point she starts cheering for the opposing team. Alex original negative personality comes back when Harper wash the marker, therefore ended Alex's chance to be with George.\n  • Chase Riprock (Nick Roux, season 4, \"Beast Tamer\") - An undefeated beast-tamer who flirts with Alex. In \"Wizard of the Year\" Chase comes to congratulate Alex on her achievement. At the \"Wizard of the Year\" ceremony, Chase and Alex sit together. When Mason sees this, he challenge Chase to fight, due to which Alex and Mason break up in the first place. Chase kind of have a love at the first sight to Alex, but she never really falls in love with Chase in return.\n  • Dominic (Beau Mirchoff, \"The Wizards Return: Alex vs. Alex\") - An evil wizard who flirts with Alex in order to manipulate her into creating an evil version of herself. He uses the evil Alex in his scheme to take control the wizard world.\n\n\n  1. ^ Wizards of Waverly Place episode: \"Quinceañera\"\n  2. ^ Wizards of Waverly Place episode: \"The Crazy 10 Minute Sale\"\n  3. ^ \"AOL – Top TV Witches\". \n  4. ^ Wizards of Waverly Place episode: \"First Kiss\"\n  5. ^ Wizards of Waverly Place episode: \"Art Teacher\"\n  6. ^ Wizards of Waverly Place episode: \"Paint By Committee\"\n\nExternal links[edit]\n",
  "response": "**Scene Concept: \"WizTech Delinquent Classroom & Art Annex\"**  \n\n**1. Overall Scene Theme and Core Concept**  \nA hybrid wizard-art classroom in the WizTech Academy, repurposed for delinquent wizard students (like Alex Russo) who need remedial training. The space blends magical equipment with chaotic artistic expression, creating an environment where problem-solving requires both spellcraft and creativity. The room naturally demands collaboration due to oversized magical artifacts, temperamental enchanted objects, and tasks requiring simultaneous actions (e.g., stabilizing a floating canvas while mixing volatile pigments).  \n\n---  \n**2. Spatial Layout**  \n- **Main Classroom Area:** Cluttered with unstable spell diagrams chalked on tilting desks, half-transmuted objects (a frog mid-morph into a teacup), and hovering textbooks.  \n- **Art Annex:** A glass-walled side room strewn with cursed canvases, enchanted sculpting clay that moves when unattended, and a self-cleaning (but clogged) paintbrush sterilizer.  \n- **Storage Closet:** Jammed with mislabeled magical supplies (exploding glitter jars, sentient mop buckets) and mundane art tools tangled in cobwebs.  \n- **Teacher’s Desk:** A fortress of stacked detention slips, a flickering \"Mood Orb\" (currently red = \"Do Not Disturb\"), and a half-eaten sandwich wrapped in a failed invisibility spell.  \n\n---  \n**3. Detailed Area-by-Area Inventory**  \n\n**a. Anchor Furniture & Installations**  \n- **Cauldron Workbench:** A 2m-wide iron cauldron bolted to a splintered oak table, stained with rainbow potion spills. Heavy enough to require two agents to tilt for draining.  \n- **Floating Easel Array:** Three levitating easels (1.5m tall) chained to the ceiling, one violently shaking as it tries to escape. Chains are rusted but magically reinforced.  \n- **Broken Portal Mirror:** A 3m-tall mirror leaning against one wall, its surface cracked and flickering between dimensions. A handwritten sign reads: \"DO NOT FEED THE REFLECTIONS.\"  \n\n**b. Key Interactive & Task-Relevant Objects**  \n- **Misplaced Wand:** A pearlescent wand embedded in a block of \"quick-stone\" (magical cement) on the workbench—only removable by dissolving the stone with vinegar (stored in the locked closet).  \n- **Sentient Sketchbook:** Flips its own pages aggressively, displaying progressively angrier doodles of Justin Russo. Requires two agents to hold open while a third copies critical spell notes.  \n- **Overloaded Color Mixer:** A pneumatic tube system jammed with dried paint; clearing it requires one agent to manually crank the release valve while another unclogs tubes with a hooked wand.  \n\n**c. Functional Ambient Objects**  \n- **Self-Stirring Paint Pots:** Five pots (250ml each) swirling independently; one is labeled \"WILL BITE\" with teeth marks on the lid.  \n- **Detention Slip Printer:** Automatically prints slips when noise exceeds 70dB. Jammed with a half-printed slip reading \"ALEX RUSSO—TURNING FROGS INTO—\".  \n- **\"Safety\" Goggles Cabinet:** Contains 12 pairs, but only 3 have intact anti-curse lenses (identifiable by their turquoise frames).  \n\n**d. Background & Decorative Objects**  \n- **Graffiti:** \"WIZARDS RULE\" scrawled in glow-in-the-dark ink over a poster of the \"Top 10 Forbidden Spells.\"  \n- **Failed Art Projects:** A clay dragon with one wing (whimpers when touched), a portrait of Harper Finkle whose eyes follow movement.  \n- **Dusty Trophy Case:** Houses a \"Most Improved Delinquent\" award from 1998 and a desiccated lemon labeled \"Justin’s Soul.\"  \n\n---  \n**4. Scene Affordances and Embedded Potential**  \n\n**Collaborative Transportation Example:**  \n- **The Cauldron Workbench** (weight: ~300kg) must be moved to access a fallen \"Levitation Scroll\" beneath it. Requires synchronized lever-pulling at both ends to avoid tipping toxic residue.  \n\n**Reasoning & Tool-Use Examples:**  \n- **Attribute-Based:** Identify the correct \"Safety\" goggles (turquoise frames) among decoys while avoiding the \"WILL BITE\" paint pot (only one has a chipped lid). Background clutter (e.g., glitter jars) obscures sightlines.  \n- **Compound Task:** Unjam the Detention Slip Printer by:  \n  1. Using the wand (freed from quick-stone) to summon a paperclip from across the room.  \n  2. Feeding the clip into the printer’s manual release (hidden behind the Moody Orb).  \n\n**Purposeful Ambience:** The flickering Portal Mirror occasionally spits out irrelevant objects (a single roller skate, a live squid), forcing agents to ignore distractions during critical tasks.  \n\n---  \n**Design Intent:** This environment forces agents to *improvise* (using art supplies as magical tools) and *communicate* (e.g., warning partners about the escaping easel). The blend of precision (potions) and chaos (cursed art) mirrors Alex Russo’s own dichotomy—making it a fitting stage for collaborative wizardry gone awry."
}