{
  "id": 1443,
  "raw": "\nRetrieved from http://torment.wikia.com/wiki/Ignus\nText:\nTorment Wiki\n\n\n96pages on\nthis wiki\nIgnus NPC\nVital statistics\nTitle The Rogue Modron, Nordom\nGender Male\nRace Human\nFaction None. Chaotic Neutral alignment\nHealth Maximum +4 each level. Starts at ? HP\nLevel Level 6\nStatus Mage; Str 13, Int 19, Wis 8, Dex 16, Con 20, Chr 3.[1]. Voice: Charles Adler. One of two companions whose normal attack can be made from a distance, the other being Nordom\nLocation Smoldering Corpse bar\nSee List of Characters and Wikipedia:List of characters in Planescape: Torment#Ignus\nThere is a burning man hovering in the air over a grille in the Smoldering Corpse Bar. His skin bubbles and chars, and flames pour from his tormented eyes, yet his expression is far away, almost as if he were reveling in the flames.\n\nA pyromaniacal mage, Ignus is chaotic neutral (due to his insanity).\n\nIgnus is voiced by Charles Adler)\n\nAs related by Reekwind and others, Ignus once attempted to burn down the Hive, and was only stopped by a collaboration of many local magic users, from minor hedge wizards to mighty sorcerers. Furious at his mad killing spree, they converted him into a living conduit to the Elemental Plane of Fire as an ironic punishment. Such treatment would have instantly incinerated a normal mortal, but Ignus survived and thrived in his fiery condition. Stuck in a semi-coma and reveling in the never-ending flames coursing over his body, he was eventually made into a mascot for the Smoldering Corpse Bar.\n\nIf the Decanter of Endless Water is retrieved from the Drowned Nations, and The Nameless One learns of the word to empower it from Glyve, the spirit possessing the stone face in the Catacombs, and then learns the word from Nemelle in the Clerk's Ward, it is possible to recruit Ignus into the party.\n\nShould the party speak to his lover Drusilla with Ignus nearby in the party, she will then embrace Ignus and become consumed by his flames. Keeping Ignus away from her, she will speak as though he had not been released.\n\nDialogues with Ignus reveal that his original mentor of the magical arts was one of The Nameless One's previous incarnations, allegedly \"one of the last great sorcerers.\" This incarnation was a brutal teacher who believed that suffering is a necessity for learning, and subjected the young Ignus to many torments in order to teach him to master fire. Though he seems to harbor some grudge towards the Nameless One for the pain he inflicted, Ignus still views the immortal as his master in some way. and can be persuaded to teach the Nameless One some of his fire spells . Ignus retains his old master's policy of suffering to learn, however: each teaching requires that Ignus burn part of The Nameless One's body. While The Nameless One will quickly regenerate these body parts, Ignus's power is such that this burning results in permanent hit point loss and added resistance to fire; TNO notes with some dismay that the resulting scarring does not heal as well as that incurred by other burns.\n\nAs the little flesh he has remaining is molten, Ignus is unable to equip or wear any kind of armor or tattoos, making him very vulnerable to brute and raw physical damage. However, his magic spells and attacks are unmatched and he has the unusually high constitution score of 18, allowing him to regenerate lost health, albeit at a slow rate. This is to be expected of a being that could survive his ordeals; naturally, Ignus is also immune to fire attacks and spells.\n\nNear the very end of the game, if the player has acted mostly lawful and/or good throughout the story, The Nameless One will have to battle Ignus in the Fortress of Regrets.\n\nAll characters except Ignus, Vhailor and Nordom have a morale rating, and they will leave the party if it gets too low.\n\nAnimation and voice files Edit\n\nIn addition to unique fighting moves, each character has their own running animation, 'breathing' animation, and intermittent 'fidget' animation.\n\nAll characters have at least one 'selection' response, and at least one 'command confirmation' response. Most have a 'miss' comment, and a 'critical hit' comment. They have an appeal when they are at very low HP, less than 15%, and when they die. And they all have a 'level up' comment.\n\nAfter a period of no activity by the player with mouse or keyboard, characters will randomly speak 'bored' pronouncements. They will occasionally speak dialogue expressing their mood or sentiments, particularly in relation to other companions, or a particular location. And they will engage in conversations with certain of their fellow party members.[2]\n\n  • 'Fidget' animation: Ignus whirls in the air, his arms rising up\n  • 'Bored' pronouncement: \"Ignus will one day kill you.\"\n  • Selection: \"\"What do you wish of Ignus?\", \"Ignus will one day kill you.\", \"Ignus wishes to burrnn.\", \"The flames await.\"\", \"What is thy bidding?\".\n  • Command: \"Yessss.\", \"Burn.\", \"Yes, my master.\"\n  • Critical Miss: \"Kriiik.\". Critical Hit: \"Flame.\"\n  • Appeal: \"The fires grow dim. Soon I shall perish.\" Death: -cries out\n  • Level Up: \"The flames grow within me.\"\n  • Moody: Location: The Hive in the daytime: \"Ignus burns people.\" The Hive at night: \"Too dark. Flame shall light the way.\" Ravel's Maze: \"Plenty to burn here.\"\n  • Interactive dialogue: none\n\nAs a spell caster, Ignus has a spellcasting voice file: \"Unleash hell!\" (a little hard to hear, so who knows, another site has it as Raikashanen!, but there are zero Google hits for that)\n\nCharacters also have 'Inventory full', 'Encumbered, cannot run', 'Encumbered, cannot move', 'Bash success', 'Bash fail', 'Target immune to weapon', a comment when they leave the party, a statement when approached again after they have been removed from the party, and a greeting when they rejoin the party[2]\n\nIgnus has a file that activates if the player attempts to remove his ranged 'flames' weapon: \"Ignus will not part with it.\"\n\nAll characters have files for when the player repeatedly selects them (such as hitting the number keys over and over): \"Where fire once fed, I may send it to feed again.\", \"You are all tallow for my flames.\", \"I shall bless the flames with my touch.\"\n\nThere are many files that were created for the game and never used, files that are in the game engine and were never used, and files that were not implemented at release but have been restored by patches.\n\n\nCitation Edit\n\n  1. NPC List,\n  2. 2.0 2.1 Comprehensive Analysis of Sound Files, Stickied thread started by Qwinn, May 25 2009 12:22 AM, Spellhold Studios\n\nAround Wikia's network\n\nRandom Wiki\n",
  "response": "# **Scene Concept: \"The Alchemist's Sanctum\"**  \n\n## **1. Overall Scene Theme and Core Concept**  \n**Type:** A hidden alchemical laboratory, abandoned after a catastrophic magical experiment.  \n**Core Challenge:** The sanctum is saturated with volatile reagents, arcane traps, and lingering magical anomalies—requiring careful coordination to navigate safely and recover valuable artifacts.  \n\nThe environment is inherently multi-agent due to:  \n- **Hazardous Materials:** Many objects are too dangerous or heavy for a single agent to handle alone.  \n- **Arcane Puzzles:** Mechanisms require simultaneous interaction (e.g., holding a lever while another agent retrieves an item).  \n- **Temporal Instability:** Some areas flicker between states (solid/ethereal), forcing real-time synchronization.  \n\n---\n\n## **2. Spatial Layout and Area Descriptions**  \n**1. The Ruined Atrium (Entry Point)**  \n- A shattered marble archway, scorched walls, and a cracked obsidian floor. A massive iron chandelier (half-melted) dangles precariously.  \n- **Purpose:** The main entry, strewn with debris to slow progress.  \n\n**2. The Alchemical Workshop (Central Hub)**  \n- A U-shaped workbench dominates the room, cluttered with glassware, burners, and arcane inscriptions. A large **iron-bound ledger** lies open, filled with cryptic notes.  \n- **Purpose:** The heart of the lab—agents must decipher notes to proceed safely.  \n\n**3. The Flame-Locked Vault (Restricted Storage)**  \n- A circular chamber with a **magically sealed door** (requires two agents to channel opposing elemental energies simultaneously). Inside, shelves hold **volatile phials** and a **smoldering grimoire**.  \n- **Purpose:** High-risk, high-reward storage—agents must balance retrieval with containment.  \n\n**4. The Collapsed Observatory (Upper Floor)**  \n- A broken spiral staircase leads to a domed room with a cracked telescope. The ceiling is open to the sky, and **floating embers** drift in the air. A **charred wooden desk** holds star charts and a **partially melted astrolabe**.  \n- **Purpose:** Contains celestial navigation tools critical for unlocking deeper secrets.  \n\n**5. The Subterranean Crucible (Lower Level)**  \n- A sunken pit with a **massive arcane forge**, still radiating heat. A **broken automaton** lies nearby, its **molten core** exposed and pulsating.  \n- **Purpose:** The source of the disaster—agents must stabilize or exploit its energy.  \n\n---\n\n## **3. Detailed Area-by-Area Inventory**  \n\n### **A. The Ruined Atrium**  \n**a. Anchor Furniture & Installations:**  \n- A **half-melted iron chandelier** (300kg, hanging by a single chain, swaying slightly).  \n- **Shattered marble pedestals** (each 1.5m tall, toppled, some with faintly glowing runes).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **A cracked obsidian floor panel** (pressure-sensitive; stepping in the wrong sequence triggers a flame jet).  \n- **A charred journal** (partial entries: *\"The binding ritual requires dual incantations…\"*).  \n\n**c. Functional Ambient Objects:**  \n- **Extinguished torch sconces** (can be relit with a flint found elsewhere).  \n- **A dented brass bell** (if rung, causes a distant rumbling).  \n\n**d. Background & Decorative Objects:**  \n- **Faded murals** (depicting alchemical processes, now peeling).  \n- **A skeletal hand** (clutching a broken quill, embedded in the wall).  \n\n---  \n\n### **B. The Alchemical Workshop**  \n**a. Anchor Furniture & Installations:**  \n- **A U-shaped steel workbench** (4m long, bolted to the floor, covered in scorch marks).  \n- **A ceiling-mounted alembic array** (glass tubes, some cracked, dripping unknown liquids).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **The Iron-Bound Ledger** (open to a page describing *\"The Ignition Catalyst\"*—requires cross-referencing with star charts).  \n- **A locked reagent cabinet** (key hidden inside a false-bottomed beaker).  \n- **A still-active burner** (blue flame, keeps a crucible of liquid mercury suspended in a molten state).  \n\n**c. Functional Ambient Objects:**  \n- **A set of precision scales** (missing one counterweight).  \n- **A brass hand-cranked centrifuge** (functional but squeaky).  \n\n**d. Background & Decorative Objects:**  \n- **A dead potted mandrake** (roots withered, mouth frozen in a silent scream).  \n- **A corkboard** (pinned with brittle notes and a singed glove).  \n\n---  \n\n### **C. The Flame-Locked Vault**  \n**a. Anchor Furniture & Installations:**  \n- **A circular adamantine door** (inscribed with fire/water runes; requires two agents to activate opposing symbols at once).  \n- **Reinforced storage shelves** (each shelf has a different elemental ward).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **The Smoldering Grimoire** (bound in dragonhide, emits faint smoke; must be carried with insulated gloves).  \n- **A crystal phial labeled \"Ignus' Essence\"** (glows red-hot but does not burn its container).  \n\n**c. Functional Ambient Objects:**  \n- **A rusted fire suppression orb** (broken—if repaired, could douse flames).  \n- **A set of tongs** (slightly bent, still usable).  \n\n**d. Background & Decorative Objects:**  \n- **A framed portrait of a stern man** (partially burned, eyes scratched out).  \n- **A pile of ash** (in the shape of a small animal).  \n\n---  \n\n## **4. Scene Affordances and Embedded Potential**  \n\n### **Collaborative Transportation Affordances:**  \n- **The Half-Melted Chandelier (300kg, 3m long)** – Requires two agents to stabilize while a third cuts the last chain.  \n- **The Broken Automaton Core (200kg, radiates heat)** – Must be carried with heat-resistant gloves, but the weight necessitates teamwork.  \n\n### **Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:** Among **five phials** on the workshop shelf, only one has:  \n  - A **blue wax seal** (others are red/green).  \n  - A **handwritten \"CORROSIVE\"** label (others are printed).  \n  - A **half-full** volume (others are full/empty).  \n  - *(Distractor: A decorative blue glass paperweight sits nearby.)*  \n\n- **Compound Tool-Use:**  \n  - **Problem:** The Flame-Locked Vault door requires **opposing elemental activation**.  \n  - **Solution:** One agent must channel water (using the **Decanter of Endless Water** from the Observatory), while another channels fire (using **Ignus' Essence phial**).  \n\n### **Dynamic State Changes:**  \n- The **still-active burner** in the workshop can be:  \n  - **Turned off** (causing the mercury to solidify, blocking a hidden compartment).  \n  - **Turned up** (risks igniting nearby papers).  \n  - **Harvested** (if an agent brings a heatproof vial).  \n\n---\n\n### **Final Notes:**  \nThis environment is **dense with interactive potential**—every object has properties that can be leveraged, misused, or combined. The **multi-agent necessity** is baked into heavy objects, simultaneous puzzles, and hazardous materials. Agents must **communicate, prioritize, and adapt** to succeed.  \n\nWould you like any refinements or additional layers of detail?"
}