{
  "id": 1473,
  "raw": "\nRetrieved from http://www.mumsnet.com/Talk/relationships/1972715-My-partners-ex-is-destroying-me\nText:\n\n\nMy partner's ex is destroying me\n\n(115 Posts)\nHarrassedandstalked Mon 20-Jan-14 13:00:14\n\nI'll try to make this as brief as I can. My partners ex is ruining my life. We have been together a year now and I've had constant harrassment from her. She just won't leave us alone. She believes that we started our relationship when they were still together. We did not. She has hacked his Fb, damaged our property, threatened me with violence, called child services on me, tried to lose him his job. She goes quiet for a while and then starts it all again. I suffer with anxiety and depression which was controlled until all of this, I can't even think straight anymore. I've tried to finish things with my partner because of her. She has a personality disorder but also has serious physical health problems which is why my partner won't report her to the police as he feels sorry for her. I'm at my wits end. She has made me ill to the point I started having seizures caused by stress. Has anyone been through this and what can I do?\n\nFunkyBoldRibena Mon 20-Jan-14 13:01:16\n\nEnd it? The relationship I mean. It's not doing you any good is it?\n\nDahlen Mon 20-Jan-14 13:02:50\n\nEnd the relationship. Until your partner realises he has to stand up to his X, you will never be free of this woman.\n\nAnyFucker Mon 20-Jan-14 13:03:52\n\nI think your problem is your partner, I am sorry to say\n\nhe is unwilling or unable to take the steps required to protect you, so really your relationship is game over\n\nHollaAtMeBaby Mon 20-Jan-14 13:13:57\n\nIf she's harassing you, you can report her to the police. Your partner doesn't need to do it.\n\nCogitoErgoSometimes Mon 20-Jan-14 13:15:36\n\nWhy are you dependent on your partner to call the police? You're being threatened, not just him. If he prioritises her over you then don't stick around for more punishment. Leave him to her.\n\nHarrassedandstalked Mon 20-Jan-14 13:17:20\n\nYou are right AF, I have, at times, risen to it and asked her to back off..twice in a year, but dp rises to it, loses his temper and phones her every time she does this which really, is just giving her the attention she craves. He's stuck I understand, he doesn't want to tell me when she has been in touch because he knows it will stress me, but I always find out anyway. When he comes in from work in a temper, I guess she's been in touch again and then I always find out. He changed his number twice, she still found it, she emails him, messages him on Fb, turns up at his mum's house, his daughter's house, his friends....she just won't give up.\n\nTonandfeather Mon 20-Jan-14 13:20:34\n\nIs this the ex that your partner stayed with for a week over Xmas, with their children? Who you didn't see for that whole time?\n\nIf she threatened you with violence and damaged your property, why didn't YOU go to the police?\n\nIf you're the same poster as the one on last week's postings, the problem is that your partner isn't being honest with you and still has strong feelings for his ex.\n\nHarrassedandstalked Mon 20-Jan-14 13:20:48\n\nI can report her, but really I don't have any proof of what she has done to me, just him. She has admitted it was her but I don't have any evidence really apart from Fb messages...would the police even take that seriously?\n\nmsrisotto Mon 20-Jan-14 13:21:26\n\nIf it's making you ill, leave! There are other men out there and if this one isn't being proactive in solving this issue then walk. He is letting you be bullied, how horrible is that?\n\nHarrassedandstalked Mon 20-Jan-14 13:22:47\n\nNo that's not me ton, I've been a member on here for ten years but haven't posted for a year probably, maybe longer.\n\nISeeYouShiverWithAntici Mon 20-Jan-14 13:26:26\n\nI would walk away from him, tbh. I don't think a bloke, any bloke, is worth the hell you are living.\n\nMaybe if he loses someone he claims to love, because of her, he will do what is necessary to stop her, instead of protecting her at the expense of the well being of the person he claims to love.\n\nCogitoErgoSometimes Mon 20-Jan-14 13:26:38\n\nThere's nothing to stop you calling the police 101 non-emergency number, describing the problem and asking what they would advise going forward. Stalking & harassment is taken pretty seriously. I would expect them to say that you should keep careful records of incidents that you either know or suspect she is involved in. They may even send round a community support officer for a chat.\n\nateddybearfromdelaware1 Mon 20-Jan-14 13:28:49\n\nYou can report her for harassment. You should have a long time ago. I reported someone once and the police were great. Went to his house and gave him a sharp warning, and told me if he did one more thing to call 999. it stopped.\n\nTonandfeather Mon 20-Jan-14 13:30:36\n\nCan you clarify then?\n\nHow would FB messages confirm she reported you to Child Services?\n\nAre you saying that all the other threats and reports of damage to your property have come via your own partner?\n\nIf the only evidential source for her behaviour is your partner's say-so, then yes the police might look at his claims more closely...\n\nHarrassedandstalked Mon 20-Jan-14 13:31:16\n\nI'm scared of the consequences too if I'm honest, she comes from a pretty nasty well known family, has been arrested so many times for assault, and she knows a lot of people. I'm the kind of person, I like a peaceful life with my handful of good friends. She scares the living crap out of me.\n\nCogitoErgoSometimes Mon 20-Jan-14 13:33:53\n\nThe police exist to deal with scary people on our behalf. It's their job to round up violent types so we don't have to put up with their crap.. You're already suffering consequences whilst nothing is happening to her. So what if she knows lots of people?\n\nTonandfeather Mon 20-Jan-14 13:34:10\n\nForget the gossip and rumour machine.\n\nWhat can you actually prove she's done or said, yourself?\n\nHarrassedandstalked Mon 20-Jan-14 13:34:44\n\nIt's definitely her ton, I don't have an enemy in the world, I generally keep myself to myself. There was some stirring between families at the time....I don't want to go into too much detail on here. smile\n\nBillyBanter Mon 20-Jan-14 13:34:46\n\nYou have a right not to be stalked harassed etc.\n\nSplitting with your partner is a very real option even with a lot of sympathy for his situation. It's also a real possibility if you 'push the issue' by reporting when he doesn't want to do that.\n\nAlternatively there may be ways to bring him round to a position where he will stand up to her more and be more willing to report/make her take responsibility for her actions. Men, as with women, struggle to make a stand against partners or exes who abuse/harass them.\n\nAngelaDaviesHair Mon 20-Jan-14 13:35:43\n\nYour options are:\n\n1) Put up with the status quo;\n\n2) Report her to police with as much evidence as you can pull together and stick to your guns whatever she and her family do;\n\n3) Leave your partner and get yourself and your child(ren) as far away from this awful situation as possible.\n\nIt's very hard but I don't see that there are any other choices, so you have to pick one of these. In your position, I suspect I would have picked option 3 a long time ago.\n\nToniViolin Mon 20-Jan-14 13:36:11\n\nStart logging it all.\n\nI'm not convinced your DP is doing everything he can to stop this. If he loves you then he should be doing everything he can to protect you from her harassment.\n\nMy ex did some of this stuff, I changed numbers, passwords, privacy settings on FB so that strangers couldn't send messages, there are things that he can be doing.\n\nI suspect that he, consciously or not, does not want to give up the attention, from her.\n\nHarrassedandstalked Mon 20-Jan-14 13:36:37\n\nAnd that's the point also, she's admitted it via phone calls, but I can't prove that.\n\nBillyBanter Mon 20-Jan-14 13:39:12\n\nfb messages are evidence.\n\nHarrassedandstalked Mon 20-Jan-14 13:42:03\n\nI think in a way he does like the attention, he's very insecure, but he doesn't seem to realise what a serious impact this is making on my life. I'm a nervous wreck. It's no game to me. His children are adults, mine aren't. Ss are my worst nightmare and now it's constantly stuck in my mind that she will call them again. I know I've nothing to hide, but still, I worry about it all the time.\n\nJoin the discussion\n\nJoin the discussion\n\n\nRegister now\n",
  "response": "### **Scene Concept: \"The Digital Forensics & Personal Security Workshop\"**  \n\n#### **1. Overall Scene Theme and Core Concept**  \nA high-stakes **digital forensics lab** doubling as a personal security workshop, where a team collaborates to piece together evidence of cyberstalking, harassment, and property damage. The scene is inherently multi-agent due to:  \n- **Specialized roles** (digital analyst, physical security consultant, legal advisor).  \n- **Heavy/awkward objects** requiring teamwork (server racks, evidence lockers).  \n- **Time-sensitive tasks** (tracking an active threat, securing vulnerable data).  \n\nThe lab is part of a private investigative firm hired by victims of persistent harassment. The team must analyze digital breadcrumbs, secure compromised devices, and prepare legal documentation—all while ensuring no evidence is mishandled.  \n\n---\n\n### **2. Spatial Layout & Area Descriptions**  \nThe lab is a repurposed industrial loft with three distinct zones:  \n\n1. **Digital Forensics Station** – The nerve center, with multiple workstations analyzing hacked accounts, IP logs, and social media threats.  \n2. **Evidence Storage & Physical Security** – A reinforced closet with tagged devices (burner phones, damaged laptops) and anti-tamper measures.  \n3. **Legal Prep & Client Meeting Area** – A quieter space with printers, document scanners, and a whiteboard mapping legal strategies.  \n\n**Connective Tissue:**  \n- Exposed wiring snaking along steel beams (some loose, posing a tripping hazard).  \n- A **heavy rolling server rack** partially blocking a fire exit (requires two people to move).  \n- A **malfunctioning biometric lock** on the evidence closet (sometimes accepts fingerprints, sometimes doesn’t).  \n\n---\n\n### **3. Detailed Area-by-Area Inventory**  \n\n#### **A. Digital Forensics Station**  \n**a. Anchor Furniture & Installations:**  \n- A **12U server rack** (150kg, 1.8m tall) humming loudly, housing a **network tap** monitoring inbound attacks.  \n- Three **ergonomic workstations**, each with:  \n  - A **forensic write-blocker** (blue, labeled \"Chain of Custody #4B\").  \n  - A **24-inch NEC MultiSync monitor** (one flickering intermittently).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Victim’s Compromised Laptop\"** (lid dented, running a memory dump via **FTK Imager**).  \n- **A USB drive** (red, labeled \"EXHIBIT 12 – FB MSGS 01/14\") plugged into Workstation 2.  \n- **IP log printouts** strewn across the desk, one with a coffee ring obscuring a critical address.  \n\n**c. Functional Ambient Objects:**  \n- A **label printer** (out of tape, jammed with a half-printed \"EVIDENCE\" sticker).  \n- A **KVM switch** (set to the wrong input; Workstation 3 displays static).  \n- A **SentrySafe fireproof document bag** (unlocked, contents: blank affidavit forms).  \n\n**d. Background & Decorative Objects:**  \n- A **peeling \"DATA LOSS = CASE LOSS\" poster** from 2012.  \n- A **dead ficus plant** in the corner (soil spilled on a power strip).  \n- A **\"World’s Best Detective\" mug** (cracked, holding USB adapters).  \n\n---\n\n#### **B. Evidence Storage & Physical Security**  \n**a. Anchor Furniture & Installations:**  \n- A **Gunnebo double-door evidence locker** (500kg, requires two keys + biometric scan).  \n- A **wheeled anti-static mat** (partially crumpled, exposing grounded metal beneath).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Exhibit 8\" – A smashed iPhone 7** (in a static-proof bag, sealed with red evidence tape).  \n- **A crowbar** (rusted, leaning against the locker—possible tool or tampering risk).  \n- **A ZTE burner phone** (powered on, receiving texts from \"UNKNOWN\").  \n\n**c. Functional Ambient Objects:**  \n- A **broken barcode scanner** (error light blinking, cord tangled in a drawer).  \n- A **handheld UV light** (batteries depleted, in a drawer labeled \"TAMPER CHECKS\").  \n- **Rubber gloves** (one pair torn, another unopened).  \n\n**d. Background & Decorative Objects:**  \n- A **dusty \"Fingerprint Analysis\" manual** (1998 edition).  \n- **Chalk outlines** on the floor where a printer once stood.  \n- A **half-eaten granola bar** (abandoned on a shelf).  \n\n---\n\n#### **C. Legal Prep & Client Meeting Area**  \n**a. Anchor Furniture & Installations:**  \n- A **6-seat oak conference table** (one leg shorter, wobbles).  \n- A **wall-mounted whiteboard** (80% erased, remnants of a harassment timeline).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **A notarized restraining order draft** (missing the victim’s signature).  \n- **A landline phone** (off-hook, faint dial tone—did someone forget to hang up?).  \n- **A case file labeled \"H&S – PRIOR INCIDENTS\"** (pages out of order).  \n\n**c. Functional Ambient Objects:**  \n- A **paper shredder** (jam light on; stuck with a crumpled Post-it).  \n- A **voicemail recorder** (tape full, unlabeled).  \n- A **laminator** (unplugged, warm to the touch).  \n\n**d. Background & Decorative Objects:**  \n- **Framed legal degrees** (one hanging crookedly).  \n- A **stale pot of coffee** (burnt smell, half-inch left).  \n- **Stress ball** (imprinted with \"DON’T PANIC\").  \n\n---\n\n### **4. Scene Affordances & Embedded Potential**  \n\n#### **Collaborative Transportation Affordances:**  \n- The **12U server rack** (150kg, 1.8m tall) blocks a fire exit—requires two agents to maneuver.  \n- The **Gunnebo evidence locker** (500kg) cannot be opened alone: one agent holds the key while another verifies biometrics.  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:** Among five USB drives, only **\"EXHIBIT 12\"** has:  \n  - A red casing.  \n  - A handwritten label with a specific date.  \n  - A small scratch near the connector.  \n  (*Distractor:* Nearby, a **decoy red USB** holds unrelated cat videos.)  \n- **Compound (Tool-Use) Reasoning:**  \n  - *Problem:* The biometric lock intermittently fails.  \n  - *Solution:* The **UV light** (once batteries are replaced) reveals latent fingerprints on the scanner.  \n  - *Tool Location:* The UV light is buried in a drawer under the broken barcode scanner.  \n\n#### **Dynamic State Complexity:**  \n- The **flickering monitor** may indicate a failing GPU—or a power fluctuation from the exposed wiring.  \n- The **off-hook landline** could be a bug (requiring a sweep) or an agent’s oversight.  \n\n---  \n\n### **Final Notes:**  \nThis environment is **dense with problems waiting to be solved**, from digital triage to physical security. The interplay of **states** (broken/full/offline), **tools** (UV light, label printer), and **red herrings** (decoy USB, dead plant) creates a rich sandbox for multi-agent collaboration. Every object serves either **a direct task purpose** or **authentic background noise**, ensuring realism and depth.  \n\nWould you like additional refinements (e.g., adding auditory/olfactory details)?"
}