{
  "id": 1470,
  "raw": "\nRetrieved from http://www.jsonline.com/news/milwaukee/running-rebels-show-value-of-keeping-youths-out-of-jail-m58ucep-193348861.html?page=1\nText:\nalready a subscriber? Register me\nSubscribe now See my options\n\nRunning Rebels shows value of keeping youths out of jail\n\nBilly Spencer dumps jail uniforms and crime scene tape into a Dumpster on Tuesday as the Running Rebels say the city doesn’t need them when the program keeps youths out of jail.\n\nMike De Sisti\n\n\nMilwaukee's Running Rebels says it has helped keep nearly 900 young people out of prison since 1998 who otherwise might have collectively served hundreds of thousands of days in state corrections facilities at taxpayer expense. »Read Full Article\n\n© 2014, Journal Sentinel Inc. All rights reserved.\n\n  • We reserve the right to close commenting on specific stories.\n\nDiscussion guidelines | Privacy policy | Terms of use\n\nLimit of 2000 characters, 2000 characters remaining\n\nSort by\nComment threads per page: 10 | 20 | 50\n  1. I expect Sheriff Clarke to issue an insulting press release in 5...4...3...\n    Hide replies\n  2. How about educating people where these guys grow up about birth control and not depending on government programs for their existence. Teach them about the value of education, one in four young black male dropouts incarcerated or otherwise institutionalized on an average day. The dropout rate is driving the nation’s increasing prison population, and it’s a drag on America’s economic competitiveness. the statistics were worse for young African-American dropouts, whose unemployment rate last year was 69 percent, compared with 54 percent for whites and 47 percent for Hispanics. There is so much work that needs to be done to help people in urban areas become more productive citizens, where do you start, where are the leaders in the African American areas, stepping up.\n    Hide replies\n    • You cannot help them, its virtually impossible since the culture is morally bankrupt. These programs might help a few but you can count them on one hand. People that could make a difference do nothing, and many profit from the ongoing madness. Michelle believes a weight problems trump bullets. So, how do you fix 'stupid?'\n    • Sorry, only enough funds to teach reading, writing, and artihmetic. Schools teach to the standardized tests (WKCE, etc.) because schools don't want to perform poorly on these tests, or they will get trashed by the state. Teachers know there is a need for these basic skills that students didn't learn at home; but, unfortunately, teachers have to teach to the standardized tests or risk losing their jobs because that is how teachers are evaluated these days.\n    • Actually, MPS and other systems have been found to intentionally sabotage schools for the money, both when the school crashes, and when it is \"revived.\" I believe Custer High was one of the prize examples. \"Educator\" Kathy Bonds...the former principal coincidentally married to School Board President Michael Bonds, was the Board's \"Chainsaw Principal\". Check it out in past issues of this daily.\n  3. In a jail cell everything is provided from food, to clean sheets, to meds, to doctors appointments and housing. That is the first step to teaching them entitlements are easier. Convicts don't have to go in the snow to clean off the transport van, walk across ice in the parking lot to get to work or worry about remembering to buy groceries.\n\n    Abele is correct. Programs like this need to expand.\n  4. Let me see if I have this straight: The guy who pulled the armed robbery is now a teacher's aide.\n    Hide replies\n  5. This would be the equivalent of having a similar group, 'the runnin' rebels' in the segregated South. The group urges business owners to take down the segregationist signs and treat all races as you would treat yourself. Now, you might have some small successes; maybe a small bed and breakfast begins to accept all races, but you still have an overwhelmingly racist culture.\n\n    The result is similar in any culture that has chosen to be anti-society and morally bankrupt. Its a little different in today's society since very very few were murdered in the South, today, there are many thousands murdered, and millions violently assaulted in a culture that has no moral compass and absolutely no resolve to change.\n\n    It took the movement of non-violence and MLK to shame a society into living up to its promise, to live up to its highest ideals. Since the death of King it has only been about tearing society down. There is the incredible arrogance that embodies the race hustlers, they believe in a morally superior position (the delusion is massive) and in their self-righteous sanctimony only tear society down. They hold the majority society to God-like righteousness but hold their own race to absolutely nothing; less than nothing since pure rottenness can be leveraged and extorted in incredibly immoral ways.\n  6. Replace Milwaukee WRAP program, and Milwaukee Juvenile Supervision with the Running Rebels. This organization is top provides support, guidance, and helps these individuals mature all while incorporating accountability into the program. They are an excellent resource .......\n  7. Our young people need to realize they also fuel political division and the rise of the 1% through crime. Lets build more prisons lobby gets rich while our young people are doing life. You are building houses and buying cars for them with all this crime. $1000 an hour lawyers feeding you bologna in those cells.\n\n    Build your dream. Teach Educate Advocate.\n  8. Good job guys\n  9. at $100k per inmate, I think they are living way to good. No clean sheets, one meal of bread and water, lower the heat and take out the air conditioning and make them work in the a chain gang environment and then maybe, some of the less dumb ones will get it....\n  10. Great group! thank you for services!!!\nNewsWatch Delivered\n\nE-mail Newsletter\n\n\nGet the Newsletter!\n\nLogin or Register to manage all your newsletter preferences.\n\n\n\n\nMan shot at Fitchburg gas station 9:10 a.m.\n\nKimberly police investigate death of toddler 9:08 a.m.\n\n\n\nSony says online PlayStation disrupted Yesterday\n10:51 p.m.\n\n\n\n\n\nMadison squad car strikes Arby's restaurant building 6:50 p.m.\n\n\nWisconsin bills would target foreign adoptions 5:08 p.m.\n\n\n\n\n\n\n\nFirm recalls caramel apples amid listeria fears 9:48 a.m.\n\n\n\n\nMilwaukee’s best new restaurants of 2014 6:00 a.m.\n",
  "response": "### **Overall Scene Theme and Core Concept**  \n**Scene Type:** *Community Youth Outreach Center – “The Running Rebels Hub”*  \n**Core Concept:** A repurposed warehouse turned into a vibrant, resource-packed community center aimed at diverting at-risk youth from the criminal justice system. The space is divided into functional zones supporting mentorship, vocational training, and recreational activities, inherently requiring teamwork for operations.  \n\n**Why Multi-Agent Collaboration?**  \n- **Heavy/Unwieldy Objects:** Donated furniture, gym equipment, and supply crates demand coordinated lifting.  \n- **Distributed Resources:** Tools, materials, and documents are intentionally scattered to encourage communication and shared problem-solving.  \n- **Dynamic States:** Broken equipment, locked storage, and time-sensitive tasks (e.g., preparing for a workshop) create natural collaboration triggers.  \n\n---\n\n### **Spatial Layout and Area Descriptions**  \n1. **Main Workshop Area** – Open-plan space with workbenches, tool racks, and project displays.  \n2. **Classroom/Study Nook** – Whiteboards, textbooks, and scattered tutoring materials.  \n3. **Storage/Donation Closet** – Crowded with labeled boxes, old uniforms, and disorganized supplies.  \n4. **Recreation Zone** – Ping-pong table, weight bench, and a malfunctioning vending machine.  \n5. **Mentor’s Office** – Cluttered desk, locked filing cabinet, and a wall calendar with urgent deadlines.  \n6. **Outdoor Back Lot** – Dumpster (partially filled with discarded jail uniforms), broken basketball hoop.  \n\n---\n\n### **Detailed Area-by-Area Inventory**  \n\n#### **1. Main Workshop Area**  \n**a. Anchor Furniture & Installations:**  \n- Two 3m-long worktables (steel frames, scratched plywood tops).  \n- Floor-standing drill press (120kg, unplugged, chuck key missing).  \n- Pegboard wall with outlined tool silhouettes (30% empty).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- *\"Project Phoenix\"* bike frame (partially sanded, tagged with \"Needs Paint—Priority\").  \n- Cordless angle grinder (battery depleted, charger in Classroom).  \n- Red toolbox (locked, combination written on a sticky note inside Mentor’s Office).  \n\n**c. Functional Ambient Objects:**  \n- Stack of sandpaper sheets (grit grades 60–220 mixed).  \n- Kettle grill (repurposed as a solder station, soot-stained).  \n- Functional but squeaky rolling chair (one missing caster).  \n\n**d. Background & Decorative Objects:**  \n- Faded \"Safety First!\" poster (corners peeling).  \n- Coffee-stained blueprint for a treehouse (dated 2 years ago).  \n- Graffiti-style mural of a phoenix (partially painted over).  \n\n---\n\n#### **2. Storage/Donation Closet**  \n**a. Anchor Furniture & Installations:**  \n- Overloaded shelving unit (partially warped, warning note: \"Max Load 200lbs\").  \n- Industrial laundry bin (wheels stuck, contains 50kg of discarded jail uniforms).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- Seized sewing machine (jammed bobbin, repair manual under a pile of fabric).  \n- Box of leather scraps (labeled \"SHOE REPAIR—DO NOT DISCARD\").  \n\n**c. Functional Ambient Objects:**  \n- Broken lamp (usable if rewired).  \n- Half-empty detergent jug (leaking slightly).  \n\n**d. Background & Decorative Objects:**  \n- Dusty trophy (\"Community Spirit Award 2010\").  \n- Water-damaged *\"How to Win Friends and Influence People\"* book.  \n\n---\n\n### **Scene Affordances and Embedded Potential**  \n\n#### **Collaborative Transportation Affordances:**  \n- **Drill Press (120kg):** Requires 3+ agents to move safely around obstacles (e.g., the wobbly rolling chair).  \n- **Laundry Bin (50kg, stuck wheels):** Needs one agent to lift while another pries wheels loose with a crowbar (stored near the dumpster).  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:**  \n  - *Identify the correct wrench:* Among 5 near-identical wrenches in the workshop, only one has a blue grip and \"PROPERTY OF LUIS\" engraved.  \n  - *Distractor:* A blue-handled screwdriver in the same drawer increases misidentification risk.  \n- **Compound Reasoning:**  \n  - *Problem:* Locked toolbox (combo note hidden under a coffee mug in Mentor’s Office).  \n  - *Solution:* Retrieve note, but the mug is filled with pens (must empty it first).  \n\n#### **Atmospheric \"Noise\" for Realism:**  \n- A radio plays static-filled hip-hop (volume knob is finicky).  \n- Flickering fluorescent light in the hallway (ballast needs replacement).  \n\n---\n\n### **Conclusion**  \nThis scene is a *collaborative playground*: Heavy objects demand teamwork, layered puzzles require information-sharing, and ambient chaos mimics real-world distractions. Agents must navigate physical, logical, and social challenges—just like the real Running Rebels.  \n\n**Final Touch:** The dumpster outside, filled with jail uniforms, is a silent reminder of the center’s mission—*every object here is a tool for transformation*."
}