{
  "id": 1472,
  "raw": "\nRetrieved from http://www.mcall.com/entertainment/arts/mc-musikfest-saurus-close-act-theatre-20140806-story.html\nText:\n\nEntertainment Arts\n\nDinosaurs to roam this weekend at Musikfest\n\nPeople who arrive at Musikfest's Festplatz about 4 p.m. Aug. 8 might assume they took a wrong turn somewhere and landed in Jurassic Park.\n\nThree 18-foot-tall \"dinosaurs\" will roam the festival as part of a performance called \"Saurus\" by the Dutch street theater group Close Act. The troupe has taken their dinosaurs to festivals around the world but it will be the first time the sauruses will perform in the United States.\n\nInside each of the huge costumes is a person on stilts. The performers walk through crowds, using the movements of their bodies to make the sauruses' head and tail move.\n\nPatrick Brogan, senior vice president for programming for ArtsQuest, caught their walkabout when he was scouting for acts at at Buskerfest in Toronto last year.\n\n\"'Saurus' was one that the festival director up there said, 'You have to see this,'\" Brogan says. \"The moment these creatures walked onto the street I thought Musikfest audiences would really enjoy this type of performance.\"\n\n\"It's really something when you are standing there watching them and they're coming your way, it's almost intimidating, it's quite striking,\" he says.\n\nPerfecting the walking and body movements in the heavy costume takes time, says Hesther Melief, co-artistic director of Close Act.\n\n\"You must be a very good stilt walker and you must have no fear because you go through the audience and you don't see a lot because you have this textile in front of your face,\" Melief says in an interview by Skype from her home in the Netherlands.\n\nClose Act has 12 sauruses and will bring three to Musikfest. Most of the performers are trained dancers, she says.\n\n\"Dancers mostly have a natural way of moving, they are aware of themselves and their environment,\" she says. \"We work also with some actors. Actors are difficult people. They want to have the main role.\"\n\nAt Musikfest, the sauruses will be walking around \"nibbling\" at the trees and other plants and interacting with the audience.\n\n\"I think it impresses people,\" Melief says. \"We like to give people their emotions if they see something strange or different than what they see normally. Their interpretation is their own.\"\n\nThe creatures look quite a bit like dinosaurs called velociraptors, which had starring roles in the 1993 movie \"Jurassic Park.\" A sound system inside the saurus costume makes a kind of screeching seagull-like sound as they lumber about.\n\nThey are realistic enough to scare some children among the spectators, Melief says. \"Sometimes the kids are afraid and then they come to us afterwards.\"\n\nAs the father of three young children, Brogan says he could envision how his kids would react to the sight of the huge lumbering beasts.\n\n\"I think my 6-year-old is going to be entirely fascinated by them and enthralled, and I think my 2-year-old is going to be rather frightened and want nothing to do with them,\" he says. \"Over time even the youngest minds realize they are quite harmless and quite beautiful.\"\n\nThe first sauruses were made for Close Act by costume designers but now the group makes its own. Melief says the materials inside the costume are secret but the outside \"skin\" is made from textiles. The costumes are heavy and the shows are quite a workout for the performers.\n\n\"It's better to perform 'Saurus' than to go to the gym,\" she says.\n\nBut it can also be risky for the person inside the saurus because they have limited vision and can't always see what is on the ground before them.\n\n\"We call that part of the costume a burka,\" Melief says. \"It can be dangerous, especially with this act because they walk into a crowd of people and they don't see very much.\"\n\nBrogan says he will shepherd the sauruses at Musikfest. Spectators can watch the performers get into and out of their saurus costumes at the beginning and end of the walkabout.\n\nClose Act's street theater relies more on actions than language, which gives the group cross-cultural appeal. The troupe has performed in Europe, Australia, Canada, South America and Mexico. They have done shows in the U.S. before, but not 'Saurus,'\" Melief says.\n\nThey do performances that require sets, including one called \"Glob,\" which involves a metal frame in the shape of a planet. Elaborately costumed actors and acrobats, including the children's book character Pippi Longstocking, tell a story mostly through actions and music but they also speak a language they made up.\n\nThey've also done \"walkabouts\" as aliens and insects.\n\nMelief started performing as a solo artist decades ago and began Close Act in 1991. The street theater troupe has grown to about 50 performers and technicians.\n\nAsked about their mission, Melief says it's really about keeping imagination alive.\n\n\"The ideas and the dreams of children are very strong and we have to keep them,\" she says. \"Actually the message is, if you believe in something, you can work it out, you can do it.\"\n\nBringing the performers to the U.S. and paying their expenses and performance fee was \"quite an economic investment,\" says Brogan, who declined to say how much it cost.\n\nIf the sauruses prove as popular in Bethlehem as they were in Toronto, this could be a long-term investment.\n\n\"They've had them several years in a row now [in Toronto] and they took a year off one year and the festival director said the audiences were not happy, they demanded them back,\" Brogan says.\n\nMargie Peterson is a freelance writer.\n\nJodi Duckett, editor\n\n\n\nWhat: Three 18-foot-tall \"dinosaurs\" roam a section of Musikfest as part of the Dutch street theater troupe Close Act's performance known as \"Saurus.\"\n\nWhere: An area between Festplatz and Plaza Tropical at Main and Spring streets, Bethlehem\n\nWhen: 30-minute performances Aug. 8-10, at 4, 6 and 8 p.m.\n\n\nCopyright © 2014, The Morning Call\n",
  "response": "# **Scene Concept: \"Dinosaur Street Theater Backstage & Performance Zone\"**  \n\n## **1. Overall Scene Theme and Core Concept**  \nA bustling backstage and performance area for a traveling dinosaur street theater troupe (inspired by \"Close Act\"). The scene blends the controlled chaos of a live performance with the logistical challenges of managing massive, intricate dinosaur costumes. The environment is inherently multi-agent due to:  \n- **Heavy, unwieldy costumes** requiring coordinated lifting and maneuvering.  \n- **Precision timing** between performers, technicians, and safety crew.  \n- **Audience interaction zones** where performers must navigate crowds safely.  \n\n## **2. Spatial Layout and Area Descriptions**  \nThe scene consists of four interconnected zones:  \n\n1. **Costume Maintenance Bay** – A workshop where dinosaur suits are repaired, adjusted, and stored.  \n2. **Performer Prep Area** – A mix of lockers, stretching mats, and stilt-adjustment benches.  \n3. **Performance Transition Zone** – The threshold between backstage and the public space, with safety barriers and crowd control.  \n4. **Audience Interaction Plaza** – The open-air performance area with props (fake trees, \"prey\" objects), sound equipment, and safety spotters.  \n\n## **3. Detailed Area-by-Area Inventory**  \n\n### **A. Costume Maintenance Bay**  \n**a. Anchor Furniture & Installations:**  \n- A **heavy-duty aluminum costume rack** (3m tall, max load 300kg) with hanging hooks for three dinosaur suits.  \n- A **repair workbench** (2m x 1m) with clamps, sewing machine, and scattered fabric patches.  \n- A **wheeled hydraulic lift** (for hoisting suits onto performers).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Dinosaur Suit #1 (Velociraptor-themed)**  \n  - Weight: 42kg  \n  - State: **Tail joint loose** (needs rivet tightening)  \n  - Contains internal **sound module** (batteries low)  \n  - **Vision slit** partially obstructed by frayed fabric  \n- **Toolbox (Locked, combination: 18-24-06)**  \n  - Contains rivet gun, spare stilts, and a **spare sound chip** (labeled \"RAPTOR_SCREECH_2\")  \n- **Emergency Repair Manual** (dog-eared, sticky note on page 12: *\"Tail hydraulics fix – see blue wire!\"*)  \n\n**c. Functional Ambient Objects:**  \n- **Industrial fan** (oscillating, speed 3/5)  \n- **Rolling parts cart** (half-filled with screws, washers, and rubber gaskets)  \n- **Wall-mounted first-aid kit** (partially depleted, missing bandages)  \n\n**d. Background & Decorative Objects:**  \n- **Graffiti on the walls** (sketches of dinosaur designs, one reads *\"FASTER STILTS??\"*)  \n- **Coffee-stained blueprint** (showing suit hydraulics) pinned under a wrench  \n- **Old festival posters** (from Amsterdam, Toronto, Berlin) peeling at corners  \n\n---\n\n### **B. Performer Prep Area**  \n**a. Anchor Furniture & Installations:**  \n- **Stilt-adjustment rig** (clamp system with torque wrench)  \n- **Lockers (numbered 1-6, some with peeling name tags)**  \n- **Rubber floor mats** (for warm-up exercises)  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Performer #3’s Stilts**  \n  - Left stilt: **height 1.8m** (right stilt stuck at 1.75m)  \n  - Adjustment bolt is **stripped** (requires a 10mm hex key from toolbox)  \n- **Hydration Station** (water cooler empty, replacement jug behind locker 4)  \n- **Performance Schedule Whiteboard** (shows **\"4PM SHOW – DELAYED 10 MINS\"**)  \n\n**c. Functional Ambient Objects:**  \n- **Mirror with height markers** (for stilt calibration)  \n- **Wireless headset charging dock** (two headsets missing)  \n- **Abandoned protein shake bottle** (half-full, expired yesterday)  \n\n**d. Background & Decorative Objects:**  \n- **Polaroid photos** taped to lockers (performers in costume)  \n- **Faded motivational poster** (*\"The show must go on… carefully!\"*)  \n- **Dusty yoga mat** (rolled up in corner)  \n\n---\n\n### **C. Performance Transition Zone**  \n**a. Anchor Furniture & Installations:**  \n- **Steel safety barrier** (unlocked wheels, slight tilt)  \n- **Spotter platform** (small step ladder for crew to monitor crowd)  \n- **Sound system cart** (wired to main stage amp)  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Crowd-control rope** (one knot loose, could trip performers)  \n- **\"DINOS LOOSE!\" warning sign** (folded, needs setup)  \n- **Spare vision-correcting lens** (for stilt walkers, stored in a velvet pouch)  \n\n**c. Functional Ambient Objects:**  \n- **Clipboard with performer checklist** (last item: *\"Check suit fans – overheating risk!\"*)  \n- **Handheld spotlight** (battery at 30%)  \n\n**d. Background & Decorative Objects:**  \n- **Crushed soda can** (near trash bin)  \n- **Chalk marks** on ground (*\"DINO PATH →\"*)  \n- **Fake dinosaur footprint decals** (peeling at edges)  \n\n---\n\n### **D. Audience Interaction Plaza**  \n**a. Anchor Furniture & Installations:**  \n- **Artificial \"Jurassic\" trees** (foam, one has a **bite mark** from previous show)  \n- **Portable speaker array** (volume knob sticky)  \n- **\"Caution: Moving Dinosaurs\" sign** (fallen over)  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Prey\" prop (stuffed animal)** – must be placed correctly for \"hunt\" sequence  \n- **Broken animatronic bush** (wires exposed, needs tape)  \n- **Lost child’s toy** (dinosaur plush, left on bench)  \n\n**c. Functional Ambient Objects:**  \n- **Crowd barriers** (one hinge squeaks)  \n- **\"Quiet Zone\" marker** (for startled kids)  \n- **Spilled popcorn bag** (near performer path)  \n\n**d. Background & Decorative Objects:**  \n- **Festival banner** (flapping loose in wind)  \n- **Abandoned glow stick** (half-lit)  \n- **Distant sound of crowd murmurs**  \n\n---\n\n## **4. Scene Affordances and Embedded Potential**  \n\n### **Collaborative Transportation Affordances**  \n- **Dinosaur Suit #2 (T-Rex)**  \n  - Weight: **65kg**  \n  - Dimensions: **3m long, 2.5m tall**  \n  - Requires **two people** to lift onto hydraulic rig.  \n- **Hydraulic Lift Mechanism**  \n  - **Stuck in \"up\" position** – needs manual override (wrench in toolbox).  \n\n### **Reasoning and Tool-Use Affordances**  \n- **Attribute-based Reasoning:**  \n  - Among **five spare sound chips**, only **one** is labeled *\"RAPTOR_SCREECH_2\"* (needed for Suit #1). The rest are mismatched (bird calls, generic roars).  \n  - **Distractor:** A decorative **blue glass paperweight** on the workbench could be mistaken for a \"blue-capped\" component.  \n- **Compound (Tool-Use) Reasoning:**  \n  - **Problem:** Performer’s stilt is stuck.  \n  - **Solution:** 10mm hex key is in the **locked toolbox** (combination found on clipboard in transition zone).  \n  - **Secondary Problem:** Clipboard is buried under a **fallen barrier**.  \n\n### **Atmosphere & Realism Enhancers**  \n- **Hidden Easter Egg:** A **handwritten note** in the repair manual: *\"Beware: Suit #3’s left leg hydraulics lag by 0.5 sec!\"*  \n- **Environmental \"Noise\":**  \n  - The **hum of the industrial fan** masks subtle sounds (e.g., a dropped screw).  \n  - A **flickering LED** above the workbench casts uneven light.  \n\nThis scene is **ripe for multi-agent coordination**—whether repairing suits, managing crowd safety, or troubleshooting last-minute tech failures. Every object has **purposeful properties**, and the density ensures **emergent task complexity**.  \n\n**Final Thought:** *\"The show must go on… but only if the dinosaurs are operational!\"*"
}