{
  "id": 1471,
  "raw": "\nRetrieved from http://www.mania.com/deus-vitae-vol-01_article_81810.html\nText:\nDeus Vitae Vol. #01 -\n\nAnime/Manga Reviews\n\nMania Grade: D-\n\n0 Comments | Add\n\n\nRate & Share:\n\n\nRelated Links:\n\n\n\n  • Art Rating: C\n  • Packaging Rating: A-\n  • Text/Translatin Rating: B\n  • Age Rating: 16 & Up\n  • Released By: TOKYOPOP\n  • MSRP: 9.99\n  • Pages: 192\n  • ISBN: 1-59182-769-8\n  • Size: Tall B6\n  • Orientation: Right to Left\n\nDeus Vitae Vol. #01\n\nBy Eduardo M. Chavez     October 15, 2004\nRelease Date: June 01, 2004\n\nDeus Vitae Vol.#01\n\nCreative Talent\nWriter/Artist:Fujima Takuya\nTranslated by:Kumiko Yuasa\nAdapted by:\n\nWhat They Say\nIn the year 2068, the Brain computer - built by humans to be the core of a machine-driven earth - created selenoids, androids with abilities far superior to man. They have, in turn, created a virtually perfect society, with only one flaw in need of elimination: humans! This is the story of Ash Ramy, one of the few surviving humans in the revolution organization, bent on freeing Earth from selenoid rule, and Lemiu Winslet, a selenoid horrified by the inhumanity her race possesses. In a world of artificiality, is real love mankind's last hope?\n\nThe Review\nPackaged in a tall B6, Deus Vitae is presented in right-to-left format. The cover, on a matted finish, features Leimu Winslet in a pink outfit in front of a post-apoctolyptic background scene. The same background wraps around to the back cover, which does not have character art instead it has a very long volume description. The cover is not as fancy as the original cover for volume 1 (the character art is actually from the cover of volume 2), but it is much more relavent to the contents of this volume than Kodansha's.\n\nInside TOKYOPOP has kept 4 color pages (one featuring the original logo). The printing for color very nice, however since Fujima uses tone so much it was pretty easy to see that the black and white printing is still a bit to dark (tone bleed on some of the detailed pages).\n\nTOKYOPOP included an interesting extra at the end of the GN. They have a white on black version of the Kodansha cover art. It's pretty impressive looking and really shows off Fujima's good line work.\n\nFujiya's art has a small following for its detailing and unique blend of realism and traditional manga art. Eyes and bossums are both very large and quite detailed, but are both set in fantasy. Fujiya's eyes got a lot of work but are not very expressive. Some of that might come from most of the cast being mechanized, but even the human eyes look fake despite how nice they look. Eyes are also often assymetrical so with so many female characters looking the same I had difficulty distinguishing some of them apart. Fujiya has a fanboy attitude in regards to the female body, so while his female characters look nice their bodies are often out of proportion and defying physics. Costume designs are just plain cheesy, and for this title it works. What I found interesting is how those costumes tend to change slightly from page to page, but thats the same with bossum size, and eye position. What found most frustrating is Fujiya's overuse of tone. Its used for shading and depth but I noticed his lines look cleaner and his charatcters look better in the few panels that feature simple inking.\n\nBackgrounds look really impressive and appear to have been influenced by a variety of sci-fi titles. As great as they look, here too the laws of science do not come into play. Gravity, geology and physics are tossed out the window falling under the excuse that machines have gained strength that is beyond the science that rules them. The layout while full of variation only makes the action more confusing. Perspective is distorted and often not drawn to help tell the story instead it positions characters for maximum fanservice and soulless close-ups. Pretty but not good manga art.\n\nTranslation for D'V is pretty good. At times I noticed the dialouge sound a little funny, but it might have come from the akward source material (the story is a little inconsistent at times). I did notice that there appeared to be some inconsistency with how the main character name is spelled: at times it is Ash Ramy, others it's Ash Lamy. Hopefully that will be fixed in future printings.\n\nSFX are not translated for this title. This title does not use them as much as one would expect for an action title, but I would still like to see some form of translation for SFX either way.\n\nIn the year of the lord 2068, the age of humanity was dead and a new god, Leave, began to make its version of paradise. Created by man to provide them with mechanical salvation, their answer the the Argus program was to free them from the wrong doings of mankind. Instead for its own salvation Argus created its own answer Leave who in turn saved the machines by ridding the land of humans. Her gifts to the Earth, the selenoid, now rule the earth with imperfect beings as thier slaves. Her four daughters controled the four coners of the globe. Humans are only a wasteful by-product of a previous era without the power to realize thier dreams, but now a new faction is rebelling against Leave under the name Re-o. The human race will soon be free again, behind the actions of Ash Ramy son of humans and son of Leave.\n\nFulfilling the dream his father concieved, Ash plotted to infiltrate the selenoids by confusing the logic that these machines live by. Instead of a slave or selenoid, he was a civilian who by logic should rightfully live in peace. When captured for crimes committed under this guise, he was able to avoid death and actually impressed his captors with his unusual strength. That strength of his would eventually earn him enough respect to have audiences with very powerful figures in this machine culture. However there is much more to Ash than strength. He is human, not commanded by logic or self-preservation, so he is able to lie and trick. He also has emotion and compassion, so when the chance is right he uses all of his talents to advance his faction's plans - fusion with a parent body to gain access to thier data. Only one person could have pulled it off; luckily Ash was human enough to survive.\n\nIn Takuya's D'V mankind's fears and prejudices brought humanity to the point where they had to push the boundaries of their science and their control. They wanted to create a program that would give humanity salvation from the stresses of modern society. But they did not understand that the machine would consider mankind the biggest threat to the Earth and would eventually attempt and succeed ridding the Earth of that threat. Takuya's future is one where humanity tries to take back what it thought was theirs. Unfortunately, Takuya has not shown a change of humanities sensibilities. Instead most of his humans appear to present the worst aspects of humanity: violent, unforgiving and conceded. Even mankind's hope Ash Ramy is completely void of personality. He is conceded, self-serving and cold. He is almost as machine-like as the selenoid he opposes. In a way I believe Takuya did that on purpose, as he given Ash abilities that appear to be unique to the selenoid. Actually in many ways he is superior to the selenoid for being just as cold but unrestricted by mechanical logic. Unfortunately there is little appeal to Ash. His history is non-existent and as he has no personality there is nothing to relate to. Unfortunately the only times Ash does show emotion is in regards to sex. I guess it is a natural response but it feels very shallow and the actual sex was not necessary to the plot (what little plot there is). The supporting cast is actually more human than Ash, even if one of them is a selenoid. Lemiu is to be the future, a machine that can feel but so far she has been mainly seen crying or bathing. But what else would they do in an ideal future right?\n\nDeus Vitae has to be one of the more superficial manga I have read in ages. Now there are times when that can work for a title; Sci-fi and fantasy titles especially can really benefit from looking good on the surface, even while lacking in other departments. Unfortunately D'V has very little to offer besides T&A. Now, I know that will be enough for some, but seriously this title is one of the more forgetful meaningless titles in recent memory. There appears to be a plot but a third of the way through it is still tough to figure where it is going. The characters are completely flat. Even the action is confusing. There are times when not even naked android could save, D'V falls into this category.\n\n\nBe the first to add a comment to this article!\n\n\n",
  "response": "# **Scene Concept: \"Rebel Hideout in a Post-Synthetic World\"**  \n\n## **1. Overall Scene Theme and Core Concept**  \nInspired by *Deus Vitae*'s dystopian setting, this scene is a **clandestine human resistance hideout**, hidden within the ruins of an abandoned **machine fabrication plant**. The environment is a **fusion of retrofitted human ingenuity and decaying synthetic infrastructure**, where surviving humans repurpose salvaged android technology for their rebellion. The space is inherently **multi-agent**—large machinery requires coordinated operation, security systems demand synchronized bypassing, and resource scarcity forces teamwork in scavenging and repair.  \n\n### **Key Themes & Collaborative Potential:**  \n- **Salvage & Repurposing:** Humans retrofit old industrial spaces with jury-rigged tech.  \n- **Asymmetrical Capabilities:** Some tasks require brute strength (moving heavy debris), others precision (hacking terminals).  \n- **Hidden Infrastructure:** Concealed compartments, false walls, and trapdoors force agents to work together to uncover secrets.  \n\n---\n\n## **2. Spatial Layout and Area Descriptions**  \n\n### **A. Main Workshop (Central Hub)**  \nThe heart of operations, where rebels modify stolen android components. Exposed wiring dangles from the ceiling, and workbenches are cluttered with half-disassembled machinery. A **large hydraulic lift** dominates the center, currently holding a **partially dismantled Selenoid combat chassis (3m tall, 500kg, missing its left arm)**.  \n\n### **B. Communications & Hacking Nook**  \nA cramped alcove with **salvaged terminals (CRT monitors flickering with static), a server rack (three of five modules functional)**, and a **hand-cranked radio transmitter (missing its antenna, jury-rigged with copper wire)**. A **whiteboard** with smeared marker notes lists intercepted machine patrol routes.  \n\n### **C. Storage & Armory (Hidden Behind False Wall)**  \nA reinforced steel door (locked via **biometric scanner**, rigged to accept a **repurposed Selenoid finger**). Inside:  \n- **Weapons rack** (three pulse rifles, two with drained power cells).  \n- **Crates of scavenged android cores** (each **labeled with hazard symbols**, one leaking coolant).  \n- **A floor safe (30cm³, digital keypad, last used to store encrypted data drives)**.  \n\n### **D. Sleeping Quarters (Improvised Barracks)**  \nMakeshift cots, **a broken med-bot repurposed as a nightlight**, and a **wall-mounted bulletin board** with faded photos of missing rebels. A **rusted ventilation duct (partially pried open)** leads to an escape tunnel.  \n\n### **E. Exterior: Rooftop Lookout**  \nA **cracked reinforced glass skylight** offers surveillance. A **dismantled sniper rifle (missing its scope)** leans against a sandbag barrier. Below, a **grappling hook and rope** are anchored to the ledge.  \n\n---\n\n## **3. Detailed Area-by-Area Inventory**  \n\n### **A. Main Workshop**  \n\n#### **a. Anchor Furniture & Installations:**  \n- **Hydraulic Lift Platform (3m x 2m, 500kg capacity, currently occupied by Selenoid chassis)**  \n- **Industrial Workbench (steel frame, scorch marks, clamps holding a disassembled plasma cutter)**  \n- **Overhead Crane (rusted, manual pulley system, max load 200kg)**  \n\n#### **b. Key Interactive & Task-Relevant Objects:**  \n- **Selenoid Chassis (500kg, missing left arm, exposed wiring in torso cavity)**  \n- **Plasma Cutter (jammed, requires two people to recalibrate)**  \n- **Tool Wall (wrenches, screwdrivers, a biometric lockpick set inside a dented tin)**  \n\n#### **c. Functional Ambient Objects:**  \n- **Welding Torch (fuel tank at 30%)**  \n- **Parts Bin (scattered servo motors, one labeled \"FOR LEMIU'S PROJECT\")**  \n- **Dirty Coffee Mug (chipped, half-full of cold liquid)**  \n\n#### **d. Background & Decorative Objects:**  \n- **Faded Blueprint (tacked to wall, corners torn)**  \n- **Graffiti (\"MACHINES BREAK. WE DON’T.\")**  \n- **Broken Monitor (displaying a frozen error message)**  \n\n---\n\n### **B. Communications & Hacking Nook**  \n\n#### **a. Anchor Furniture & Installations:**  \n- **Server Rack (five modules, two blinking erratically)**  \n- **Salvaged Terminal (keyboard missing ‘E’ and ‘R’ keys)**  \n\n#### **b. Key Interactive & Task-Relevant Objects:**  \n- **Encrypted Data Drive (plugged in, progress bar at 67%)**  \n- **Hand-Crank Radio (antenna broken, copper wire replacement)**  \n\n#### **c. Functional Ambient Objects:**  \n- **Stack of Floppy Disks (labeled \"ARCHIVE 12-B\")**  \n- **Duct-Taped Headphones (left ear silent)**  \n\n#### **d. Background & Decorative Objects:**  \n- **Coffee Stain on Desk (ring-shaped, old)**  \n- **Dusty Rubik’s Cube (partially solved)**  \n\n---\n\n## **4. Scene Affordances and Embedded Potential**  \n\n### **Collaborative Transportation Affordances:**  \n- **Selenoid Chassis (500kg, requires crane + two agents to maneuver)**  \n- **Hydraulic Lift (jammed, needs simultaneous lever pulls to lower)**  \n\n### **Reasoning & Tool-Use Affordances:**  \n- **Biometric Lock (requires finding the correct Selenoid finger in storage)**  \n- **Encrypted Data Drive (password hint hidden in a bulletin board photo)**  \n\n### **Compound Tool-Use Example:**  \n- **Problem:** Jammed Plasma Cutter  \n- **Solution:** Recalibration requires **two wrenches (one in toolbox, one under workbench)** and **a power cell (stored in armory)**.  \n\n---\n\n### **Final Notes:**  \nThis environment is **dense with interactive potential**, forcing agents to **communicate, delegate, and problem-solve collaboratively**. The **sheer physicality of objects** (weight, state, location) ensures that no single agent can operate alone, while the **layered puzzles** (decryption, repairs, security bypasses) demand logical reasoning amidst realistic clutter. The **lived-in details** (coffee stains, graffiti) provide atmospheric depth, while the **strategically placed \"noise\"** (similar-looking tools, misleading labels) heightens the need for precision.  \n\n**This is a stage primed for conflict, cooperation, and survival.**"
}