{
  "id": 1483,
  "raw": "\nRetrieved from http://www.scmp.com/comment/insight-opinion/article/1390785/post-2008-we-need-fairer-system-global-governance\nText:\n• Sat\n  • Dec 27, 2014\n  • Updated: 11:28pm\nCommentInsight & Opinion\n\nPost 2008, we need a fairer system of global governance\n\nHe Yafei says five years after the global financial crisis, China and othe rdeveloping economies have become the leading engines of growth, but a fairer global order has yet to fully emerge\n\nPUBLISHED : Saturday, 28 December, 2013, 4:47am\nUPDATED : Saturday, 28 December, 2013, 4:47am\n\nIt has been more than five years since the global financial crisis caught us unprepared in 2008. What lessons have we learned? Looking back, nobody will miss the fact that the world has undergone some tremendous changes. In fact, 2008 proved to be a turning point both for China and the world as a whole.\n\nFirst and foremost, the \"Washington Consensus\", with its roots in neo-liberalism that had dominated the global economic landscape since its inception in 1990, met its demise that year.\n\nIn sharp contrast, the \"Beijing Consensus\" as represented by China's rapid economic growth has gained worldwide attraction, particularly in developing countries.\n\nIn the two decades before the crisis, the Washington Consensus, with its core policy of \"privatisation, liberalisation and marketisation\", was aggressively pursued by Western countries and the key institutions of the International Monetary Fund and World Bank.\n\nIt was viewed as \"economic panacea\" and force-fed to developing countries in Latin America, Africa, Eastern Europe and Southeast Asia so that they could access the rescue funds available from the IMF and the World Bank. As a result, these countries suffered economic disasters that pushed them into the malaise of the middle-income trap.\n\nUnder the disguise of financial innovation, huge amounts of capital were dispersed all over the world, producing asset bubbles and disconnection from the real economy and leading to a derivative-laden financial market that eventually had a total meltdown in 2008.\n\nThe fact is the balance of power between advanced nations and developing countries has been tipping in favour of the latter in the last five years. This certainly has intricate geopolitical and geo-economic implications all over the world.\n\nTo name a few: China and other emerging economies have now become new engines of global economic growth and recovery, contributing more than 50 per cent to world economic growth in the last five years. And the replacement of the US-dominated G7/G8 by a more balanced G20 as the primary platform for global economic governance is another sobering example. That took place at the G20 summit in Pittsburgh in 2009.\n\nThis clearly demonstrates that developing countries such as China, India, Brazil and South Africa are entering the inner circle of international economic decision-making and, furthermore, that Western countries can no longer claim to have total control of world economic affairs.\n\nGlobal governance reform - as indicated by moves to redistribute the voting shares in the International Monetary Fund and World Bank - will contribute to the development of an international economic order that is more just and fair.\n\nHowever, we should watch out for some negative developments in global governance. Advanced nations led by the US are seemingly abandoning multilateralism in favour of \"alliance-of-the-willing\" type of free trade arrangements such as the Trans-Pacific Partnership and Transatlantic Trade and Investment Partnership that exclude China and other major developing nations. Such regional efforts are by themselves not negative, but when they involve geo-strategic considerations, they definitely change \"the rules of game\" and become more complicated.\n\nThe financial crisis and its aftermath have brought forth the urgency in reforming the existing global governance structure. If not for the collective timely action by G20 right after the crisis, the world economy would have crashed. It is therefore right to wonder whether an economic system built on the heels of the end of second world war is still relevant.\n\nThe clarion call for a new system has been sounded already, and action is called for.\n\nThe world economy is now in bad shape with advanced nations experiencing high debt, high unemployment and really slow growth, anticipating years of \"Japanese stagnation and deflation\".\n\nAnother danger comes from the repeated quantitative easing applied abundantly by the US, the European Union and Japan that has resulted in asset bubbles everywhere with emerging countries being the most vulnerable victims.\n\nThe balance sheet of the US Federal Reserve has increased from US$900 billion before the crisis to the present figure topping US$4 trillion. The average debt-to-GDP ratio for advanced nations is currently 126 per cent. In this high debt and the flooding of liquidity the world over are buried the seeds for a possible repeat of the financial crisis we witnessed in 2008.\n\nLast but not the least, the financial and economic crises have fragmented the social fabric of many countries, including those in the West. Protests such as the Occupy Wall Street movement and the Arab Spring as well as large-scale riots have become daily occurrences. Short-term election cycles have hijacked the administrations of many a Western nation with ensuing social crisis one after another.\n\nIt is estimated by the International Labour Organisation that by 2015 the total global unemployment will reach 208 million, with a quarter in the euro zone. No doubt governments are worried.\n\nYet, the crisis has not undermined the global economic order fundamentally. The US is still the most dynamic and innovative economy and US dollar the major international reserve currency.\n\nThere is a long way to go before a more just and equitable global economic order and governance structure emerge.\n\nChina has chosen the developmental path of socialism with Chinese characteristics. The past several decades have proven beyond any doubt that China is heading in the right direction.\n\nChina's development and advance is intertwined closely with that of the rest of the world. The further growth of China not only benefits its people, but also the whole world.\n\nHe Yafei is deputy director of the Overseas Chinese Affairs Office of the State Council\n\n\nFor unlimited access to:\n\nSCMP.com SCMP Tablet Edition SCMP Mobile Edition 10-year news archive\n\n\n\nThis article is now closed to comments\n\nIn order to understand the current European and US economic calamity you need to know the true banking dynasty's 250 years history. Then you need to study the pyramid structure of the western banking industry. Then you'll need to not only follow the money trail but the motives behind the transactions. After you have all the fundamentals and knowledge of who is controlling the global money supply, stock market, precious metal prices, population control and what The Banking Dynasty will absolutely not compromise. You will know the inevitable catastrophe is just around the corner.\nA New World Order! Muahahahah!\nThis article is thinly disguised pro-Chinese propaganda.\nWhatever changes in governance emerge to achieve \" a more just and equitable global economic order and governance structure\" they certainly won't come from China or the other developing economies which are too mired in corruption and disrespect for the Rule of Law to want to bring about any advantages to anyone but themselves.\n\n\nSCMP.com Account\n",
  "response": "### **Scene Concept: \"Global Economic Crisis War Room\"**  \n\n**Overall Scene Theme and Core Concept:**  \nA high-stakes, time-sensitive emergency response center where international financial analysts, policymakers, and crisis managers collaborate to stabilize a teetering global economy. The scene is inspired by the geopolitical tensions and economic fragility described in the article, translating abstract financial governance into a tangible, multi-agent environment.  \n\nThe war room is inherently collaborative due to:  \n- **Information Asymmetry:** No single agent has all the data; critical reports are scattered across the room, requiring coordination.  \n- **Physical Constraints:** Heavy equipment, time-sensitive document processing, and secure systems demand teamwork.  \n- **Dynamic Crisis States:** Real-time data feeds, malfunctioning displays, and urgent decisions create emergent problems.  \n\n---  \n\n### **Spatial Layout & Area Descriptions**  \n1. **Central Strategy Hub** – Dominated by a massive circular table with embedded touchscreens, surrounded by ergonomic chairs. Real-time stock tickers and crisis alerts flash on wall-mounted LED panels.  \n2. **Data Analysis Nook** – Cluttered with workstations, strewn research papers, and a large, outdated printer jammed with half-printed emergency bulletins.  \n3. **Secure Archives Vault** – A locked side room containing classified financial records. Requires dual authentication (keycard + fingerprint).  \n4. **Breakout Lounge** – A tense relaxation zone with a coffee machine (out of water), a fridge (containing expired energy drinks), and a whiteboard covered in half-erased contingency plans.  \n\n---  \n\n### **Detailed Area-by-Area Inventory**  \n\n#### **1. Central Strategy Hub**  \n**a. Anchor Furniture & Installations:**  \n- **8-seat circular conference table**, 3m diameter, with embedded touchscreens (one flickering intermittently).  \n- **Wall-mounted 4K LED ticker board**, displaying real-time market crashes (currently frozen on \"EUROZONE DEBT CRISIS ALERT\").  \n- **Overhead projector**, slightly misaligned, casting a blurry G20 summit map onto a side wall.  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Crisis Dossier Briefcase** (locked, combination hidden under a chair; contains the \"Black Swan Protocol\" document).  \n- **3 emergency landline phones** (one off-hook, emitting a dial tone; one with a \"LINE DEAD\" post-it).  \n- **Heavy server rack** (300kg, requires 2+ agents to move; houses the last backup of pre-crisis trade agreements).  \n\n**c. Functional Ambient Objects:**  \n- **Digital signature pad** (low battery warning blinking).  \n- **Label maker** (out of tape, with a half-printed label reading \"ECONOMIC COLLAP—\").  \n- **Adjustable desk lamps** (one stuck in the \"tilted down\" position, illuminating a coffee stain on a report).  \n\n**d. Background & Decorative Objects:**  \n- **Framed photo of the 2009 G20 summit**, glass cracked.  \n- **Dead potted fern** in the corner, soil spilled on the carpet.  \n- **\"In Case of Meltdown\" emergency poster**, partially torn.  \n\n---  \n\n#### **2. Data Analysis Nook**  \n**a. Anchor Furniture & Installations:**  \n- **Four clustered workstations**, each with dual monitors (one displaying a \"NO SIGNAL\" error).  \n- **Overflowing bookshelf**, sagging under IMF/WB annual reports (2008 edition bookmarked with a dollar bill).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Jam-prone laser printer** (paper tray stuck; requires manual alignment to print the latest bailout proposal).  \n- **External hard drive** (labeled \"BACKUP – DO NOT ERASE\", plugged into a glitching USB hub).  \n- **Red ledger book** (handwritten, last entry: \"QE4 – RISK: HIGH\").  \n\n**c. Functional Ambient Objects:**  \n- **Calculator** (missing the \"=\" button).  \n- **Stapler** (empty, with a single stray staple on the desk).  \n- **Headset** (left earphone silent).  \n\n**d. Background & Decorative Objects:**  \n- **Coffee cup rings** staining a spreadsheet titled \"Contingency Plan Draft 17\".  \n- **Post-it note** with scribbled phone numbers, half peeled off.  \n- **Dusty globe** (stuck spinning on its axis).  \n\n---  \n\n#### **3. Secure Archives Vault**  \n**a. Anchor Furniture & Installations:**  \n- **Steel-reinforced door** with dual biometric locks (fingerprint scanner flickering; keycard slot slightly bent).  \n- **Industrial shelving units** (overloaded with labeled document boxes).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **\"Classified\" dossier box** (sealed with tamper-evident tape; requires scissors from the lounge to open).  \n- **Fireproof safe** (400kg; contains the master key to reset the war room’s systems).  \n- **Dehumidifier** (full water tank; must be emptied to prevent damage to papers).  \n\n**c. Functional Ambient Objects:**  \n- **Barcode scanner** (low battery).  \n- **Magnifying glass** (left on top of a microfilm reader).  \n\n**d. Background & Decorative Objects:**  \n- **Outdated \"TOP SECRET\" posters** from the 1990s.  \n- **Spiderweb** in the corner near a vent.  \n\n---  \n\n### **Scene Affordances & Embedded Potential**  \n\n#### **Collaborative Transportation Affordances:**  \n- **Server rack (300kg)** – Requires 2+ agents to move, blocking access to a critical ethernet port needed to reboot the main display.  \n- **Fireproof safe (400kg)** – Impossible for one agent to shift; must be relocated to access a hidden floor panel.  \n\n#### **Reasoning & Tool-Use Affordances:**  \n- **Attribute-Based Reasoning:**  \n  - Among **five labeled document boxes**, only one has the correct dossier:  \n    - *\"Box A\"* – \"1997 Asian Crisis\" (blue label, dust-covered).  \n    - *\"Box D\"* – \"2008 Collapse\" (red label, slightly torn, with a coffee stain).  \n    - *\"Box E\"* – \"202X Recovery Plan\" (sealed with a broken wax seal).  \n  - **Distractor:** A decorative blue binder on the shelf mimics the dossier’s color.  \n\n- **Compound Tool-Use Reasoning:**  \n  - **Problem:** The locked Crisis Dossier Briefcase requires a 4-digit code.  \n  - **Solution:** The code is written on a whiteboard in the lounge—but the whiteboard is partly erased. Agents must cross-reference coffee-stained notes to reconstruct it.  \n\n---  \n\n**Final Notes:**  \nThis environment is **dense with perishable states** (glitching tech, expired items, jammed machinery) and **layered puzzles** requiring precise coordination. The geopolitical tension of the inspiration text is translated into a physical space where every object has a role—or a malfunction waiting to disrupt the mission.  \n\n**Potential Tasks:**  \n- Reboot the frozen ticker display by retrieving a backup drive (collaborative heavy lifting + debugging).  \n- Decipher the correct dossier under time pressure (attribute matching amid distractors).  \n- Negotiate with another team to share the lone functioning landline (social reasoning).  \n\nThe scene is a **pressure cooker of collaborative problem-solving**—exactly what a global crisis demands."
}