{
  "id": 1494,
  "raw": "\nRetrieved from http://www.theguardian.com/world/2012/may/01/indian-ferry-capsizes-brahmaputra\nText:\nIndian ferry capsizes drowning more than 100 in Brahmaputra river\n\nDivers and rescue workers pull bodies from remote reach of river in Assam state as search for survivors goes on\nFerry capsizes in India\nThe ferry sank on the Brahmaputra river, in the north-eastern Indian state of Assam. Photograph: Utpal Baruah/Reuters\n\nArmy divers and rescue workers have pulled 103 bodies out of a river after a packed ferry capsized in heavy winds and rain in a remote part of north-eastern India.\n\nAt least 100 people were still missing after the boat, carrying about 350 passengers, broke into two pieces late on Monday, said Pritam Saikia, the district magistrate of Goalpara district.\n\nDeep-sea divers and soldiers worked through the night to pull bodies from the Brahmaputra river, in Assam state.\n\nHeavy winds and rain after the accident hampered rescue operations, said Tarun Gogoi, Assam's chief minister.\n\n\n\nDivers and rescue workers with rubber rafts were searching the river for survivors amid the floating debris, which was all that remained of the ferry.\n\nIndia Assam ferry disaster\nThe Assam ferry disaster happened close to where the river enters Bangladesh\n\nOne passenger, Hasnat Ali, told local television about 200 people had been packed inside the boat, along with cargo, and that he and around 150 others had been riding on the roof when a storm hit as the ferry headed to the shore to dock. The boat was tossed about, and people on the roof were thrown off, though many of them managed to swim to shore before the ferry was dashed to pieces, he said.\n\nAli said he had managed to cling to a log and was rescued by local villagers.\n\nThe Assam state police chief, JN Choudhury, said passengers travelling on the top level had been saved.\n\nChoudhury said the accident had occurred near Fakiragram village, in west Dhubri district, about 215 miles west of the state capital, Gauhati, and close to where the Brahmaputra enters Bangladesh. He said officials in that country had been contacted for help.\n\nThe area is dotted with riverside settlements and small islands, and boats are the most common mode of transport. Most ferries are overcrowded, and pay little heed to safety regulations.\n\nMohan Lal, a senior officer with the border security force, said 35 troops were at the accident site on boats, and were using handheld searchlights to look for passengers after daylight faded.\n\n\n\nThe Indian prime minister, Manmohan Singh, issued a statement expressing shock and grief at the loss of life.\n",
  "response": "# **Scene Concept: Emergency Riverfront Rescue & Recovery Base**  \n\n## **1. Overall Scene Theme and Core Concept**  \n**Scene Type:** A temporary, chaotic riverside emergency response base established after a ferry disaster on the Brahmaputra River.  \n**Core Challenge:** A high-stakes, multi-agency operation where teams of divers, medics, logistics personnel, and local volunteers must coordinate in harsh conditions to recover survivors, identify victims, and manage supplies—all while navigating limited resources, environmental hazards, and bureaucratic friction.  \n\n**Why Multi-Agent?**  \n- **Heavy & Bulky Objects:** Rescue equipment (inflatable rafts, oxygen tanks) requires teamwork to move.  \n- **Specialized Roles:** Divers, medics, supply runners, and officials must communicate to avoid bottlenecks.  \n- **Dynamic Conditions:** Rain, wind, and river currents alter accessibility, forcing real-time adjustments.  \n\n---\n\n## **2. Spatial Layout and Area Descriptions**  \nThe base is set up on a muddy riverbank near the wreckage, under a stormy sky. The areas are:  \n\n1. **Command & Communication Tent** – A hastily erected military-grade tent with radios, maps, and a frantic coordinator.  \n2. **Medical Triage Zone** – A cluster of folding cots, IV stands, and emergency supplies under a tarp.  \n3. **Diver Preparation & Equipment Depot** – Neoprene wetsuits hung to dry, oxygen cylinders, and underwater lamps.  \n4. **Debris Sorting & Evidence Area** – A grid of tagged personal belongings, broken ferry parts, and body bags.  \n5. **Local Volunteer Hub** – Fishermen and villagers bringing food, blankets, and improvised tools (ropes, hooks).  \n6. **River’s Edge & Recovery Rafts** – Slippery mud leading to anchored inflatable boats with grappling hooks.  \n\n---\n\n## **3. Detailed Area-by-Area Inventory**  \n\n### **1. Command & Communication Tent**  \n**a. Anchor Furniture & Installations:**  \n- A collapsible aluminum table (2m x 1m) with a water-stained topographic map of the river pinned under a rusted wrench.  \n- A military-grade radio set (on, crackling with static, battery at 30%).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Rescue Grid Whiteboard** – Lists missing persons (handwritten, smudged by rain).  \n- **Satellite Phone** – Low signal, requires adjusting the external antenna.  \n- **District Magistrate’s Briefcase** – Locked, contains manifests of ferry passengers.  \n\n**c. Functional Ambient Objects:**  \n- A dented thermos (half-full of cold coffee).  \n- A stack of rain-warped incident report forms.  \n\n**d. Background & Decorative Objects:**  \n- A torn \"Safety First\" poster flapping in the wind.  \n- Muddy boot prints leading in and out.  \n\n### **2. Medical Triage Zone**  \n**a. Anchor Furniture & Installations:**  \n- Folding cots (some occupied by survivors wrapped in foil blankets).  \n- A wheeled IV stand (one bag nearly empty).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Emergency Medical Kit** – Missing the sterile gauze (last one used).  \n- **Hypothermia Blanket Heater** – Requires refilling with propane.  \n\n**c. Functional Ambient Objects:**  \n- A clipboard with triage tags (green/yellow/red).  \n- A stethoscope left on a stool.  \n\n**d. Background & Decorative Objects:**  \n- A child’s waterlogged teddy bear in a plastic evidence bag.  \n- Discarded latex gloves in a bin.  \n\n### **3. Diver Preparation & Equipment Depot**  \n**a. Anchor Furniture & Installations:**  \n- A rusted metal rack holding 12 oxygen tanks (6 full, 4 empty, 2 leaking).  \n- A wooden bench with neoprene wetsuits (some still damp).  \n\n**b. Key Interactive & Task-Relevant Objects:**  \n- **Underwater Floodlight** – Battery dead, needs replacement.  \n- **Grappling Hook Rope** – Frayed at one end.  \n\n**c. Functional Ambient Objects:**  \n- A bucket of murky river water (used to rinse gear).  \n- A toolbox with a broken pressure gauge.  \n\n**d. Background & Decorative Objects:**  \n- A faded \"Dive Team\" patch peeling off a backpack.  \n- A waterlogged copy of *River Rescue Protocols* on the ground.  \n\n*(Continued similarly for remaining areas.)*  \n\n---\n\n## **4. Scene Affordances and Embedded Potential**  \n\n### **Collaborative Transportation Affordances**  \n- **Oxygen Tanks (150kg, 1.5m tall)** – Too heavy for one person; requires two to lift into rafts.  \n- **Inflatable Rescue Raft (3m long, 80kg when dry)** – Needs four people to carry when waterlogged.  \n\n### **Reasoning & Tool-Use Affordances**  \n- **Attribute-Based Reasoning:** Five tagged personal bags in the debris area—only one has a **blue luggage tag with \"Ali\" scribbled in marker** (must distinguish from similar bags).  \n- **Compound Reasoning:** The **locked briefcase** in the command tent can only be opened with a **key kept in the diver depot’s toolbox**, requiring coordination between officials and divers.  \n\n### **Environmental & Sensory Layers**  \n- **Sound:** Distant thunder, radio static, groaning metal from the wreck.  \n- **Light:** Flickering emergency lanterns, flashlight beams cutting through rain.  \n- **Smell:** Wet mud, antiseptic, and the faint metallic tang of river water.  \n\n---\n\nThis design ensures a **high-density, high-stakes** environment where agents must **communicate, prioritize, and adapt**—mirroring the chaos and urgency of the original disaster while grounding it in tactile realism."
}